{
  "data": {
    "proposals": [
      {
        "createdTimestamp": "1695565715",
        "description": "# Nounishpunk Playable Demo\n\n**The biggest Nounish game ever in development**\n## Tl;dr:\n\nWe are asking 24 ETH to launch the **playable demo** in December.\n\nClick on the image below to watch the game trailer\n[![](https://hackmd.io/_uploads/r1DOskckT.png)](https://twitter.com/nounishpunk/status/1699797131211743252?s=20)\n\n\n## Description \n\nAfter experiencing the process of prototyping and designing various Nounish games, we propose that Nouns DAO collaborates with Genius Slackers to launch a playable demo of the Nounishpunk game on the Steam store. Following player feedback, our intention is to release the full game by the end of 2024.\n\nThis specific proposal aims to secure funding for the release of the playable demo in December on the Steam store.\n\nUpon the release of the playable demo, the DAO will decide whether to provide further funding for the game.\n\n> **The full game will be released on the following top stores in 2024:**\n> \n>  - Steam Store\n>  - PlayStation Store\n>  - Xbox Store (Microsoft Store)\n>  - Epic Games Store\n>  - Nintendo Switch eShop\n\n---\n\n## Proposal Ask:\n\nWe are requesting **24 ETH** for a period of **60 days** to cover the following:\n - Final polishing of the playable demo.\n**`This crucial phase involves meticulous refinement to ensure a flawless gaming experience. It encompasses various tasks, such as fine-tuning character animations for seamless gameplay, replacing test sound effects and visual effects with their final counterparts to enhance immersion, conducting rigorous technical testing and debugging to eliminate any potential issues, and optimizing the final content for compatibility across a wide range of devices. Our goal is to deliver a polished, bug-free, and captivating demo that showcases the full potential of 'Nounishpunk' to our audience.`**\n\n - Production of marketing content and materials.\n**`This encompasses the creation of a wide range of promotional materials, including eye-catching posters, captivating trailers, and stunning concept art. These assets will be strategically designed to engage our target audience, build excitement, and effectively communicate the unique features and appeal of 'Nounishpunk' to potential players and supporters.`**\n\n*We are committed to providing propdates along the way.*\n\n---\n\n## Why 'Nounishpunk' Deserves DAO's Support?\n\nCheck out the excitement! People can't stop asking about the intriguing world of 'Nounishpunk' and its unique connection to the Nouns DAO. See how curiosity is piqued and interest is sky-high. It's clear that the Nouns culture is sparking intrigue far and wide through the Nounishpunk game.\n\n![](https://hackmd.io/_uploads/HyKHuRY1T.png)\n\n![](https://cdn.discordapp.com/attachments/614803058773196800/1154427287471665202/ezgif-5-8ec4b59c12.gif)\n\n**Here's the question:** Is a Nounish game designed to introduce players to Nouns DAO and its culture worthy of support and funding from DAO?\nWe believe that this game has the potential to generate significant exposure and positive advertising for DAO. Although we haven't even initiated a press release for the game, and without any external funding, we've strived to familiarize DAO with the world we've crafted, but we received encouraging feedback and it shows us that even with a small amount of support from DAO, we can make a significant impact.\n\n---\n## Who Are We?\n\nThe Genius Slackers team is an independent producer of video games. The company was founded in 2016 by Arash Negahban and Saeed Abbasi.\n\nYou probably know [Arash](https://twitter.com/ArashSlacker) for the animations and music videos he made for NounsDAO!\nHere’s some of the work I have done:\n\n- [Lil Nouns Music Video](https://twitter.com/ArashSlacker/status/1603321209613127680?s=20&t=7reei4hWvrg9tCth14J7MA) funded by Lil Nouns' [Content Pod](https://discord.com/channels/954142017556979752/1016388331602460773); music video!\n* This [Put Your Noggles On](https://www.youtube.com/watch?v=HnNIvVETNvY); music video!\n* Animation promoting [lil nouns DAO](https://twitter.com/lilnounsdao/status/1685286013659209728?s=20).\n- this [Shrimpy Noun in a Burger](https://www.youtube.com/watch?v=5e-3rIzsQWw) music video;\n- this [I'm The Bomb animation video](https://www.youtube.com/watch?v=cQjWXc2EHQk);\n- or this [Nounish GIPHY channel](https://giphy.com/channel/ArashNegahban/nounish) hosting a growing set of Nounish GIFs;\n- additionally, if you take a look at [my Twitter media](https://twitter.com/ArashSlacker/media), you will find even more Nounish animation content I have made in the past six months.\n\n![](https://cdn.discordapp.com/attachments/1140710821878579325/1149368704363155546/ezgif-2-a85cb9a938s.gif)\n\n---\n\n## External Nounishpunk Partner \n\nWe are excited to unveil our partnership with **[Nouns Factory](https://nounsfactory.com)**.\nIn this collaboration, we are proud to be the creative force behind the 3D rendition of their distinctive clothing line. These designs will be seamlessly integrated into our game, allowing players to customize their avatars with these exclusive clothing options. What's particularly intriguing is that players will also have the opportunity to directly purchase these real-world garments through the game.\n\nThrough this endeavor, we are introducing players to the world of Nousnish fashion, inspiring them to become patrons of Nouns Factory. With each real-world purchase of these showcased garments, we will receive a share of the proceeds.\n\nIn addition to our collaboration with \"**Nouns Factory**\", we are excited to partner with\n- [**Comics DAO**](https://twitter.com/ComicsDAO)\n- [**Public Good**](https://twitter.com/PublicGoodBeer) \n- [**Stickers.fun**](https://stickers.fun/en) \n- [**Noggle Chair**](https://twitter.com/Nounscn) \n- [**Gnars.**](https://twitter.com/gnars_dao) \n- [**Lil Bevs**](https://twitter.com/LilBevsByLils)\n\n\n These outstanding projects, funded by NounsDAO, bring immense potential for seamless integration into the world of Nounishpunk, perfectly complementing its unique art style.\n\n> In the game, our protagonist rides a skateboard inspired by 'Gnars,' showcasing incredible tricks along the edges of 'Noggle Chairs.' He reenergizes with 'Public Good' drinks for that extra turbo boost while tackling side-missions and achievements intricately connected with 'ComicsDAO.' All of this unfolds within a futuristic cityscape adorned with Nounish art, particularly when equipped with the stylish 'Nouns Factory-Style' shirt and Nounish weapons that can be customized with decals from 'Stickers.fun.'\n\n\nThis promises to be the most Nounish project ever, offering an immersive experience where these remarkable brands seamlessly blend with Nounishpunk's distinctive universe.\n\n![](https://cdn.discordapp.com/attachments/1147984938650578945/1149376993171869706/ezgif-3-Comic_Sticer.gif)\n\n---\n## What is Nounishpunk?\n\n* **Introduction**\nNounishpunk is an exhilarating, fast-paced third-person comedy action-adventure shooter set in an open world, boasting a captivating fantasy futurism art style.\nThe game thrusts players into an action adventure as they step into the shoes of a heroic figure. In a fantastical realm known as Nounish World, rebel forces have unleashed their wacky robots, threatening the very essence of their planets. As the chosen hero, your ultimate mission is to stand against these rebels, demolish their robotic enforcers, and restore order to the Nounish planets.\n\n**Click on the image below to watch the WIP gameplay video**\n[![](https://hackmd.io/_uploads/rkwjsJqya.png)](https://youtu.be/ErRAp9M_6fc)\n\n\n* **Story**\nRebels are causing a ruckus on one of the beloved Nounish planets with their wacky robots! They've taken people, hostage.\nThey're plotting to misuse the voting power of hostages in the DAO for some shady stuff.\nDAO is set to make a game-changing decision to tackle this situation.\n![](https://cdn.discordapp.com/attachments/1147984938650578945/1149377054014455838/ezgif-2-3f500sa186a.gif)\n\n\n* **World Building**\nIn the captivating realm of Nounishpunk, a universe brimming with sci-fi wonders, the very fabric of existence resonates with Nounish essence. Inhabitants are known as Nouns and Lilnouns, and governance takes the form of a collaborative group known as Nouners operating within a DAO. Across diverse Nounish planets, decisions are shaped by the power of collective votes, weaving a unique tapestry of control.\nHowever, beneath this intricate harmony, AI technology has surged to an alarming pinnacle, casting an ominous shadow over the world's delicate equilibrium.\n![](https://cdn.discordapp.com/attachments/1147984938650578945/1149382044313456660/ezgif-5-Map.gif)\n\n* **Art Style**\nThe art style of Nounishpunk boasts a fantasy-stylized aesthetic characterized by gracefully curved shapes. Nature's elements sport unconventional colors; expect to encounter blue trees and other unexpected hues. Characters themselves may feature unique anatomical traits, such as an apple-head character, adding to the game's distinctive visual allure.\n![](https://cdn.discordapp.com/attachments/1147984938650578945/1149377053385302117/ezgif-2-1800d3f60ds.gif)\n\n* **Key Features**\n  - Riding a motor skateboard as the primary mode of transportation throughout the game world.\n  - Fast-paced action with a captivating futurism art style.\n  - Infused with engaging comedy elements.\n\n\n---\n\n**Gameplay loop**\n1.  **Exploration and Discovery:** Begin your journey by exploring the vibrant Nounish city, mastering your Nounish tools, and zipping around on your trusty motor skateboard to uncover hidden secrets.\n1.  **Engaging Enemies:** Dive into action through both main and side missions, where you'll face off against enemies using unique Nounish weapons and tools.\n1.  **Epic Boss Fights:** Experience breathtaking showdowns at iconic locations like speeding trains, towering skyscrapers, and colossal ships, with each boss battle offering a distinct challenge and atmosphere.\n1.  **Mission Accomplishments:** Embark on a variety of quests throughout the city, from rescuing hostages to infiltrating enemy strongholds and solving intricate puzzles.\n1.  **Score Collection and Upgrades:** Gather valuable items and scores to enhance your Nounish arsenal, empowering you to overcome even the toughest challenges.\n1.  **Immersive Storytelling:** Immerse yourself in a gripping narrative filled with memorable characters, allies, and enemies as you play a pivotal role in advancing the game's compelling story.\n\n\n---\n\n* **Target Users**\nNounishpunk is tailored for gamers who enjoy action-adventure and shooter games with a fantasy flair. If you're into fast-paced action and a unique art style, this is the game for you.\n\n  Nounishpunk immerses you in Nounish adventures as if you were living them!\n\n\n* **Target Platforms**\nThe **playable demo** of the game will be released in **December** only on the **Steam Store**.The full game, however, will first be released on PC and consoles at the end of **2024**, followed by releases on Nintendo Switch and mobile devices in the following year.\n\n**For additional visual details, please visit the game's **[Store Page](https://store.steampowered.com/app/2568760/Nounishpunk/)** and consider adding it to your wishlist.**\n \n[![](https://hackmd.io/_uploads/SJKLnOPRn.png)](https://store.steampowered.com/app/2568760/Nounishpunk/)\n\n---\n\n\n **We genuinely thank you for taking the time to consider this proposal, and we eagerly look forward to the chance to showcase Nounishpunk's capabilities.**",
        "title": "Nounishpunk Playable Demo",
        "id": "387"
      },
      {
        "createdTimestamp": "1695509891",
        "description": "# Sail Nouns: NFT.NY, J/24 World Sailing Championship, and Olympics\n\n![](https://i.imgur.com/7uN5xdw.jpg)\n### TL;DR\n- **[April 3rd, 2024]** Sail with Nouns in New York Harbor for NFT.NYC 2024\n    - Gather the Nounish community on a big boat during NFT.NYC. The New York evening view is the best place to take photos while wearing Noggles.\n- **[October 2023 to April 2024]** Support two Olympic sailors during the qualification rounds for the Paris Olympics.\n    - In 2024, all the focus will be on the Summer Paris Olympics. I propose to sponsor two Olympic athletes and explore opportunities for organic sponsorship to promote Noggles in the Olympics.\n- **[October 2023 to September 2024]** Road to the J/24 World Sailing Championship in Seattle, WA\n    - Continue building the legacy and traditions of Nouns Burgee Flags by sending sailing teams to compete at the J/24 World Sailing Championship, the highest level of competition in sailing!\n\n# Description\nI, fiveoceans, have enjoyed the art of sailing for over a decade. Recently, I've seamlessly combined my passion for sailing with my deep affection for Nouns, crafting sailing events in both Seoul and New York, with the generous support of Props 102 and 173. Sailing, often hailed as one of the most esteemed sports, never fails to attract the attention of the media, guests, and local residents alike.\n\nIn much the same way that Nouns effortlessly align with cultures centered around skateboarding and running, they also harmonize beautifully with sailing culture. While sailing may be less popular or perceived as more challenging to engage in, it stands as one of the most inclusive sports, welcoming individuals of all ages, backgrounds, and walks of life.\n\nI am eager to extend my love for sailing to the Nouns community by curating a series of sailing events throughout 2024. These gatherings will provide a splendid opportunity to gather and share our ideas about future of NounsDAO.\n\n# Why Nouns Sailing?\n![](https://hackmd.io/_uploads/HJjKkJqun.jpg)\nThe Nouns burgee flag debuted at the 2023 Nouns Sailing event during NFT.NYC, representing the spirit of Nouns and the tradition of the Nounish community. Sailing isn't just a sport; it's a symbol of dedication and camaraderie. Sailors are the ones we can entrust with building the legacy and traditions of the Nouns Burgee Flag.\n\n## 1. Sail with Nouns in New York Harbor for NFT.NYC 2024\n**[April 3rd, 2024]** Following the success of [Prop 102](https://nouns.wtf/vote/102) and [Prop 173](https://nouns.wtf/vote/173), I would like to organize a sailing event on April 3rd in New York with the help of the Manhattan Yacht Club. It is important to gather at least once a year to celebrate achievements, brainstorm ideas, and share thoughts. I believe New York is the best place for such gatherings. In April, it was an amazing experience to meet everyone for the first time in person. I think next year, we will have even more loyal people visiting New York.\n\n\n## 2. Support two Olympic sailors\n**[September 2024]** In 2024, all eyes will be on the Summer Paris Olympics. It presents a unique opportunity for us to showcase noggles during this prestigious event. Rather than simply purchasing advertisements, I suggest a more organic approach – sponsoring Olympic athletes. My hypothesis is that by supporting these athletes during the qualification season, they will appreciate our assistance and, in turn, proudly display noggles at the Olympic games.\n\nShould this initiative prove successful with sailors, we can explore extending our sponsorship to athletes in various other sports. My initial proposal is to sponsor two Olympic sailors during their qualification season. The Olympic Sailing Competition at Paris 2024 will comprise ten sailing events, with a total athlete quota of 330. Qualification rounds commenced in August 2023 and will continue until April 2024.\n\n## 3. Road to J/24 World Sailing Championship\n![](https://i.imgur.com/7uN5xdw.jpg)\nThe J/24 World Sailing Championship stands as one of the most prestigious international sailing competitions. Our preparations for this championship will span an entire year. By fielding teams to compete in the J/24 World Championship, we aim to introduce Nouns to a diverse audience with different backgrounda encompassing professional sailors, Olympic medalists, seasoned veterans, all-female teams, collegiate squads, dedicated enthusiasts, teenagers, and newcomers who share a passion for sailing J/24 boats.\n\nOur goal is to bring the Nouns community along on this journey to the J/24 World Championship! This event represents the pinnacle of sailing competition, and every sailor aspires to participate (List of J/24 championships - [Wikipedia](https://en.wikipedia.org/wiki/J/24_World_Championship)). All teams involved will take immense pride in representing Nouns on such a grand stage.\n\nThroughout the year, we will engage in rigorous training and proudly display Nouns-themed spinnakers in various cities across Korea. We have identified some of the most picturesque locations, including beaches, islands, and areas with industrial landscapes.\n\nTo further promote Nouns, we commit to maintaining an active presence on social media platforms. Sending teams to compete at this prestigious event presents a remarkable opportunity to raise awareness of Nouns.\n\nOur dedication extends beyond the competition; we plan to work tirelessly throughout the year to promote Nouns. Regular updates on social media will offer insights into our practices, races, and maintenance routines. We'll showcase the elegance of Nounish spinnakers, whether in leisurely cruises or intense competitions. Additionally, we'll allocate time to master sailing maneuvers that may be less familiar to us as racers, such as figure sailing and cascade formations, which promise captivating visuals for photos.\n\n### Meet the Teams\n1. [Olympian from Busan Yacht Club, Korea](https://www.instagram.com/lina__brillante/) and [Olympian from Rio Yacht Club, Brazil\n](https://www.instagram.com/gabriel_pborges/)\n\n![](https://i.imgur.com/KS85QBq.png)\n\n2. [Tata Patagonia, Kids Sailing School at Club Nautico Bariloche, Argentina](https://www.instagram.com/p/Cr3sONxtvRH/)\n\n![](https://imgur.com/gyTadFB.png)\n\n3. [HugoBoss from Itaewon Sailing Club, Korea](https://www.instagram.com/hugoboss_j24/)\n\n![](https://i.imgur.com/kGPed50.jpg)\n\n4. [ES Team from Ewha Womans University Yacht Club, Korea](https://www.instagram.com/p/CjkCiuyh--7/?img_index=4)\n\n![](https://i.imgur.com/ASfCyop.jpg)\n\n5. [Team Solpi, Yeosu Yacht Club, Korea](https://www.instagram.com/solpiyachtclub/)\n\n![](https://i.imgur.com/7vjFnep.jpg)\n\n\n# Budget\n### 1. Sail with Nouns in New York Harbor for NFT.NYC 2024\n- **$18,000** rent sail yacht Arabella\n- **$10,000** - buffet by Manhattan Yacht Club\n- **$3,500** - Nouns Whiskey and drinks\n- **$5,000** - 120 Nouns burgee flags\n- **$3,000** - 100 T-shirts\n- **$5,000** - Airfare and wage\n- **$15,000** - Unexpected expenses\n    - (In prop173, the budget for big boat was $5K. However, the actual cost I paid was $17.7K due to crew, guests)\n    - (In prop173, the budget for sails was $35K. However, the actual cost I paid was $49,6K due to more expensive stickers for the artwork)\n**Subtotal: $59,500**\n\n### 2. Support two Olympic sailors during the qualification rounds for the Paris Olympics\n- **$7,000** - $3,500 per person\n- **25 Nouns Vision** - to distribute during Qualifying season\n- **Ticket to J/24 worlds** - the Olympic sailors will join Nounish team in Seatlle.\n**Subtotal: $7,000**\n\n### 3. Nouns: road to J/24 World Sailing Championship\n\n- **$10,000** - Filming crew - stills photos, video, and drone footage (total 10+ days of filming)\n- **$5,000** - Video editing and movie production (20 minutes)\n- **$7,000** - registration fees for J/24 worlds Championship\n- **$35,000** - Rental fees for five J/24 boats at Corinthian Yacht Club of Seattle ($7k per a boat; rental fees are usually high because of the demand during competitions)\n- **$43,000** - Team tickets to J/24 worlds Championship in Seattle ($8.6k per team)\n\n**Subtotal: $100,000**\n\n**Total:  $166,500**\n \n# Multisig Receiving Funds\nThe receiving address is a Gnosis Safe with 2/3 signers.\n\n**Multisig address**: 0xAC2671bAaA44b79cA1Fb006750c684E5349d721b\n\n**Multisig signers:**\n1. **toady_hawk**: 0x5D802e2Fe48392c104Ce0401C7ECa8a4456f1F16\n2. **benbodhi**: 0x80826180A2629206E3499B5167aaC8440E3F87f6\n3. **fiveoceans_dev**: 0xDf6e59c6DF1E9500fd35A76FF4C62F9901E90019\n\n**Proposed Transactions**\n- send $166,500 to multi-sig\n- send 25 Noun Vision glasses\n\n# Multisig Plan\n\n- $56,500 USDC will be sent to fiveoceans_dev's wallet upon conversion.\n    - the money will be used to proceed to book boat for NFT.NYC, order burgee flags, organize practice sailing.\n- $110,000 will be given to teams to register for 2024 J/24 worlds cup to proliferate nouns after teams post photos with giant dummy cheques (December)\n\n# Person in Charge\nI am fiveoceans_dev, member of nouncil, prop102, prop173,  code, sail since 2011, and love Nouns Community.\n\n![](https://hackmd.io/_uploads/SyyNHcn1p.png)\nhttps://twitter.com/fiveoceans_dev\n\n",
        "title": "Sail Nouns: NFT.NY, J/24 World Sailing Championship, and Olympics",
        "id": "386"
      },
      {
        "createdTimestamp": "1695478631",
        "description": "# ## Nounishpunk Playable Demo\n\n**The biggest Nounish game ever in development**\n## Tl;dr:\n\nWe are asking 24 ETH to launch the **playable demo** in December.\n\nClick on the image below to watch the game trailer\n[![](https://hackmd.io/_uploads/r1DOskckT.png)](https://twitter.com/nounishpunk/status/1699797131211743252?s=20)\n\n\n## Description \n\nAfter experiencing the process of prototyping and designing various Nounish games, we propose that Nouns DAO collaborates with Genius Slackers to launch a playable demo of the Nounishpunk game on the Steam store. Following player feedback, our intention is to release the full game by the end of 2024.\n\nThis specific proposal aims to secure funding for the release of the playable demo in December on the Steam store.\n\nUpon the release of the playable demo, the DAO will decide whether to provide further funding for the game.\n\n> **The full game will be released on the following top stores in 2024:**\n> \n>  - Steam Store\n>  - PlayStation Store\n>  - Xbox Store (Microsoft Store)\n>  - Epic Games Store\n>  - Nintendo Switch eShop\n\n---\n\n## Proposal Ask:\n\nWe are requesting **24 ETH** for a period of **60 days** to cover the following:\n - Final polishing of the playable demo.\n**`This crucial phase involves meticulous refinement to ensure a flawless gaming experience. It encompasses various tasks, such as fine-tuning character animations for seamless gameplay, replacing test sound effects and visual effects with their final counterparts to enhance immersion, conducting rigorous technical testing and debugging to eliminate any potential issues, and optimizing the final content for compatibility across a wide range of devices. Our goal is to deliver a polished, bug-free, and captivating demo that showcases the full potential of 'Nounishpunk' to our audience.`**\n\n - Production of marketing content and materials.\n**`This encompasses the creation of a wide range of promotional materials, including eye-catching posters, captivating trailers, and stunning concept art. These assets will be strategically designed to engage our target audience, build excitement, and effectively communicate the unique features and appeal of 'Nounishpunk' to potential players and supporters.`**\n\n*We are committed to providing propdates along the way.*\n\n---\n\n## Why 'Nounishpunk' Deserves DAO's Support?\n\nCheck out the excitement! People can't stop asking about the intriguing world of 'Nounishpunk' and its unique connection to the Nouns DAO. See how curiosity is piqued and interest is sky-high. It's clear that the Nouns culture is sparking intrigue far and wide through the Nounishpunk game.\n\n![](https://hackmd.io/_uploads/HyKHuRY1T.png)\n\n![](https://cdn.discordapp.com/attachments/614803058773196800/1154427287471665202/ezgif-5-8ec4b59c12.gif)\n\n**Here's the question:** Is a Nounish game designed to introduce players to Nouns DAO and its culture worthy of support and funding from DAO?\nWe believe that this game has the potential to generate significant exposure and positive advertising for DAO. Although we haven't even initiated a press release for the game, and without any external funding, we've strived to familiarize DAO with the world we've crafted, but we received encouraging feedback and it shows us that even with a small amount of support from DAO, we can make a significant impact.\n\n---\n## Who Are We?\n\nThe Genius Slackers team is an independent producer of video games. The company was founded in 2016 by Arash Negahban and Saeed Abbasi.\n\nYou probably know [Arash](https://twitter.com/ArashSlacker) for the animations and music videos he made for NounsDAO!\nHere’s some of the work I have done:\n\n- [Lil Nouns Music Video](https://twitter.com/ArashSlacker/status/1603321209613127680?s=20&t=7reei4hWvrg9tCth14J7MA) funded by Lil Nouns' [Content Pod](https://discord.com/channels/954142017556979752/1016388331602460773); music video!\n* This [Put Your Noggles On](https://www.youtube.com/watch?v=HnNIvVETNvY); music video!\n* Animation promoting [lil nouns DAO](https://twitter.com/lilnounsdao/status/1685286013659209728?s=20).\n- this [Shrimpy Noun in a Burger](https://www.youtube.com/watch?v=5e-3rIzsQWw) music video;\n- this [I'm The Bomb animation video](https://www.youtube.com/watch?v=cQjWXc2EHQk);\n- or this [Nounish GIPHY channel](https://giphy.com/channel/ArashNegahban/nounish) hosting a growing set of Nounish GIFs;\n- additionally, if you take a look at [my Twitter media](https://twitter.com/ArashSlacker/media), you will find even more Nounish animation content I have made in the past six months.\n\n![](https://cdn.discordapp.com/attachments/1140710821878579325/1149368704363155546/ezgif-2-a85cb9a938s.gif)\n\n---\n\n## External Nounishpunk Partner \n\nWe are excited to unveil our partnership with **[Nouns Factory](https://nounsfactory.com)**.\nIn this collaboration, we are proud to be the creative force behind the 3D rendition of their distinctive clothing line. These designs will be seamlessly integrated into our game, allowing players to customize their avatars with these exclusive clothing options. What's particularly intriguing is that players will also have the opportunity to directly purchase these real-world garments through the game.\n\nThrough this endeavor, we are introducing players to the world of Nousnish fashion, inspiring them to become patrons of Nouns Factory. With each real-world purchase of these showcased garments, we will receive a share of the proceeds.\n\nIn addition to our collaboration with \"**Nouns Factory**\", we are excited to partner with\n- [**Comics DAO**](https://twitter.com/ComicsDAO)\n- [**Public Good**](https://twitter.com/PublicGoodBeer) \n- [**Stickers.fun**](https://stickers.fun/en) \n- [**Noggle Chair**](https://twitter.com/Nounscn) \n- [**Gnars.**](https://twitter.com/gnars_dao) \n- [**Lil Bevs**](https://twitter.com/LilBevsByLils)\n\n\n These outstanding projects, funded by NounsDAO, bring immense potential for seamless integration into the world of Nounishpunk, perfectly complementing its unique art style.\n\n> In the game, our protagonist rides a skateboard inspired by 'Gnars,' showcasing incredible tricks along the edges of 'Noggle Chairs.' He reenergizes with 'Public Good' drinks for that extra turbo boost while tackling side-missions and achievements intricately connected with 'ComicsDAO.' All of this unfolds within a futuristic cityscape adorned with Nounish art, particularly when equipped with the stylish 'Nouns Factory-Style' shirt and Nounish weapons that can be customized with decals from 'Stickers.fun.'\n\n\nThis promises to be the most Nounish project ever, offering an immersive experience where these remarkable brands seamlessly blend with Nounishpunk's distinctive universe.\n\n![](https://cdn.discordapp.com/attachments/1147984938650578945/1149376993171869706/ezgif-3-Comic_Sticer.gif)\n\n---\n## What is Nounishpunk?\n\n* **Introduction**\nNounishpunk is an exhilarating, fast-paced third-person comedy action-adventure shooter set in an open world, boasting a captivating fantasy futurism art style.\nThe game thrusts players into an action adventure as they step into the shoes of a heroic figure. In a fantastical realm known as Nounish World, rebel forces have unleashed their wacky robots, threatening the very essence of their planets. As the chosen hero, your ultimate mission is to stand against these rebels, demolish their robotic enforcers, and restore order to the Nounish planets.\n\n**Click on the image below to watch the WIP gameplay video**\n[![](https://hackmd.io/_uploads/rkwjsJqya.png)](https://youtu.be/ErRAp9M_6fc)\n\n\n* **Story**\nRebels are causing a ruckus on one of the beloved Nounish planets with their wacky robots! They've taken people, hostage.\nThey're plotting to misuse the voting power of hostages in the DAO for some shady stuff.\nDAO is set to make a game-changing decision to tackle this situation.\n![](https://cdn.discordapp.com/attachments/1147984938650578945/1149377054014455838/ezgif-2-3f500sa186a.gif)\n\n\n* **World Building**\nIn the captivating realm of Nounishpunk, a universe brimming with sci-fi wonders, the very fabric of existence resonates with Nounish essence. Inhabitants are known as Nouns and Lilnouns, and governance takes the form of a collaborative group known as Nouners operating within a DAO. Across diverse Nounish planets, decisions are shaped by the power of collective votes, weaving a unique tapestry of control.\nHowever, beneath this intricate harmony, AI technology has surged to an alarming pinnacle, casting an ominous shadow over the world's delicate equilibrium.\n![](https://cdn.discordapp.com/attachments/1147984938650578945/1149382044313456660/ezgif-5-Map.gif)\n\n* **Art Style**\nThe art style of Nounishpunk boasts a fantasy-stylized aesthetic characterized by gracefully curved shapes. Nature's elements sport unconventional colors; expect to encounter blue trees and other unexpected hues. Characters themselves may feature unique anatomical traits, such as an apple-head character, adding to the game's distinctive visual allure.\n![](https://cdn.discordapp.com/attachments/1147984938650578945/1149377053385302117/ezgif-2-1800d3f60ds.gif)\n\n* **Key Features**\n  - Riding a motor skateboard as the primary mode of transportation throughout the game world.\n  - Fast-paced action with a captivating futurism art style.\n  - Infused with engaging comedy elements.\n\n\n---\n\n**Gameplay loop**\n1.  **Exploration and Discovery:** Begin your journey by exploring the vibrant Nounish city, mastering your Nounish tools, and zipping around on your trusty motor skateboard to uncover hidden secrets.\n1.  **Engaging Enemies:** Dive into action through both main and side missions, where you'll face off against enemies using unique Nounish weapons and tools.\n1.  **Epic Boss Fights:** Experience breathtaking showdowns at iconic locations like speeding trains, towering skyscrapers, and colossal ships, with each boss battle offering a distinct challenge and atmosphere.\n1.  **Mission Accomplishments:** Embark on a variety of quests throughout the city, from rescuing hostages to infiltrating enemy strongholds and solving intricate puzzles.\n1.  **Score Collection and Upgrades:** Gather valuable items and scores to enhance your Nounish arsenal, empowering you to overcome even the toughest challenges.\n1.  **Immersive Storytelling:** Immerse yourself in a gripping narrative filled with memorable characters, allies, and enemies as you play a pivotal role in advancing the game's compelling story.\n\n\n---\n\n* **Target Users**\nNounishpunk is tailored for gamers who enjoy action-adventure and shooter games with a fantasy flair. If you're into fast-paced action and a unique art style, this is the game for you.\n\n  Nounishpunk immerses you in Nounish adventures as if you were living them!\n\n\n* **Target Platforms**\nThe **playable demo** of the game will be released in **December** only on the **Steam Store**.The full game, however, will first be released on PC and consoles at the end of **2024**, followed by releases on Nintendo Switch and mobile devices in the following year.\n\n**For additional visual details, please visit the game's **[Store Page](https://store.steampowered.com/app/2568760/Nounishpunk/)** and consider adding it to your wishlist.**\n \n[![](https://hackmd.io/_uploads/SJKLnOPRn.png)](https://store.steampowered.com/app/2568760/Nounishpunk/)\n\n---\n\n\n **We genuinely thank you for taking the time to consider this proposal, and we eagerly look forward to the chance to showcase Nounishpunk's capabilities.**",
        "title": "Untitled",
        "id": "385"
      },
      {
        "createdTimestamp": "1695422147",
        "description": "# Lower fork threshold to 10%\n\nI propose to lower fork threshold to 10% (from 20%) and fork period to 3.5 days (from 7 days).\n\nBy lowering the fork threshold, we increase alignment among those who stay while leaning into the fact that [forks can be inherently good](https://jacob.energy/forks-are-good.html) for Nouns.\n\nWe don't yet understand the full implications of having many separate funding bodies co-existing under one Nouns umbrella brand. But, Nouns being cc0, we're uniquely capable of leaning into the potential of having multiple funding bodies, each with different approaches but individually highly aligned.\n\n**Isn't a lower threshold just making it easier for arbitrageurs?**\nIt is widely understood that we need to accelerate spending to close the arbitrage opportunity. Yet, figuring out exactly how to *thoughtfully* accelerate spending is a process that takes time. In the meantime, it seems like we'll be co-existing with arbers and should make the most out of the situation. Lowering the threshold increases arber competition, accelerating the process, decreasing their profits, and allowing them to drain less of the treasury.\n\n**Doesn't inviting arbitrageurs disrupt governance?**\nA lower threshold doesn't change that arbers will vote No on proposals and attempt to block spending. Conversely, it makes it less likely that arbers grow into a big cohort with significant voting power, which is a side effect of accumulating to reach the fork threshold.\n\n**Why not raise the threshold instead?**\nWhile raising the threshold might seem like a good stopgap to defend the dao against further arbitrage, it comes with an air of intellectual dishonesty and risks being [regressive](https://warpcast.com/vapeape/0xfc9dd9), while not accomplishing _that_ much in terms of protection.\n\n**Why decrease the fork period?**\nOne downside of a lower fork threshold and potentially consecutive forks is that proposal execution is blocked during the fork period. The fork period is decreased to mitigate governance disruption while still providing honest minorities ample time to coordinate.\n\n*Thanks to 40 and Elad for co-penning this proposal, and to Necfas for providing a Noun.*",
        "title": "Lower fork threshold to 10%",
        "id": "384"
      },
      {
        "createdTimestamp": "1695397055",
        "description": "# Call for a Public Boycott on Nouns Auctions * URGENT * (#002)\n\nPlease read: [https://nouns.wtf/vote/374](https://nouns.wtf/vote/374)\n\nNoun auctions now closing at 50% discount post-fork (and likely heading much lower). \n![noun_auction](https://imgpile.com/images/DTf2lc.png)\n\nIt's time for 4156 to resign.",
        "title": "Call for a Public Boycott on Nouns Auctions * URGENT * (002)",
        "id": "383"
      },
      {
        "createdTimestamp": "1695357263",
        "description": "# Bring a million shredders onchain (revised)\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeic7eqjinmflf6xdlcmczpihjt45us53x5hlpdnrjh55l32fn3ixke)\n\n📝 *This is a [Proposal 363](https://nouns.wtf/vote/363) revision, addressing feedback received.*\n\n**[Gnars](https://gnars.wtf)** proposes a strategic initiative to empower action sportspeople through communal funding, collective creation, and shared proceeds. The experience and knowledge gained over 16 months of operation has prepared us to further leverage the hypercycle generated by our Goodwill, Network, Advocacy, Releases, and Serendipity. Let's integrate Nouns into our subcultures, and bring a million shredders onchain!\n\n📝 *Skateboarding remains our primary illustrative example. Our commitment spans all subcultures we're part of and the term \"shredder\" describes anyone contributing to them.*\n\n## 📌 TLDR\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeihfnygx5opj7lq5o4yv4eyo3yuqlqerbppilwc3rzdynfmo2ayrdu)\n\n**Requesting 300,000 USDC**\n\n- A treasury for continuous public terrain park enhancements\n- Fund Shredders that represent gnars as community leaders and ambassadors\n- Operational funds for rewarding our most notable contributors\n- Intuitive onboarding with commemorative QR/NFC plaques\n- Enhance Nouns' outreach with subculture expertise\n\n*ie. Funding the revitalisation of public spaces for shredders of all disciplines to express themselves freely while proliferating Nouns ⌐◨-◨*\n\n## 🛹 Background/Problem Statement\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeiam6uer545pvjsbzbtnw5uy77mr3t3wus7iazve42yv4h7ezvsjeu)\n\n📝 *Cult classic > Corporate cringe. Movements > Marketing.*\n\nSkateboarding and similar subcultures, despite their rise in popularity, grapple with commercial overreach and value retention. Some of the most pressing challenges include:\n\n1. **Commercial Exploitation**: Outside brands jumping into skateboarding often prioritise profit over authenticity.\n2. **Loss of Authenticity**: Many skaters, due to financial pressures, might promote brands they don't genuinely align with.\n3. **Skater Exploitation**: Many skaters, despite their talent, don't receive fair compensation, especially considering the sport's physical demands.\n4. **Mainstream Misrepresentation**: Media portrayals frequently miss the genuine essence of skateboarding, leaning into stereotypes.\n5. **Skatepark Commercialisation**: Once-communal skateparks are becoming increasingly commercialised.\n6. **Core Values vs. Growth**: Balancing foundational skateboarding values with growth opportunities remains a delicate act.\n\nThe skateboarding domain needs a thoughtful equilibrium. Brands that genuinely get and respect the skate culture have the potential to collaboratively benefit both parties without diluting the sport's spirit.\n\n## 💡 Proposed Solution\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreiflj5bgctvmzjujul3kvehilbgrzcag7zhomomfdtrtbit4sptjym)\n\n📝 *Check out the [Meier Skatepark renovation](https://www.gnars.wtf/dao/proposals/3) proposal that's currently being delivered*\n\n**GNARS** as an acronym crystallises our ethos, mirroring the Nouns' virtuous cycle, acting as our serendipity engine:\n\n- **Goodwill**: Renewing skateparks and introducing new, shred-worthy sculptures\n- **Network**: Culturally sensitive contributions earn us both visibility and respect\n- **Advocacy**: Harmonising with communities helps us draw in new enthusiasts\n- **Releases**: Collective creative outputs with shared proceeds bolster funding\n- **Serendipity**: Getting onchain empowers shredders, opening fresh avenues\n\nEmpowering individuals to step into the blockchain world is central to our mission. Shredders, akin to artists, can undergo transformative experiences through this. Our overarching goal is to amplify our influence, simplify operational processes, and champion those with genuine grassroots credibility.\n\n## 🌟 Opportunity\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreihhjrjim3rtjd6k2drh6r5gpy5i7xfp22gjcuouujecd2p4arkxhq)\n\n📝 *We're not just another brand. We're a movement. Head-less so you can shred more!*\n\nThe Nouns ecosystem, with its unique blend of art, technology, and community, offers a fertile ground for genuine subcultural integration. Our approach is not about plastering logos everywhere but about creating genuine value and experiences.\n\n1. **Skatepark Enhancements**: We're not just slapping stickers. We're improving DIY spots and skateparks, making them better for everyone.\n2. **Nouns-Themed Sculptures**: Introducing Nouns-themed obstacles and sculptures in skateparks worldwide.\n3. **QR/NFC Plaques**: Simplifying onboarding with intuitive QR/NFC plaques at skateparks.\n4. **Subculture Expertise**: Leveraging our deep-rooted expertise to enhance Nouns' outreach in various subcultures, such as skating, rollerblading, surfing, bodyboarding, flying and other extreme sports.\n5. **Grassroots approach**: Empowering Gnars Shredders to engage their local community and organise meetups, beach cleanups and other forms of experiences that cause positive impact on their daily lives.\n\nOur target of onboarding a million shredders might seem lofty, but it’s just a fraction - 0.2% - of the 490 million participants in extreme sports.\n\nTo provide some perspective, skateboarding alone boasts 85 million participants. Industries like adventure tourism further validate our optimistic projections, given their sustained growth trajectories.\n\n## 📊 Budget Breakdown\n\nPer the TLDR, our ask is **300,000 USDC** to our treasury (DAO executor) at `gnars.eth`. We aim to replicate our success across multiple locations that arise through grassroots discovery and Prop House infinite rounds funding. \n\nBased on previous project expenses, we estimate 24 additional projects is an achievable outcome over the next 12 months, especially when focused on emerging markets where every gwei goes such a long way:\n\n- **Continuous park enhancements - 240,000 USDC**\n    - Skatepark refurbishments: 140,000 USDC\n    - Nouns-themed sculptures: 50,000 USDC\n    - Supporting Ambassadors/Shredders: 30,000 USDC\n    - QR/NFC plaques for onboarding: 10,000 USDC\n    - Miscellaneous & unforeseen expenses: 10,000 USDC\n- **Administration of funded projects - 60,000 USDC**\n    - Coordinate community-driven outreach and promo\n    - Discord moderation and general administrative tasks\n    - Onboarding support for grant recipients and builders \n    - Curation and support for new That's Gnarly creators\n- **Onchain (gas) and other expenses - Self-funded**\n    - Codebase maintenance, improvements and bug squashing\n    - Implement auction settlement leaderboard to reward settlooors\n    - Provide regular \"[Propdates](https://propdates-app.vercel.app/)\" to keep Nouns updated onchain\n    - Releasing collective productions atop zora protocol rewards\n    - Deploy open source portfolio at gnars.com ([GitHub Pages](https://jekyllrb.com/docs/github-pages/))\n\n📝 *Through onchain governance, we will allocate funds as earmarked. Finer details are laid out later in this proposal. If you've any questions, please don't hesitate to [join our Discord](https://discord.gg/gnars) for a discussion. We are here to help!*\n\n## 🗳️ Funds Allocation & Voting\n\nThe funds will arrive at `gnars.eth` which is our onchain treasury and DAO executor contract. It functions exactly as the Nouns DAO treasury does. Decisions are made through the usual voting process by [Gnars holders](https://etherscan.io/token/0x558BFFF0D583416f7C4e380625c7865821b8E95C#balances).\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeifw3mcxausdmec7lkjd7dnpcwj6dxsfremcdweuil5nqr2oidixau)\n\nAt present, there are 3980 Gnars in circulation across 696 holders. We'd like to bring attention to the 8 largest holders as shown in the above screenshot, as they're very influential within the DAO, and have our best interests at heart:\n\n1. **[Non-voting](https://app.safe.global/settings/setup?safe=eth:0x0658f4eD17289144717713ADfFC2539eF7c2EF8e):** Instead of a founders' reward, 10% of Gnars are directed to the `shred.gnars.eth (0x06...EF8e)` multisig for onboarding shredders who are new to web3 and wish to participate in governance. Gami, who initiated the Gnars project, is instead rewarded in ETH as chosen by each bidder when placing bids in our auctions, using the bid slider. By default it's set at 90% treasury (`gnars.eth`) and 10% founder (`gami.eth`).\n2. **[Gami](https://twitter.com/0xigami):** Hyperactive Nouns contributor, founder of Gnars, [Art Haus](https://art.haus), [Omega](https://omega.build), and author of [The Hypercommons](https://hypercommons.wtf/): A Manifesto for a Positive-Sum World. Visit his personal website at [gami.wtf](https://gami.wtf) for more information.\n3. **[Ric Burton](https://twitter.com/ricburton):** Early contributor to the Ethereum ecosystem and talented kitesurfer/kiteboarder. Has shown huge support to Gnars and has even been known to offer Gnars holders access to his beachfront property.\n4. **[Benbodhi](https://twitter.com/benbodhi):** Perhaps the first person to arrive in the Gnars discord server and cofounder of [Alps DAO](https://alps.wtf). Showing early support as a collector, he's been an avid community moderator and wearer of many hats. Nounish AF.\n5. **[Satori:](https://twitter.com/0xsatori)** Also an early collector and contributor across all facets of the project. He has since become a valuable asset within various Nouns related teams and is the author of our [Gnarly News](https://gnarly.news) newsletter.\n6. **[Geffenz:](https://twitter.com/geffenz)** One of the most active auction participants, known more recently for the creation of [Gnarsauce](https://thatsgnar.ly/shop/gnarssauce), settling more auctions than any other, and for creating our \"Be Kind & Settle\" meme that led to [settle.wtf](https://settle.wtf) being deployed.\n7. **[DjjD:](https://twitter.com/TheDjjDAbides)** long time collector of Gnars having spent many hours in our Auctions discord channel along with Geffenz and other settlooors. He's a curator for [Redlion](https://twitter.com/redlion) and has been supporting us since our humble beginnings.\n8. **[Blockbird](https://twitter.com/_blockbird):** prominent [Art Blocks collector](https://gallery.so/blockbird), photographer and world traveller, who 50/50 owns Noun 189 with Gami and was also responsible for the inception of Gnars over coffee at a cafe in Sydney, January 2022.\n \n[The multisig](https://app.safe.global/settings/setup?safe=eth:0x0658f4eD17289144717713ADfFC2539eF7c2EF8e) mentioned at the top of this list at `shred.gnars.eth` was the original Gnars treasury, prior to our migration to a fully onchain nounish DAO in June this year. As well as receiving Gnars for shredder onboarding, it's used for proposal submissions such as this one, and the signers are as follows:\n\n- [Gami (0x38...fffd)](https://etherscan.io/address/0x387a161C6b25aA854100aBaED39274e51aaffffd)\n- [Benbodhi (0x80...87f6)](https://etherscan.io/address/0x80826180A2629206E3499B5167aaC8440E3F87f6)\n- [Blockbird (0x6B...4DDD)](https://etherscan.io/address/0x6B67623ff56c10d9dcFc2152425f90285fC74DDD)\n- [Davin (0xdf...d939)](https://etherscan.io/address/0xdfB6ed808fADddAd9154F5605E349fFF96E3d939)\n- [Vlad (0x41...be4A)](https://etherscan.io/address/0x41CB654D1F47913ACAB158a8199191D160DAbe4A)\n- [Oni (0x91...2937)](https://etherscan.io/address/0x91dCCAA260CC4616E1a6e6b693DB7207C5E42937)\n- [22 (agreed to be removed)](https://etherscan.io/address/0x75Ee6eb3d8DAcf41eE2e5307090B197D3E1Cca6E)\n\nSince no Gnars are distributed as founder rewards, all holders purchased all their Gnars themselves including Gami. who owns Noun 189, offering Gnars community the opportunity for delegation.\n\n## 🧭 Approach and Strategy\n\n[![](https://ipfs.decentralized-content.com/ipfs/bafybeifkzcdwnvktxhmf47i67iel4gqyqtqc6jkhqc2xfxxqnfnmjr5dja)](https://www.youtube.com/watch?v=q3unXaYpMl8)\n\n📝 *Watch this NounGnarversary celebration funded via Prop House [on YouTube ](https://www.youtube.com/watch?v=q3unXaYpMl8)*\n\nOur strategy is multi-pronged, ensuring we address both immediate needs and long-term sustainability:\n\n- **Skatepark Enhancement Projects**\nWe've already showcased our impact: \n    - Opstacle (noggle rail) installations such as [the original](https://snapshot.org/#/gnars.eth/proposal/0xb63306dbfe950dd9754d5edcf8f48c6ff9bdd32eeeff4c644cb90c974a3055fa) in [Praça XV, Rio de Janeiro](https://twitter.com/vladhzc/status/1660451083427143681) (Brazil), and others in [Nairobi](https://twitter.com/davinoyesigye/status/1688473570119131136) (Kenya), [Domingo de Guzmán](https://twitter.com/PagesAndres/status/1632145699256016900) (Dominican Republic), and [Chicago](https://twitter.com/webgnar/status/1703201471255187565) (United States) with more to come\n    - Skatepark refurbishments such as [Skate Park Maracanã](https://snapshot.org/#/gnars.eth/proposal/0xb6f1781ada377924f11500e81735dd60170984c7976a1267027b3bd67fca93f1) (Rio de Janeiro), [Gigoia Island Skatepark](https://nouns.wtf/vote/142) (Rio de Janeiro) and [Meier Skatepark](https://www.gnars.wtf/dao/proposals/3) (Rio de Janeiro) are great examples of our contributions and collaborations\n    - Nouniversary events in [Pereira](https://thatsgnar.ly/thatsgnarly/stories/femboard-x-gnars) (Colombia), [Niterói](https://thatsgnar.ly/thatsgnarly/stories/noun-gnar-versary) (Brazil), [São Paulo](https://thatsgnar.ly/thatsgnarly/stories/uncharted-waves) (Brazil), [Nairobi](https://thatsgnar.ly/thatsgnarly/stories/noungnarversary-celebration-nairobi) (Kenya) demonstrate our commitment to Nouns \n- **Operational Funds for Notable Contributors**: Recognising and compensating our most notable contributors for their relentless efforts, unearthing grassroots opportunities around the globe, and keeping thing running smoothly\n- **Continuous Park Enhancements**: Establishing a treasury for ongoing terrain park improvements, ensuring sustained impact and cultural relevance, all incredible catalysts for ongoing content production\n- **Intuitive Onboarding**: Implementing QR/NFC plaques for commemorative purposes and seamless onboarding of new members to our ecosystem\n- **Brand Outreach**: Collaborating with authentic brands and influencers in the action sports domain to amplify reach and earn the respect of our peers\n\nOur dual focus on the action sports community and local councils ensures that our initiatives resonate with authentic cultural value. We reject the zero-sum and seek out win-win, positive-sum outcomes for all involved.\n\n## 🚧 Project Discovery & Selection\n\nWhile we have showcased our past skatepark refurbishments, the future projects are yet to be determined. Gnars original focus was on sponsoring individual athletes, but we've learned that empowering them to uplift their entire community is far more impactful. We wanna help create local heroes!\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeigfvokrjnehnlajktaca4wnarcd322gb2srdgy6flfhx6izmxbfse)\n\n📝 *Explore our Nouniversary events with the new Stories feature on [That's Gnarly](https://thatsgnar.ly/stories)*\n\nSkatepark refurbishments and opstacle (giant noggle rail) installations have proven to be the gifts that keep on giving. Beyond our initial unveilings and launch celebrations, our creations are often seen across social media. As shredders become intrigued by our artistic installations, they are often inspired to capture and post tricks they perform on them.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeigfm66vmoqnarkg2fvgpyswwnio7wjupewbxqr3hytmk72tfbkkvi)\n\n📝 *One of many ways to see our creations surfacing on Instagram is [#gnars](https://www.instagram.com/explore/tags/gnars/top/)*\n\nThe selection process for which projects we pursue involves grassroots discovery by DAO members who are passionate about uplifting their communities. We plan to further utilise Prop House infinite rounds for rewarding grants to opportunities identified by members like those who've already delivered.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeif5o7iwfwqedxs645vh2fh3ktyeh2ojzlyuffqsdr6rwxuprhf3m4)\n\n📝 *Prop House works well for us like this other round: [1147 votes for 19 props](https://prop.house/gnars/noungnarversary)*\n\nRather than handling each individual skatepark refurbishment / opstacle installation as separate onchain proposals, the Prop House protocol will allow us to be much more gas efficient. We've been running an infinite round that funds artists to complete their designs that end up on skateboards ridden by Tom Rohrer in [his tutorial videos](https://www.instagram.com/toms_tutorials/). Once the protocol hits mainnet, we intend on being power users and believe Prop House is one of the most powerful tools available to communities like ours.\n\n## 🫂 Notable Contributions\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeihr7uy7fgb2pz6inhpphj4kknd2aggrzszfg3an4plyoyb2vs2mfe)\n\n📝 *Visit [roko.dev](https://roko.dev/) to see our sustained growth of unique contributing users!*\n\nWe have a dedicated group of contributors who've naturally landed to fill certain needs. Some are signers on the multisig mentioned earlier, and some also represent larger voting blocks. We've chosen to allow our community to submit notable contributions. Here's just a small selection:\n\n- **[Volky](https://twitter.com/volkyeth):** Created [Noundry Studio](https://studio.noundry.wtf/), built the [Gnars DAO UI](https://www.gnars.wtf/) from scratch and deployed the DAO contracts, collabed in a bunch of [other](https://www.nomo.wtf/) | [nounish](https://www.nouns101.wtf/) | [projects](https://www.bitnouns.wtf/)\n- **[Mari](https://twitter.com/marinioac):** [Gnars Athlete](https://thatsgnar.ly/thatsgnarly/user/0x4b5f934da25c33f130efc5df47c91af1375baa30), GnarsDAO Discord Admin, Noggles Designer (DCS [Recycled Plastic Noggles](https://x.com/marinioac/status/1646309926757621761?s=20) and LilSisters [First 3D Print CC0 Noggles file](https://x.com/marinioac/status/1656725700290793473?s=20)), [Nounified TPM](https://x.com/marinioac/status/1656759075240046595?s=20), Spread the meme to the [Brazilian Surf community](https://www.instagram.com/p/Cs9PRCqurKU/), [SurfguruDAO](https://thatsgnar.ly/surfguru) founder and represented [GnarsDAO in NFT Brasil](https://x.com/marinioac/status/1665919482177495041?s=20).\n- **[Luizhadad](https://twitter.com/luizhadad):** [Gnars Athlete](https://peakd.com/hive-141964/@luizhadad/6-months-as-a-sponsored-surfer-at-gnars-dao-or-6-meses-como-um-surfista-patrocinado-da-gnars-en-pt-br) and partner at [Surfguru](https://www.surfguru.com.br). Dropped the first [Surfing NFT on That's Gnarly](https://thatsgnar.ly/thatsgnarly/creations/gnarly-barrel-or-cacimba-do-padre-fernando-de-noronha). Represented Gnars in conferences like Ethereum Rio and NFT Brasil. Pod-community member. Collaborated to create the [Shredders Journey](https://app.timesnap.xyz/gnars/events).\n- **[web-gnar](https://twitter.com/webgnar):**  [product placement at Riot Fest](https://twitter.com/webgnar/status/1702891635820863932), [helped](https://www.stoken.quest/) at [ETH Denver](https://www.youtube.com/watch?v=9Ond2pqzlB4), connected ⌐◨-◨ to Chicago's [skate scene](https://www.youtube.com/watch?v=P3ZuQZRhylE&t=4s), [drop](https://thatsgnar.ly/thatsgnarly/creations/webgnar001) on thatsgnar.ly.\n- **[Tom Rohrer](https://twitter.com/tom_rohrer90):** Over 10 million views riding Nounish boards in a comprehensive library of [trick-tip](https://www.instagram.com/toms_tutorials/) [tutorials](https://www.youtube.com/@toms_tutorials).\n- **[wylin💎](https://x.com/ihwylie)**: Artist, Nouns Chicago founder, [501c3 non-profit Executive Director.](https://thecityfarmers.org) \n    - Raised 10Ξ from [Lil Nouns](https://lilnouns.wtf/vote/135) & [Gnars](https://snapshot.org/#/gnars.eth/proposal/0x487760526824abbe7997ee2fe4887de10af737eb60d35a4165025b8f58148e50) to fund and coordinate the Lil Gnarly Skate Jam in collaboration with the inaugural ETHChicago.\n    - [Created the first composable Opstacles](https://youtu.be/VwRXt_SCshk?si=hFZVqB0oM2fFB5Ye)\n- **[Davin](https://twitter.com/davinoyesigye):** Shredder Community Onboarding focusing on Africa, Gnars Media House Spokesperson, Host Gnars Jam sessions Podcast, Lead Nouns Proliferatoor in Nouns DAO Africa\n- **[Satori](https://twitter.com/0xSatori):** Author of [Gnarly News](http://gnarly.news) and [onboard.wtf](http://onboard.wtf), [proposal tracking](http://gnars.network), [Gnars merch shop](http://gnars.lol), governance and community moderation. \n- **[Rickyday](https://twitter.com/dayan_ricky):** [Builder](https://discord.com/channels/928811922244137020/996191296119111864/threads/1071201280569131050) and [Content Creator](https://x.com/dayan_ricky/status/1696848378406092982?s=20), bringing  Nautical and Sailing Culture to Gnars, helping with [Thatsgnarly IG](https://www.instagram.com/thatsgnar.ly/), Networking at IRL events and onboarding new people, Athlete Brand Manager as [Nico Karolla](https://www.instagram.com/p/Cu5hy9LLfII/) for Gnars and [Sunny Pires](https://www.instagram.com/p/CtNs33Hs3lx/?img_index=1) for [NounsDAO](https://www.instagram.com/p/Cp5i-mPJqBC/).\n- **[3rd-Eye](https://twitter.com/3rdeye_crypto):** [Gnars athlete](https://snapshot.org/#/gnars.eth/proposal/0xdc3be19c4d846e9af7bcc625582f355ba4f6ea6db4559251b8ba688e8dbbbe5a), [Production of events](https://twitter.com/3rdeye_crypto/status/1644034340697915392) and Branding Connections (Gnars Session and [Game of G-N-A-R-S](https://www.youtube.com/watch?v=q3unXaYpMl8)),spoke about gnars at [Rio Crypto hub](https://www.instagram.com/p/CoXrZPvphDj/?img_index=2) and [ETH-RIO](https://twitter.com/JoeyPonzi/status/1640144586298277890) side events, [One of the winners of Nouns Hack Week IRL and Other Weird Stuff](https://prop.house/nouns/hack-week-irl-and-other-weird-stuff), champion of the first [Thats Gnarly Contest](https://twitter.com/thatsgnar_ly/status/1643441064152551424), [Builder](https://twitter.com/nounsprophouse/status/1678937804196257793) and [Content Creator](https://twitter.com/3rdeye_crypto/status/1692630630750969927), Creator of the [Gnars Merch](https://twitter.com/3rdeye_crypto/status/1691572145447485665).\n\nEarly on, Gami took care of most administrative aspects of the project. But nowadays, there's no reliance on him or any single DAO member, since we've sufficiently decentralised, while maintaining a tight-nit group who self-organise around encouraging the community at large.\n\n📝 *Shoutout [Wylin](https://twitter.com/ihwylie) for this rad and inclusive idea, to recognise more of our notable contributors in this proposal, it represents what Gnars are all about.*\n\n## 🔍 DYOR\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeihpe47c44p3cwggtfeq7bgnjo4oj3glubrcvxgdv4vghtrqlihwdy)\n\n📝 *Visit [gnars.wtf](https://gnars.wtf), our new client built from scratch by [Volky](https://twitter.com/volkyeth). Coming soon to [Nouns, in HD](https://twitter.com/volkyeth/status/1703671983286735234)! 👀*\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeiczcsrvy57jgtsicn5ylcrf3vvwropztbwxx6gnrtc63v62ci3ahy)\n\n### 🔎 Gnars at a glance\n\n- 10M+ views on [Tom's Tuts](https://www.instagram.com/tom_rohrer) on [YouTube](https://www.youtube.com/watch?v=Rtegw6Eml5c&t=36s), [Instagram](https://www.instagram.com/toms_tutorials/) and [TikTok](https://www.tiktok.com/@toms.tutorials) \n- [Prop House](https://prop.house/gnars) winners like [this 1M+ subs YouTube event](https://www.youtube.com/watch?v=q3unXaYpMl8)\n- [That's Gnarly](https://thatsgnar.ly/) (337 creators) collectibles ($15.6k raised)\n- Our pioneering first ever DAO released [skate video part](https://zora.co/collect/eth:0x96c752ed99a77702bdf58e03f9dd9e654236e2f3/1)\n-  Enjoy our Nounish films: \n    -  [Gnars: The New Way Skateboarding Pros Earn $$](https://www.youtube.com/watch?v=HgeEwp4uizw)\n    -  [Obstacle at Praça XV in Rio de Janeiro!](https://www.youtube.com/watch?v=JQSmfSnRGVk)\n    -  [Nounish fingerboards are Gnarly](https://twitter.com/nounish/status/1683444320433590272) \n- Browse our [offchain](https://snapshot.org/#/gnars.eth) (90) and [onchain](https://www.gnars.wtf/dao) (9) proposals\n- Bid in our [ongoing auctions](https://www.gnars.wtf/) ahead of [The Gnarving](https://www.gnars.wtf/#gnarving)\n- [Toggle the switch](https://www.gnars.wtf/) to see each Gnar's HD version\n\nPS. Watch our awesome events in [Denver](https://youtu.be/9Ond2pqzlB4) and [Chicago](https://youtu.be/P3ZuQZRhylE) held recently.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeibubwz5nh63kkh76z5enydejiv44dy4xhyva4gthcgbpyra4q4f5m)\n\nWe are currently working hard on using [That's Gnarly](https://thatsgnar.ly) to further showcase our stories, as well as a new open source [gnars.com](https://gnars.com), for accepting community contributions to a portfolio, and extensive blog that already attracts thousands of organic search visits per month.\n\n## 🤘 Shred the Nouns\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreib6xa4v4wasg4ijnvhic2wfg65jh7xxfpop3pagc34t4h5z3br67a)\n\nIn the essence of our name and spirit, what we at Gnars do best is *Shred the Nouns.* Our passion extends beyond the conventional, morphing the iconic Nouns into tangible sculptures that echo our shared values and love for our sports, creating spaces where art meets action, and stories come alive beneath our wheels.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeid6wythc5h7n3icx6dqk3ja2q6ibct7qciazah2qgzflswfooyyve)\n\nAs we roll forward with our vision, we deeply value the collective strength and insights of the Nouns community. Your continued encouragement, feedback, and trust are what make such endeavours possible. By embracing our proposal, you're not just endorsing a project, but championing the blend of art, culture, and authenticity that both Nouns and Gnars represent.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeidsv7lnm477kv7hocxij4ndogkafxiebyg7fdbr7dfy3zu7rznavm)\n\nIn gratitude for your time and consideration, and as a gesture of our appreciation, we've created a unique, commemorative NFT to mark the submission of this proposal. For the month of Shredtember, we invite you to [mint this FREE NFT](https://gna.rs/hypercycle) and all Zora Protocol Rewards will be split between Nouns and Gnars treasuries. A special thank you for being an intrinsic part of our journey.\n\n## ⏭️ Moving Forward\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeibmuxgn3htydgifxyvsgsrgcoxrkuyctcir5swqvax6n6kea7xhxa)\n\n**To summarise,** our next steps and expected deliveries:\n\n1. Ship auction settlement leaderboard with Gnars NFT allocation (2 weeks)\n2. Gnars proposal for Skatepark Refurbishment infinite Prop House rounds (2 weeks)\n3. Gnars proposal for Contributor Rewards infinite Prop House rounds (4 weeks)\n4. Help community through Prop House submissions for first project (4 weeks)\n5. Identify at least 2 projects a month (expected delivery of 1-3 months each)\n\nKeep in mind we are optimising for a serendipity machine as opposed to rigid plans with known outcomes. We expect plenty of competition among our community members all looking to have an impact in their own locales.\n\n📝 ***It helps to view Gnars as a pod** who proliferate Nouns (as a service) into subcultures where we've deep networks and cultural sensitivities. Just so happens that we're using governance as an opportunity to introduce newcomers from our communities to web3.*\n\nHere's to collective courage!\n\n⌐◨🤘◨",
        "title": "Bring a million shredders onchain (revised)",
        "id": "382"
      },
      {
        "createdTimestamp": "1695269519",
        "description": "# Elect 24 Nouns \"Gardeners\" as the Voting Body for Nouns' Prop House Open Rounds\n\n## TLDR\n\n![](https://hackmd.io/_uploads/B1WFfT30n.png)\n\nLet's kickstart the Prop House (PH) open rounds again by branding them as the \"Nouns Garden\" (to make them more fun and memeable) and run a mandated PH round to elect 24 \"Gardeners\" to vote on the DAO's behalf in these rounds.\n\n_Note: This prop was ideated by Noun 40 and was developed in collaboration with seneca. Artwork was created by [Facu](https://twitter.com/facuserif)._\n\n---\n\n## Context\n\nEarly in Nouns' history, PH open rounds served an important role within the Nouns ecosystem. It was a place where new builders could receive a few ETH for their early to mid stage ideas with less governance overhead. It was also a way for the DAO to create open competition around a not-too-big commitment of ETH spending, and allow the DAO to harvest the long-tail of ideas rather than being limited to what makes it onchain.\n\nHowever, over the rounds, voter attention waned and PH open rounds started to show its governance weakness. Unlike onchain props where every large voter ultimately paid attention to every prop and voted when necessary, PH open rounds started to go largely unattended. What's worse, rounds increasingly ran the risk of being arbitrarily determined by whichever large voter decided to engage in a given round.\n\nAs a result, the PH open rounds lost much of its legitimacy and we were unable to continue funding through it. Towards the end, we were running 2.5 ETH single-winner rounds every other week, funding a grand total of 5 ETH(!) per month through PH. The last round's outcome—[Open Round 21](https://prop.house/nouns/open-round-21)—was determined by a single large voter as the sole voter of the winning prop.\n\n---\n\n## Proposal\n\nLet's kickstart the PH open rounds again branding them as the \"Nouns Garden\" (to make them more fun and memeable) and run a mandated PH round to elect 24 \"Gardeners\" to vote on the DAO's behalf in these rounds.\n\nRepresentative voting should allow for a more attentive class of voters to vote on each open round while the election ensures that the DAO voters still indirectly maintain influence over the outcomes of PH open rounds. \n\n## More details:\n\n**The Art:**\nThe gardener art work was completed by [Facu](https://twitter.com/facuserif) and funded using PH team's funds.\n\n\n![](https://hackmd.io/_uploads/BJyrigaCn.png)\n\n\n**Minting & Distribution:**\nThis proposal mints 24 Nouns Gardener NFTs initially going to the [garden-admin multisig](https://etherscan.io/address/0xD94F65a9BFa4Fcb04FFbc0A64687667FcB28110e) managed by Noun 40 and seneca. If this prop goes through, the PH team will run the Gardener election mandate round. The winners will then be sent the Gardener NFTs which will serve as the voting token in the Nouns Garden rounds. \n\n\n**Gardener Selection:**\nThe Gardener position should be open to nouners and non-nouners alike and everyone that's interested in having fun doing civic service for the dao is welcome to run for the position!\n\nIt's desirable that the PH layer doesn't end up with an entirely disjoint set of voters from the onchain prop voters. Ideally, there's a lot of overlap and as a result the props that win funding at the PH layer will have a good chance of success receiving continued funding onchain if they continue to execute well.\n\nThe Gardener position will be re-elected at a 3 month cadence. 6 months or a year feels like forever in Nouns time. 2 months feels too frequent.\n\n**Gardener Compensation:**\nThe Gardener position will be volunteer roles without specific compensation (outside of the NFTs!)\n\nThere's a notion that delegate positions should be paid b/c reading props and voting is \"work\". However, not all civic service positions are better performed when paid, and there's also definitely fun and prestige in serving as a PH delegate of the DAO. This proposal intends to explore the potential of representative voting at the PH layer without adding financial incentives into the mix.\n\n**Gardener Voting Power:**\nEach Gardener will have the equal voting power (10 votes to spread across props in each round). If we start to observe bad behavior amongst Gardenders such as collusion or self-dealing, then we could institute quadratic voting where the cost of voting for the same prop multiple times goes up linearly such that it is harder to effectuate collusion or self-dealing. We're proposing to start with the simple voting scheme so that we don't unnecessarily introduce complexity.\n\n**Gardener Count:**\n24 was chosen as a size that is materially larger than committee sizes we explored in the past with NSFW (4-10) and DCS pod (5), as to assuage the concern (or perception) that a few people can be influenced to sway outcomes, while also ensuring that the Gardener election is likely to be competitive. It is not hard to imagine that we can elect two dozen worthy candidates. It is not clear that we could elect fifty. \n\n**Garden Rounds:**\nNouns Garden rounds will start off as 5 ETH x 2 winners (10 ETH) rounds every other week. \n\nTwo 10 ETH rounds a month still amounts to a very small percentage of our overall funding allocated through PH open rounds. We spent around ~900 ETH per month the past year, so 20 ETH would be ~2% of our spending rate. Ideally, the open-ended, lower friction, competitive, mid-tail funding the PH open rounds promise can scale further to be 10-20% of our spending, but we likely shouldn't start where we want to end up. We should scale up as builders return to PH and rounds remain competitive even as more funding goes through.\n\nOnce the PH protocol is launched, the DAO could vote on these parameters concretely. For now, we have to trust the PH team to execute these rounds.\n\n**Garden Funding:**\nNouns DAO has granted the Prop House team a total of 550 ETH over the last 2 years to direct towards Nouns DAO related rounds of which 160 ETH remain. These funds will be used towards the first quarter of Nouns Garden (60 ETH).\n\n**Miscellaneous:**\nIf the Nouns Garden is successful and continues after the first quarter, each quarter we will mint new Gardener NFTs such that Gardeners can continue to own their old NFTs as an object that holds provenance of their service. We would not expect Gardeners to transfer or sell their NFTs to someone else before the quarter is over given their reputation is at stake.",
        "title": "Elect 24 Nouns \"Gardeners\" as the Voting Body for Nouns' Prop House Open Rounds",
        "id": "381"
      },
      {
        "createdTimestamp": "1695254015",
        "description": "# NFTR: The First Ethereum Protocol Run by a Nounish DAO\n\n# TLDR\n\nNFTR, the first and only NFT Naming Registry on Ethereum, is requesting 80 ETH to seed its Nounish DAO Treasury. In Nounish DAO fashion, 1 daily NFT = 1 vote,  will determine NFTR funding initiatives. In return for the funding, Nouns DAO will receive 10% of the supply in perpetuity. In addition, NFTR will direct 5% of daily auction proceeds to the Nouns DAO treasury up to 80 ETH.\n\nNFTR allows naming any ERC-721 with a globally unique name across all Ethereum.\n\nNFTR DAO will eternally proliferate Nouns as sponsor of the NFT Naming standard. \n\nThe up and coming standard -- [ERC-6551](https://eips.ethereum.org/EIPS/eip-6551)’s Token-Bound Accounts turn NFTs into active onchain identities that can do anything an EOA / smart contract wallet can do. Active NFTs and their accounts need human-readable names for reference and reach.\n\nThis initiative expands Nouns’ addressable market to **all NFT holders**.\n\n# Who's Behind NFTR?\n\n[DigitalOil](https://x.com/0xdigitaloil) is the founder and CEO of [NFTR](https://nftr.name). Team includes 1 BD lead, COO, 2 more devs, and a designer. Development began in Q3 2021. Before going full-time web3, DigitalOil was an iOS developer, satcom engineer, and logistics business executive. He was behind [Prop 199](https://nouns.wtf/vote/199) and worked on [Private Voting](https://prop.house/nouns/private-voting-research-sprint/3976) (recently won the Nouns Private Voting contest) Research funded by Nouns. DigitalOil also recently founded [The Panama DAO](https://twitter.com/ThePanamaDAO), in the image of Nouns DAO, which was pre-seeded 1 ETH by [Nouns Prop House](https://prop.house/nouns/open-round:-12/2166) and subsequently seeded 20 ETH by a [Builder DAO Incubator round](https://prop.house/builder/dao-incubator-round-2).\n\nFor more on DigitalOil’s thoughts about Nouns, please refer to his Nouns Agora statement.\n\nNote that DigitalOil has fronted all NFTR founding expenses (over $400k worth) since inception, ~19 months ago. NFTR has never raised seed funding.\n\n# What is NFTR?\n\nNFTR (NFT Registry) is a universal, permissionless NFT Naming Registry on Ethereum.\n\nNFTR allows naming any ERC721 with a globally unique name across all NFTs.\n\nIt's comparable (albeit different architecturally) to ENS for naming NFTs instead of wallets.\n \nNaming an NFT grants the NFT a NFTR Profile with soon to be integrated ERC-6551 functionality (a new standard for Token Bound Accounts) and extensive utility. \n\nNFTR provides an API so that any platform can pull and display names alongside NFTs.\n\nFor more details on protocol architecture, visit [NFTR.name](https://nftr.name) to view our [Docs](https://docs.nftr.name), try our live dApp, view NFTR Profiles at [name].NFTR.name, or engage on our [Discord](https://discord.gg/frMSHsAvay).\n\n![*Nouns that have been named on NFTR. JellO.nftr is the Nouns DAO-owned Noun that was named on NFTR via Prop 280. JellO can be interacted with by visiting jello.nftr.name in any web browser.* ](https://i.imgur.com/aPBEQTX.png)\n\n*Nouns that have been named on NFTR. JellO.nftr is the Nouns DAO-owned Noun that was named on NFTR via Prop 280. JellO can be interacted with by visiting jello.nftr.name in any web browser.* \n\n# Why name NFTs?\n\nNFTs need the accessibility afforded by simple, unique names.\n\nThe rise of ERC-6551 Token Bound Accounts accelerates the inevitable onchain use of NFTs as our identities.\n \nA universal NFT Naming Registry unlocks limitless NFT-centric app potential, hosted within NFTR Profiles, allowing you to BE your NFT. \n\n**Current \"web3\" ID jumble**\n* A Twitter account with an off-chain handle\n* Ubiquitous profile name featuring reference to an unverifiable on-chain domain (ENS or NNS)\n* A verified or unverified image of an NFT that’s impossible to refer or navigate to\n\nAll representing a web2 account who may not own the displayed NFTs or domains.\n\n**NFTR Names and Profiles provide**\n* Cohesion of NFT, onchain identity, and social media\n* Instant reference/reach via a simple domain: [name].nftr.name\n* Organized ERC-6551 functionality, 1 subdomain per Token-Bound Account. \n* NFT Utilities: listed below\n\nFor an expanded vision behind NFTs as identities, refer to [this article](https://medium.com/blockchain-biz/on-web3-digital-identity-ies-480e2257a706) by DigitalOil.\n\n![Current profile page of JellO. Previously owned by our Treasury (at time of naming). Now owned by mucholove.eth. This Noun is reachable at [jello.nftr.name](https://jello.nftr.name)](https://i.imgur.com/T91LU81.png)\n*Current profile page of JellO. Previously owned by our Treasury. Now owned by mucholove.eth. This Noun is reachable at jello.nftr.name*\n\n# NFTR Utility\n\nNFTR Names unlock usage of NFTs as our identities. NFTR Profiles at [name].nftr.name facilitate and embed the following utilities (**bold** still under development):\n\n* Simple NFT reference + reach\n* Web3 verified links to socials + NFT marketplaces (showing best available price)\n* **ERC-6551 Integration (Token-Bound Accounts)**\n* **Subdomain per Token-Bound Account**\n* NFTR Name Marketplace (name trading)\n* **NFT Direct Messaging (between NFTs)**\n* Composability: New primitive for dApps to leverage\n* **Collection-native utilities and plugins into NFTR Profiles**\n\n![Verified socials (verified twitter handle shown). Allows for the first time for an NFT to point to a social media identity, inter-relating them both ways.](https://i.imgur.com/6zQ32bc.png)\n*Verified socials (verified twitter handle shown). Allows for the first time for an NFT to point to a social media identity, inter-relating them both ways.*\n\nIntegration of ERC-6551 features will operate a named NFT’s TBAs (Token-Bound Accounts) and associate them with a subdomain, making the TBA reachable by referring to the subdomain (e.g. banking.DigitalOil.nftr).\n\n![The NFTR Name Marketplace allows for trading NFT names.](https://i.imgur.com/UnUzHIP.png)\n*The NFTR Name Marketplace allows for trading NFT names.*\n\nAs an extension of an NFT's naming history, NFTR will develop the first NFT-event specific indexer. The indexer searches and detects all events related to an NFT, including:\n* Contract provenance\n* Mint date\n* Naming history\n* Wallet to wallet transfers\n* NFT enhancements / metadata changes\n* App specific events, like airdrop claims\n* Uses of the NFT as collateral\n* Using the NFT for some collection-specific utility (e.g. Mutating a BAYC)\n* Staking the NFT for yield\n* All of the above with the intent of making NFTR into the first NFT-centric identity platform, where NFTs become social and are front and center.\n\n# Why involve NounsDAO?\n\nDistributing ownership of the contracts and treasury of an Ethereum-wide primitive to a decentralized DAO is the ultimate proliferation of Nouns: perpetuating the ideal on-chain governance model.\n\nWe view Nouns as the purest instantiation of a DAO and are interested in adopting the Nouns DAO model for control and proliferation of the NFTR protocol.\n\nNFTR has been bootstrapped to date. A funding infusion will accelerate development at a critical time, facilitate NFTR’s first marketing efforts, and permit other initiatives to cement NFTR into its sensible role as a necessary and universally adopted public good. \n\nThe Nouns community is full of individuals concerned with innovation and the welfare of web3. We’d be honored to enlist your support and advocacy, both as a Nouns brand and as a collection of highly sensible and web3 native individuals. \n\n# ERC-6551 Integration + Enhancement\n\nFrom ERC-6551's [whitepaper](https://eips.ethereum.org/EIPS/eip-6551#abstract):\n\nERC-6551 Abstract: “This proposal defines a system which assigns Ethereum accounts to all non-fungible tokens. These token bound accounts allow NFTs to own assets and interact with applications, without requiring changes to existing smart contracts or infrastructure.”\n\nAnother quote: \"Each token bound account is owned by a single ERC-721 token, allowing the token to interact with the blockchain, record transaction history, and own on-chain assets. Control of each token bound account is delegated to the owner of the ERC-721 token, allowing the owner to initiate on-chain actions on behalf of their token.\"\n\nIf ERC-721s (NFTs) are to be so active, they must be simply and uniquely identifiable.\n\nENS, fundamentally, provides this service to Ethereum wallets.\n\nNFTR, natively, provides this service to NFTs and ERC-6551 Users.\n\nAs ENS provides limitless value and utility beyond reach/reference, so does NFTR. \n\n# NFT Name Integration\n\nNFTR Names can be easily integrated by ABI/API call into:\n* Existing NFT Marketplaces (show names below NFTs for sale)\n* Metaverse spaces\n* Web3 Games\n* Social media apps that display verified NFTs\n\nIntegrated NFTR Names are:\n\n* Quickly reachable by web domain at [name].nftr.name\n* Clickable, directing to NFTR Profile for direct interaction with the NFT\n* Interactive via NFT Messaging, direct payments, bidding, browsing NFT history, etc.\n\n# How Does NFTR’s namespace work?\n\nNFT Names are registered in NFTR’s [Registry Contract](https://etherscan.io/address/0xc662a8ce36392d4b9489d0b59605a1874711bfc6). They are unique, meaning that no two NFTs can simultaneously hold the same name. They are NOT tokens or NFTs themselves. This brings the following benefits:\n* NFTR Name transactions are light (not gas intensive)\n* NFT Names are bound to the NFT, and travel with the NFT\nNFTR’s native name marketplace facilitates free in-wallet name transfer and buying/selling/bidding between wallets. Names are integrated into existing dApps via API/ABI call.\n\nNames are alphanumeric strings with no leading or trailing spaces, and are case sensitive for display purposes. But case-insensitive for duplicity purposes.\n\n\n# Similar Props\n\n**107 Verse**: Narrowly passed before funds were returned. Conflicted results due to purchase of equity in a non-Nouns project (Verse). Relation to our prop: NFTR is requesting DAO funds, not selling equity. NFTR is Nounish in DAO structure, and will feature ⌐◧-◧ in daily NFTs. \n\n**189 SharkDAO**: “I see these types of proposals as \"cultural venture investments\", similar to our @nounsbuilder funding… we just need to know whether a) we trust that the subDAO will steward those funds in a way that is positive for Nouns DAO, and b) if the cumulative ask is an amount of our treasury we are comfortable \"locking up\" until we see the cultural ROI from that spending.” Relation to our prop: NFTR can be viewed as a venture investment, though all funds will be incrementally added to the NFTR DAO, and their usage will be determined by DAO members (20% NFTR team, 10% NounsDAO). As a contributing member of Nouns and an innovator in the space, it can be reasonably assumed that DigitalOil will be an admirable steward of NFTR and its association to the Nouns brand and DAO model. \n\n**284: PizzaDAO**: Executed prop to fund PizzaDAO’s global pizza party, featuring Nouns branding and Noggle props. Here, Nouns served as sponsor for another DAO’s mission while perpetuating the Nouns meme. Relation to our prop: Not only will Nouns’ branding be integrated into NFTR’s NFTs and platform; NFTR’s DAO structure will inherently mimic the ideal web3 standard established by NounsDAO, eternally perpetuating the meme and the model. \n\n# NFTR Revenue Model\n\nMultiple revenue streams that will flow to the NFTR DAO Treasury.\n* Paid Namings (0.01 ETH, one-time lifetime fee, adjustable by the DAO)\n* NFTR Marketplace Revenue (5% fee of name trade value, adjustable by the DAO)\n* Daily Nounish NFT Mints\n* Golden Ticket sale fees ([GTKs are an existing](https://www.nftr.name/#/golden-ticket) NFTR-created ERC-20 that token-gates NFTR’s top 1000 names)\n* Fees from eventual advanced NFTR features (NFT Groups, subdomains, etc.)\n\n# How NFTR will proliferate Nouns\n\n* Finish building a web3 standard in the model of Nouns DAO\n* Nounish governance NFTs\n* Nouns DAO will become a major contributor to the NFTR DAO\n* Nouns DAO maintains a significant influence (10% voting weight) over NFTR DAO props. Note that if Nouns chooses to exert this influence it would likely be by delegation to interested parties.\n\n# Deliverables\n\n* Adopt Nouns DAO governance structure (includes turning over ownership of the protocol contracts to the Nounish NFTR DAO) via Nouns Builder DAO deployment.\n\n![NFTR governance becomes Nounish](https://i.imgur.com/7qZ3KV5.png)\n*NFTR governance becomes Nounish*\n\n![Nouns profile pages on NFTR would show different than profile pages for other NFTs](https://i.imgur.com/o9GiXGg.png)\n* Nouns profile pages on NFTR would show different than profile pages for other NFTs\n* 10% of minted NFTs go straight to Nouns DAO treasury\n* 20% of minted NFTs are sent to the NFTR team address\n* 5% of minted NFTs go to a contract governed by [Golden Ticket](https://www.nftr.name/#/golden-ticket) holders\n* The other 65% of NFTs are auctioned daily with proceeds going 100% to the Treasury\n* Outfit our daily NFTs with ⌐◧-◧\n\n![NFTR DAO daily NFT early concept](https://i.imgur.com/VEJKMwI.png)\n*NFTR DAO daily NFT early concept*\n\nSupply every Nouns NFT (forever) with a Naming Credit (existing and future), good for a free name + associated NFTR Profile (accessible by [name].nftr.name). This includes development of a PR into the [nouns.wtf](http://nouns.wtf) front-end to facilitate naming upon auction settlement\n\n![Name your Noun on NFTR for free with a naming credit granted for each newly acquired Noun](https://i.imgur.com/TIdKeRz.png)\n*Name your Noun on NFTR for free with a naming credit granted for each newly acquired Noun*\n\nFurther customize Nouns NFTR Profiles, integrating Nouns-specific utility (e.g. delegation plugin, vote bidding plugin, etc.)\n\n# Funding Request\n* 80 ETH to seed the NFTR DAO Registry for decentralized use by NFTR DAO. NFTR will direct 5% of daily auction proceeds to the Nouns DAO treasury up to 80 ETH.\n* All funding directs to a 2/3 multisig controlled by Noun12, Joel & Digital Oil until the NFTR DAO treasury is ready to receive the funds.\n\nThese are some of the initiatives the NFTR team envisions will be proposed:\n\n**Team expansion**\nFunding permits core team to work continuously on NFTR, in addition to funding additional hires to accelerate development (frontend + backend), event indexer, maintenance, and community-facing roles, etc.\n\n**Marketing and Business Development**\nPromotion + NFT community education on the utilities of NFT Naming, as well as its essential nature in support of ERC-6551.\n\n**NFT Conference Sponsorship + Promotion**\n⌐◧-◧ x NFTR sponsorship at worldwide 2023-2024 NFT conferences\n\n**NFTR PropHouse**\n⌐◧-◧ x NFTR will create a PropHouse to solicit community-built utilities and dApps that leverage the universal NFT namespace.\n\n**Auditing**\nThe completed NFTR ecosystem includes new smart contracts that must undergo auditing to ensure their security and safety for trustless + immutable NFTR DAO ownership and operation.\n\n# Success Metrics\n* Wide-scale Adoption of native NFT Naming (1 mil+ domains registered)\n* Becoming the primary hub for ERC-6551 activity\n* Propagation of Nouns meme + Nouns DAO model as the ideal governance model for a business / decentralized web3 protocol\n* Steady demand for daily NFTR NFTs, which stock the NFTR DAO Treasury and keep NFTR as decentralized as possible, sustaining NFTR indefinitely as a standard on Ethereum\n",
        "title": "NFTR: The First Ethereum Protocol Run by a Nounish DAO",
        "id": "380"
      },
      {
        "createdTimestamp": "1695224555",
        "description": "# Week of Nouns on Cointelegraph\n\n**tl;dr**: Showcase and introduce Nouns to 10M+ crypto-native retail audience of Cointelegraph.\n\n1. Cointelegraph - the #1 crypto media outlet with a 10m+ monthly audience;\n2. Add Cointelegraph-branded ⌐◨-◨ to all Cointelegraph editor's profile pictures (editors profile included in every article published) ([link](https://cointelegraph.com/about));\n3. Add branded ⌐◨-◨ to Cointelegraph iconic Coin (15-20% of all article’s images) ([link](https://cointelegraph.com/news/sen-warren-calls-out-sham-audits-while-svb-threatens-crypto-bankruptcy));\n4. Every ⌐◨-◨ will be clickable, leading to the [nouns.wtf](https://nouns.wtf/);\n5. Make Nouns days during the campaign. Create stories about DAO and the ecosystem (PropHouse, GnarsDAO, Nouns Esports, etc.).\n\n## **Why?**\n\nSpread the word about Nouns across Cointelegraph readers, bring new members/\nvalue to the Nouns community. It will not only attract new audiences to the NounsDAO but also showcase the vibrant sub-DAOs that actively contribute to the NounsDAO's ecosystem.\n\nHow it may look like:\n\n![How it may look like](https://cointelegraph.notion.site/image/https%3A%2F%2Fprod-files-secure.s3.us-west-2.amazonaws.com%2Fccba3368-f2a3-4888-b075-61c8036b942a%2Fb0d640c5-f5e0-4b40-b85e-97bf2b820835%2FC61A2252-11F4-40B6-BDB0-5D82548BAF64.jpeg?table=block&id=3f26f1b5-33af-4f2d-b8d4-8de5efcc9be4&spaceId=ccba3368-f2a3-4888-b075-61c8036b942a&width=2000&userId=&cache=v2 \"How it may look like\")\n*Custom ⌐◨-◨ for Cointelegraph*\n\n![How it may look like](https://cointelegraph.notion.site/image/https%3A%2F%2Fprod-files-secure.s3.us-west-2.amazonaws.com%2Fccba3368-f2a3-4888-b075-61c8036b942a%2Fe063635c-d78a-4352-bd53-622fd7a55c23%2F4CCD9026-BC6E-46B0-A948-801943FA7EEB.png?table=block&id=b98b9901-31a5-4d20-8c66-d143348c4989&spaceId=ccba3368-f2a3-4888-b075-61c8036b942a&width=2000&userId=&cache=v2 \"How it may look like\")\n*Cointelegraph article example. Every article has the author's image with* ⌐◨-◨\n\n![How it may look like](https://cointelegraph.notion.site/image/https%3A%2F%2Fprod-files-secure.s3.us-west-2.amazonaws.com%2Fccba3368-f2a3-4888-b075-61c8036b942a%2F5f0cf82b-e3ea-4219-b68e-a89afdc65d9f%2F4F379233-62C5-4A89-BE75-56AC9B0F0F88.png?table=block&id=4276b24b-6f12-454b-ba1a-77a5b89061e4&spaceId=ccba3368-f2a3-4888-b075-61c8036b942a&width=2000&userId=&cache=v2 \"How it may look like\")\n*Cointelegraph Iconic Coin twitter post example*\n\n![How it may look like](https://cointelegraph.notion.site/image/https%3A%2F%2Fprod-files-secure.s3.us-west-2.amazonaws.com%2Fccba3368-f2a3-4888-b075-61c8036b942a%2F63c1f934-0255-49a1-a34e-6c0cf37949bf%2FA4BFEDF9-6601-4187-A8B9-A8145F1B6285.jpeg?table=block&id=91751962-1299-4fa7-bf74-c8ecaa7018e3&spaceId=ccba3368-f2a3-4888-b075-61c8036b942a&width=2000&userId=&cache=v2 \"How it may look like\")\n*Editorial team page on the Cointelegraph website*\n\nArticles shared across Cointelegraph 11 language versions (10m+ monthly visitors), Twitter (1.8m followers), Facebook (780k), Telegram (140k followers), and LinkedIn (91k) to bring awareness and drive up the organic interest in ⌐◨-◨.\n\n## **Proposal**\n\nCointelegraph is one of the oldest and largest blockchain media celebrating its 10-year anniversary this year, with more than 10M Web3-native readers across 193 countries excited to collaborate with one in of the most OG/fun and true-community-run DAO.\n\nTapping into a massive retail user base with a relevant area of interest will help Nouns DAO expand its domain and reach millions of new people.\n\nProp is aimed at making a collaboration between Nouns DAO and Cointelegraph, which will consist of:\n\n1. Add ⌐◨-◨ to editor’s profile pictures in every article and team’s page.\n2. Add ⌐◨-◨ to iconic coin graphic that represents the crypto-industry in general (examples: [link 1](https://cointelegraph.com/news/the-uae-central-bank-signs-deal-for-cbdc-strategy), [link 2](https://cointelegraph.com/news/do-kwon-reportedly-arrested-in-montenegro), [link 3](https://cointelegraph.com/news/florida-gov-and-us-presidential-hopeful-calls-for-cbdc-ban))\n3. Duration-14 days.\n4. Nouns DAO and Cointelegraph will publish a series of articles/podcasts/Twitter spaces/ Youtube videos explaining the campaign and story of Nouns DAO and its Sub-DAOs.\n\n \n**Topics to be covered in the series of articles/ podcasts/ Twitter spaces/ Youtube videos:**\n\n**Day 1.** NounsDAO - History and the mission of the DAO. PropHouse - empowering builders with top ideas.\n\n**Day 3.** PropHouse - The big piece of content covering examples of the most interesting projects. NounsDAO x Brave Collaboration, Nouns Vision Glasses, Nouns Movie, and some others, including philanthropic initiatives in Africa, etc.\n\n**Day 5.** CC0 Values and Open Ecosystem: How NounsDAO promotes an open ecosystem for builders and its commitment to the CC0 license.\n\n**Day 7.** Sub-DAOs of Nouns Ecosystem: GnarsDAO, LilNounsDAO - Explanation of the sub-DAOs that make up Nouns ecosystem and their roles and functions.\n\n**Day 10.** Nouns Esports: NounsDAO's strategy to capture the esports market and its partnerships with esports teams and organizations.\n\n**Day 14:** Nouns Builders, No-Code Platform: Overview of ZORA, the no-code platform that NounsDAO is developing to enable users to create their own DAOs on-chain.\n\nWe aim to give a complete overview of the NounsDAO ecosystem through these content pieces, which will be structured and divided across different days with the campaign. The format of showcasing and the exact timeline will be discussed with the community to ensure the best presentation to the readers.\n\n## **Why Cointelegraph?**\n\nCointelegraph was established in 2013 and, being the oldest and the biggest media outlet has amassed 10M+ web3-native audience across 193 countries.\nCointelegraph covers a wide range of topics on blockchain technology, digital assets, emerging fintech, and other cutting-edge technologies.\n\nHere are the key numbers that highlight the impact of Cointelegraph in the development the Web3 industry:\n\n- Founded in 2013;\n- The #1 blockchain media with 42% of the global blockchain media market share;\n- 23M monthly pageviews ([link](https://www.similarweb.com/website/cointelegraph.com/#overview), [link](https://www.similarweb.com/website/cointelegraph.com.br/#overview), [link](https://cointelegraphcn.com/));\n- 1,000 articles per month;\n- 3M social media followers;\n- 11 language versions (US, FR, BR, SP, IT, TR, AR, CN, KR, JP);\n- 65% of the audience is 18-34 age with 80% of them having knowledge about the industry;\n- Cointelegraph was one of the first to interview Gavin Wood and Vitalik Buterin in 2014 ([link](https://cointelegraph.com/news/cutting-edge-an-interview-with-ethereum-creators-vitalik-buterin-and-gavin-wood)), one of the first to advocate for digital assets/blockchain to solve real-world problems like ([link](https://cointelegraph.com/news/open-letter-to-the-world-health-organization));\n- Cointelegraph has hosted for multiple years the flagship digital asset conference - Blockshow - with more than 3,000 attendees.\n\nCointelegraph actively participates in the latest technological development in Web3, covers the latest innovation in blockchain/digital asset space, and stays close to the native community. ([link](https://twitter.com/Cointelegraph/status/1681605414842925056?s=20))\n\n![zkDay Paris event](https://cointelegraph.notion.site/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F87fddb54-4da4-40d9-9b70-8cc97eb43135%2FUntitled.png?table=block&id=44f4e01c-d728-404a-8252-4008c398a93c&spaceId=ccba3368-f2a3-4888-b075-61c8036b942a&width=2000&userId=&cache=v2 \"zkDay Paris event\")\n\n![zkDay Paris event](https://cointelegraph.notion.site/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fbe85873c-aa9a-4e79-b5ac-e5803c95efe5%2FUntitled.png?table=block&id=9b243330-c2bd-41e9-a2fe-bed6c912e7dc&spaceId=ccba3368-f2a3-4888-b075-61c8036b942a&width=2000&userId=&cache=v2 \"zkDay Paris event\")\n*Cointelegraph team was supporting zkDay Paris event*\n\n![zkDay Denver event](https://cointelegraph.notion.site/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F53d44922-749e-43cc-a4eb-274f009ec3f0%2Fimage1.jpg?table=block&id=2441b4fb-0ab2-4b66-a6ad-5e407edeb857&spaceId=ccba3368-f2a3-4888-b075-61c8036b942a&width=1400&userId=&cache=v2 \"zkDay Denver event\")\n*Cointelegraph team was supporting zkDay Denver event*\n\n![DAO phenomenon](https://cointelegraph.notion.site/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F92966686-6483-49ca-9274-b3334338f3ca%2Fimage2.png?table=block&id=4e726c8e-b7e9-459d-97c5-4165c9e49370&spaceId=ccba3368-f2a3-4888-b075-61c8036b942a&width=1400&userId=&cache=v2 \"DAO phenomenon\")\n*Cointelegraph Research report on the importance of DAO phenomenon*\n\n![Cointelegraph is the major influencer in the blockchain industry](https://cointelegraph.notion.site/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F7adad845-d458-45d7-9cfb-97ffd938b819%2Fimage8.png?table=block&id=27fd52c2-4256-4cd3-8177-2a8fbfca0eb1&spaceId=ccba3368-f2a3-4888-b075-61c8036b942a&width=2000&userId=&cache=v2 \"Cointelegraph is the major influencer in the blockchain industry\")\n*Cointelegraph is the major influencer in the blockchain industry*\n\n## **Value to the Nouns DAO**\n\n- Fun and native engagement with the mass retail audience\n- ⌐◨-◨ exposure to the largest digital asset retail community\n\n## **Value in numbers:**\n\n1. Duration of the campaign: 14 days.\n2. Estimated views of the campaign: 5,000,000+\n3. Web: ~500+ articles published during the campaign (each will have the author's image with ⌐◨-◨). ~100+ articles with iconic coin graphic wearing ⌐◨-◨\n4. Twitter: estimated 1,000,000+ views (10 posts daily on average)\n5. Other social media: 500,000+ views combined (Instagram, Facebook, LinkedIn)\n\n## **The Ask**\n\nThe total ask = **100 ETH**",
        "title": "Week of Nouns on Cointelegraph",
        "id": "379"
      },
      {
        "createdTimestamp": "1695223247",
        "description": "# Public Good Beer 🍺\n\n![](https://i.imgur.com/Wfgt1Ye.png)\n‎ \n## A brand born from a culture 🍻\n\nA cc0 beer, label, and recipe. But more than that – a brand that reflects the culture.\n\nPublic Good's goal is to bring the culture of cc0 and public good into the world of consumer products, putting Nouns in the spotlight as a leader in this movement.\n\nReal products amplify visibility and legitimize the ecosystem outside of crypto Twitter, facilitating the onboarding funnel and paving the way for the flywheel to work beyond speculation. \n\nWe are going global. And the first step has been taken.\n‎ \n## First phase: done! ✅\n\n💡 This first phase wasn’t funded by NounsDAO.\n‎ \n![](https://i.imgur.com/LrFagUj.png)\n‎ \n\n✅ Public Good brand development\n✅ Prospecting partners\n✅ cc0 beer recipe creation\n✅ Label design and production\n✅ Canning of 3500 cans of Public Good IPA\n✅ Website creation ([access now](https://publicgood.wtf))\n✅ Metaverse onboarding experience by Voidge with free Public Good beer module for related communities ([access now](https://voidge.com/publicgood) - desktop only)\n✅ NFT airdrop for supporters and buyers\n✅ Lens handle airdrop for early supporters\n✅ All resources available on [cc0-lib.wtf ](https://cc0-lib.wtf/ )\n✅ Free technical consulting and upgrade of company e-commerce to accept cryptocurrencies\n✅ Launch campaign with influencers funded by [FOODNOUNS](https://prop.house/foodnouns/open-kitchen-rounds/4282) (0.25 ETH) and [Cryptoadz](https://snapshot.org/#/cryptoadz.eth/proposal/0xfd727bbf5c5f8fec37b96ce7de6d8ce12dcd7aa12e4fa026b0bffbbc25860076) (0.25 ETH)\n✅ Two main crypto events sponsorship in Brazil\n\n- BTC Pizza Day, Porto Alegre - 170 Attendees ([media](https://drive.google.com/drive/folders/1pE7UDpaEauN8EECnBInMP-CVe4XFMgTg))\n- NFT Brazil, São Paulo - 20k Attendees ([watch video](https://twitter.com/PublicGoodBeer/status/1669666576985997312))\n\nA few months ago, Narcose was just another award-winning craft brewery. But now it is leading a global movement that it has pioneered. They accept crypto as a form of payment in their e-commerce, have tokenized experiences, have a metaverse, and see this new market as a point of differentiation. Now they are innovators AND BUILDERS, promoting the Nouniverse to all their stakeholders.\n\n![](https://i.imgur.com/jZkSfr9.png)\n\n![](https://i.imgur.com/HDOViNt.png)\n\n![](https://i.imgur.com/rSak9r8.png)\n\n![](https://i.imgur.com/yovNFDQ.gif)\n\n![](https://i.imgur.com/DxPb6M0.png)\n\n![](https://i.imgur.com/2gdcu5z.png)\n\n![](http://i.imgur.com/AOgiihd.gif)\n‎ \n*Check out our module in Voidge Metaverse 👉 [voidge.com/publicgood](https://voidge.com/publicgood)*\n‎ \n![](http://i.imgur.com/F9XkmLk.gif)\n\n![](https://i.imgur.com/xGZGzJ3.png)\n‎ \nShout out to the amazing network of collaborators who believed in the cc0 culture, joined forces, and made it all possible:\n\nfabioseva.eth (Coordination and Design), jp.⌐◨-◨ (Operations and Marketing), Narcose (Beer Production), Viking (Malt and Hop Supplier), **[Buidler.it](http://buidler.it/)** (NFT Launchpad), **[Voidge.com](http://voidge.com/)** (Metaverse Development), **[BPague.com](http://bpague.com/)** (Crypto Payment Gateway), BTC Pizza Day Porto Alegre (Event), NFT.Brasil (Event), FOODNOUNS (Funding), Cryptoadz (Funding), Lens Protocol (Handles Giveaway), **[Gotas.Social](http://Gotas.Social)** (Loyalty/Engagement) and Nounish Punk (Game).\n‎ \n## An opportunity to scale 🌐\n\n![](https://i.imgur.com/IJHYa1z.png)\n‎ \nThe first phase proved that beer is an excellent product to start proliferation on a global scale. We are seeking funding to expand our actions in three complementary strategic directions:\n\n1) New regions 📍\n2) Proper marketing in Brazil 🇧🇷\n3) New product categories 👀\n\n**1) New regions 📍**\n‎ \n![](https://i.imgur.com/4iKllzi.png)\n‎ \nNarcose is already part of a network of regular collaborative breweries, through which it markets its beers in the US and Europe. We will take Public Good Beer to these markets, also integrating them into our onboarding ecosystem and turning them into real Nouns builders.\n\nWe are asking for 4350 USDC for label printing, marketing material, initial beer production (minimum 1500 cans/bottles), and aftermovies/content production FOR EACH of our partners:\n\n**Canil** (Portugal) 🇵🇹 - already committed to 1500 bottles and will launch in October, ahead of various crypto events such as ZKdevsummit, Dune Con, ETH Lisbon, EBS2023, Nearcon and Web Summit, all happening in November.\n\n**Stillwater Brewery** (Seattle) 🇺🇸\n**Against the Grain** (Kentucky) 🇺🇸\n**Wooden Ship** (Minneapolis) 🇺🇸\n**Brewski** (Sweden) 🇸🇪\n**Bierol** (Austria) 🇦🇹\n\nIf breweries exclusively produce the subsidized batch, Nouns' maximum cost per can or bottle, which includes premium beer, label printing, a launch event, and ongoing marketing and sales throughout the batch, is only 2.90 USD. Should the brewery opt for a larger batch, as is the case in Brazil, or produce a second batch independently, this cost significantly decreases.\n\nAdditionally, the impact of the funding goes beyond a single event. It serves as a **catalyst for wider influence and regular integration of Nouns into everyday culture.** This is evident in the growing number of [reviews](https://untappd.com/b/cervejaria-narcose-public-good-ipa/5389905) on the popular Untappd app (over 70 to date), spontaneous shares on social media, adoption by various Gnars-related activities in Brazil, featuring in the Nounish Punk game, and our successful production management in Portugal.\n\n👉 **Accelerating Public Good Beer expansion not only brings legitimacy but also sustains a lasting cultural impact for Nouns.**\n\n**BUDGET: 6x 4350 = 26100 USDC**\n\n![](https://i.imgur.com/jvG8dTb.png)\n‎ \n**2) Proper marketing in Brazil 🇧🇷**\n‎ \nInternational expansion will not be instantaneous, as it demands a free schedule in the industry. In this period, we take advantage of the remaining inventory of over 3000 cans produced. \n\nDespite the success of Phase 1, we believe we haven’t reached the full IRL proliferation potential for such a pioneer project. We had 0.5 ETH for everything (sub-300 cans and a very short-scale marketing activation). Thus, the proposed expansion would bring the deserved impact and tons of resources for further promotion of the Nouniverse.\n\nWe are requesting 4350 USDC per quarter for the next six months to fund the activities below. We commit to at least one IRL event every quarter, but given the rapid growth of the Nouns community in Brazil, we anticipate numerous opportunities to engage with new fans.\n\n- Public Good Beer distribution\n- Marketing materials (shirts, stickers, temporary tattoos, and more)\n- Brand activations\n- Professional media production\n\n**BUDGET: 2x 4350 = 8700 USDC**\n\n![](https://i.imgur.com/5JpkcCz.gif)\n‎\n**3) New product categories 👀**\n‎ \nBeyond beer, we have the opportunity to extend the portfolio to two synergic brands/categories:\n\na) BBQ sauces - for the weekly beer-fueled barbecues we do in Brazil; and\nb) Sunscreen - for our community along 7637 km of coastline, with bikinis, surf stars, and sunglasses ⌐◨-◨ \n\nWe would like to allocate a total budget of 5000 USDC for working on this as the project progresses. Alongside this, we also have the coordination and maintenance of the activities during the period of six months at a cost of 6000 USDC.\n\n**BUDGET: 11000 USDC**\n‎ \n## Roadmap\n\n![](https://i.imgur.com/S9KqgmZ.png)\n‎ \n## Team\n\nfabioseva.eth\njp.⌐◨-◨ \n\nWe are very excited to keep spreading the cc0 culture and bringing companies on board with us. A huge shoutout and heartfelt thanks to everyone who's supporting the project, either by engaging online or drinking the beer IRL. Don't forget to follow [@PublicGoodBeer](https://twitter.com/publicgoodbeer) on Twitter for all the latest updates. Cheers to a future of collaboration and doing good!\n‎ \n## Budget\n\n**45800 USDC (~ 28 ETH)**\n\n![](https://i.imgur.com/LHIh5Aw.gif)\n\n![](https://i.imgur.com/HUBuh7p.gif)\n\n*Sponsor's Note: (ccarella.eth)*\n\n*As an enthusiast for Public Goods, I am thrilled to sponsor this proposal onchain. It's incredibly satisfying to witness a tangible representation of the Public Goods brand. With its CC0 recipe, distinctive branding, and collaboration with various breweries, this project stands out as an innovative venture that extends the reach of the meme. It also encourages people to contemplate the importance of both CC0 and Public Goods.*",
        "title": "Public Good Beer 🍺",
        "id": "378"
      },
      {
        "createdTimestamp": "1695170183",
        "description": "# PALACE X NOUNS\n\n![](https://imgur.com/AyEJ0vI.jpg)\n\n# **TLDR**\n\n•Fund the next four months to create a framework and legal agreement for Nouns and [Palace SkateBoards](https://www.instagram.com/palaceskateboards/) collaboration.\n\n• Lead by two members of the Synthetic team and Palace co-founder Gareth Skewis.\n\n• 4 months of operations\n\n• The collaboration will be built in **two phases**, legal and concept construction phase, and MFG execution.\n\n• This proposal aims to finance the project/legal that will organize everything for collaboration, as well as the construction of the concept/design/approach of the capsule. There is no physical delivery on this support.\n\n## **Concept**\n\nA defining underground force in menswear in the 2010s, Palace here echoes the new and weirdness of Nouns through a series of pieces that will hybridize their creative universes – inherently Italian, boldly new, translated anew. The initial inspiration will be built on the Palace catalog itself and on the undeniable influence of Nouns on nft culture.\n\n## **Introduction**\n\n[Palace Skateboards](https://www.instagram.com/palaceskateboards/) needs little introduction, but for the uninitiated, the London-based skateboarding and clothing brand has become a mainstay in the streetwear scene for incorporating 1990s and pop culture influences with their VHS-style clothing ads. In other words, it’s kitsch, cool, and everything in between.\n\n# **Why Palace?**\n\n[Palace](https://www.instagram.com/palaceskateboards/) began as a brand for skateboarders. It is now a brand for all. Models turn up for castings in Palace. Working class Glasgow dads sport Palace. Jay-Z wears Palace. So does Rihanna. Teenage girls sleep in Palace, dreaming of the heart-throbs they’ve seen wearing Palace online. 2018’s Wimbledon finalists played on court in Palace. Soundcloud rappers adore Palace. The ICA exhibits Palace. Serious DJs with peerless techno collections adorn their record boxes with Palace stickers. Ravers ingest ecstasy pills produced in the shape of Palace’s Tri-Ferg logo. Socio-political causes, including the plights of both Jeremy Corbyn and the people of Palestine, have been smartly memed in versions of the Palace triangle.\n\nA middle-aged architect can slyly intimate he has better kids than his colleagues by picking something up at Palace, even if it’s just their socks. Virgil Abloh and Marc Jacobs wear Palace. London tube station walls are adorned by carriage-length adverts for Palace. The bigwigs at Ralph Lauren were so taken by the irrepressible rise of Palace that Palace became its first ever collaborator in 50 years of singularly myth-making fashion history.\n![](https://imgur.com/dlwqvv6.gif)\n![](https://imgur.com/OEHdbcQ.jpg)\n![](https://imgur.com/KsVOGlC.gif)\nFashion’s favourite photographers Alasdair McLellan, Juergen Teller and David Sims shoot for Palace. Silicon Valley is full of people in Palace. Blue-chip stylists buy Palace from their own pocket money to lend their imagery some of the company’s off-rail styles and indigenous London magic. i-D and British Vogue carry Palace ads. Madonna and child (Rocco) have been photographed proudly wearing Palace. All the while, a fat lad on a Midlands housing estate is looking great and feeling even greater in Palace while waiting for his Chinese takeaway and playing Fortnite.\n\n## Strength in Numbers\n\nThe large take on several already-created collaborations and communication from other brands to the nft audience is an excellent entry point for the brand to reach fans and a new market. Likewise, for the Nouns community;  **significant increases in brand awareness, favorability for further collaborations, and open public interest in the brand, consequently becomes a win-win.** To highlight the ROI of the collaboration, let's look at promoting the Palace brand among your collaborations;\n\n[Gucci](https://www.instagram.com/reel/CjsKDzipOtF), [Mercedes](https://www.instagram.com/tv/CbXyjVPq0VI), [New Balance](https://www.instagram.com/reel/Cr-s3WotGz1), [Adidas](https://www.instagram.com/reel/CoHewHju2Ii), [RIMOWA](https://www.instagram.com/reel/CoUlcMeqvAs), and many others.\n\n![](https://imgur.com/qCpbrcS.jpg)\n[PALACE JAPAN MAGAZINE](https://www.palaceskateboards.com/range/spring-2019/palace-japan-magazine/)\n\n**Approach**: Use public communication-powered resources to compare social media posts containing mentions of the Palace and Nouns brand, before and after the partnership.\n\"Outcome: Insight into the Marketing ROI of an NFT Dive from Palace\" **“ Significantly increases the reach of Nouns by talking to two sets of customers instead of one and gives a signal from one brand that the other brand is trusted by the upscale market.”**\n\n# **Phase One and Phase Two.**\n\n![](https://imgur.com/liP7MrS.jpg)\n\nDetailed legal processes and collaboration building over the next four months; **Phase one**\n\n• Recitals\n• Purpose\n• Confidentiality Clause\n• Commercial Clause\n• Investment Clause\n• Duties and Obligations of Collaborators\n• Reporting and Project Management\n• Intellectual Property Rights\n\n• Fashion product mix;\n• Creation and style;\n• Prototyping;\n• Product development;\n• Marketing and Sales Strategy;\n• Collection management;\n• Evaluation of results.\n\nFor the scope of this proposal, Synthetic team is acting as the liason on behalf of the Nouns community and will adhere to all non-confidentiality & legal agreements relevant to Palace's collaboration workflow. Synthetic will work closely with the Nouns community to share public work-in-progress updates regularly which do not breach the above said agreements.\n\nSynthetic is a mediator, and nouns have a proactive CC0 license, In short Palace would not need Synthetic for commercial construction, what we are doing is raising ideas and presenting about the Nouns ecosystem: the various subgroups, the vibe, and the importance.\n\n![](https://imgur.com/ObE6wW9.jpg)\n![](https://imgur.com/sC8GwqP.jpg)\n\n## Breakdown of legal conditions\n\n**Strategy**: Legal terms and already transcribed collaboration construction.\n\n(the terms below will be robustly written to avoid legal inconvenience)\n\n![](https://imgur.com/fPYHHdj.jpg)\n\n• Recreate the look and feel of the Palace collaborative product; designing new products for that collaboration; concentrated on multiple tacit marketing and management ideas that they share.\n\n• Synthetic and the built committee will be responsible for co-managing the community outreach and communication campaign during construction.\n\n• Creative control, both teams have to work within the decided parameters and cannot go beyond that and after each step, they must report to the other brand.\n\n• Marketing strategies will be created and built exclusively by the Palace team's design and construction team. (This is due to several cordial agreements that the brand already has with the media – Vogue, WWD, Hypebeast and others.)\n\n• Nouns Palace limited edition products will be restricted to online sales.\n\n# **Palace Nouns: What to expect**\n\nThe special line is a connection to the “new” and will feature easter eggs throughout to make each piece truly special. The icing on the cake? Palace will launch women's ready-to-wear designs, making this collaboration one for all genders. The build will be designed to be a capsule of 5 distinct items. Because both aesthetics have been merged, expect logos to do the same.\n\nOn Palace’s classics – we're talking tracksuits, jeans, football shirts, skate decks – you'll see the Nouns identity scattered throughout. You’ll see this synergy on other more luxurious pieces, like a shearling jacket, as well as other unusual collectibles.\n\nAnother surprise for collectors is noggles Palace – a witty homage to the ‘weird’ collection, if you will. The idea came up and its design is about to be created as a double brand, wrapped in the Palace Nouns monogram.\n\n## Palace Nouns: What will be delivered with the execution of phases two and one\n\nEntitled “Palace Nouns,” the capsule – comprises statement-making garments designed for the collaboration. Jackets, noogles palace, vests, and skateboard decks are some of the pieces that are designed to be present, all adorning the new graphics, intertwined with the unmistakable details of Palace and Nouns.\n\nGlobal communication, Palace maintains a standardization of communication between its clients to build and launch a new collaboration; In their coverage, many media outlets go into significant detail about their collaborations and make them public globally.\n\n• Looking ahead: Building a capsule\n\nA capsule collection is essentially a condensed version of a designer's vision/collaboration, often in limited edition, that transcends seasons and trends by being functional. Thus, focusing on building and delivering key looks, without the style and theatricality of a fashion show.\n\n![](https://imgur.com/5qLsHLr.jpg)\n\n**Nouns Palace will be a 5-item capsule.**\n\n**a % (percentage) of collection sales will be directed to the NounsDAO Treasury.**\n\n## Building in public\n\n**There is no precedent for similar proposals in Nouns**, a collaboration like this creates demand for interaction and content that can be used by other builders and future collaborations.\n\nMany of the processes built to reach an agreement with a corporate are extremely tiring and even building their direction and a good presentation, most corporations prioritize closed and legal agreements to add clauses and prioritize their Intellectual Property.\n\n• Create a [general structure](https://mirror.xyz/0x905Ca7a9479EA1B9a8CDeD74da98e3CC5E6E2949) together with lawyer consulting to detail the collaboration and develop material to serve as a reference for other builders.\n\n• Unfortunately, the fashion collaborations have had terrible results in Nouns. What makes this different?\n\nYes, we are aware that we have seen several proposals without any results, this creates a history for the community to reject future approaches in the same segment, but the work we are building is extremely detailed to avoid any interruption or lack of communication. Open and detailed communication framework, creation of the capsule aimed at the general public and construction of an official approach.\n\nBuilding an official approach aims to contain everything that is expected from collaboration and has never been met;\n\n•Campaign\n•Communication published on the Palace's official social media containing a pre-announcement of the launch date.\n•Sending email newsletters to existing customers, with previews of collaboration lookbooks.\n•Mainstream coverage, Palace is known for the buzz it creates when announcing its collaborations, due to the coverage and attention its clients and media outlets create.\n\nCollaboration is the combination of numbers and audience as well as the introduction to a new group of clients. **When we mention that there are no precedents built for Nouns, we reaffirm.**\n\n**Accountability**\n\nForm a Steering Committee: composed of [DeGenData](https://twitter.com/degendata), [Ccarella](https://twitter.com/ccarella), [Oni-apenoun](https://twitter.com/apenoun) and 1 other noun who have intimate knowledge of the brands present in the collaboration.\n\nProvide this committee with **frequent updates on clauses, legal terms, construction and execution of the collaboration.**\n\n[Supriyo](https://twitter.com/next_roy) and [Benbodhi](https://twitter.com/benbodhi) also made themselves available to help us by monitoring the execution of the collaboration framework and giving us closer feedback.\n\n# **What has been done so far?**\n\nWhat has been done so far?\n\nThe Synthetic project is somewhat similar to Nouns, they are both test projects, so the constant change is aimed at future research and long-term construction.\n\nSome of our achievements and experiments during this period;\n\n\n![](https://imgur.com/fYjLkWZ.jpg)\n\n![](https://imgur.com/YbbKqSa.jpg)\n\n![](https://imgur.com/QXeZfjv.jpg)\n\nIn several of our experiments with DAO we had constructions just for the meme without considering the funding request.\n\nA document is being built on the mirror detailing our experiments and will be available on our [Twitter.](https://twitter.com/synthetic_eth)\n\n![](https://imgur.com/aQHXdNh.jpg)\n\n# **FAQ**\n\n• Will there be any activation exclusively for noun holders?\n\nYes, In short - we will be designing the capsule with a variety of nouns specific perks in mind. Details will be defined during the ideation of the capsule.\n\n• Will the capsule be made available globally?\n\nYes, with the exception of one item that will be available exclusively in certain regions.\n\n• Will sales also be available in physical stores?\n\nNouns Palace limited edition products will be restricted to online sales.\n\n• Does this proposal cover actually creating the capsule? So the end result is ultimately Palace x Nouns clothes I can buy online?\n\nThis proposal covers the consolidation of legal terms, as well as the construction of the idealization/concept for creating the capsule. The construction with already defined direction and execution of the capsule will start in phase two (second support).\n\n## Funding Request\n\nOperations & Admin Compensation - €47.000\n\n• Compensation + fees for 4 Months of two full-time synthetic team members. €37.600\n**(€4700 per member/month)**\n\n• Legal expenses - €15400\nLawyer consulting on clauses clauses established by Palace\n\nTotal =\n**€62400**\n\n# **Conclusion**\n    \n• A collaboration is being established between Palace and Nouns.\n\n• The request for this support covers compensation for the next four months of the team and legal processes and the construction of the ideation and detailing of the designer's capsule/collection.\n\n• There is no physical delivery of this support.\n\n• Marketing strategies will be created and built exclusively by the Palace project team.\n\n• The importance of this collaboration for Nouns is absolute, where you have a conversation between two audiences, one of which is global.\n\n• The specific amount of mass production of capsule items is still under study and will be detailed in the second support raised for the second phase.\n\n\n# **Team:**\n\n[Synthetic](https://twitter.com/synthetic_eth): project dedicated to the creation and transmission connections. Through this model, Synthetic has already contributed to five projects for the Nouns.\n\n**Considering the inopportune timing and where much of the attention is being directed towards the fork. This proposal has been restudied and rewritten a few times in the last week with feedback from the community and the committee itself considering the current market.**\n\n**Questions or comments? Feel free to join on the [Discord](https://discord.gg/KHDKF4up) or DM us!**\n\n![](https://imgur.com/a2rF9TT.gif)",
        "title": "PALACE X NOUNS",
        "id": "377"
      },
      {
        "createdTimestamp": "1695142439",
        "description": "# Update proposal turnaround parameters\n\nThe current proposal flow takes 10 days to complete:\n- 5 day voting delay\n- 5 day voting period\n\nThis proposal updates three properties:\n- Turns on the editing period (introduced in v3) to 2.5 days\n- Sets the voting delay to 0.5 days\n- Sets the voting period to 4 days\n\nIf passed, the proposal flow would take 7 days to complete:\n- 2.5 day editing period\n- 0.5 day voting delay period\n- 4 day voting period\n\nThe main reason for the update is to move quicker. Post-fork, the size of the voting pool decreased significantly and is more aligned which should enable us to lower the time required to pass/reject props.\n\nThe periods were chosen with the goal of having a one week turnaround time:\n- 2. 5 day editing period should be enough to integrate any minor feedback into a prop\n- 0.5 day voting delay to prevent voters from seeing outdated props at voting period start\n- 4 day voting period for voters to cast their votes\n\n⌐◨-◨ ",
        "title": "Update proposal turnaround parameters",
        "id": "376"
      },
      {
        "createdTimestamp": "1695130835",
        "description": "# Noundry-Gallery.wtf\n\n**TL;DR:** A public gallery for a thousand community-sourced Nouns traits to blossom. A proposal that generates more proposals.\n\n\nHave a look at the first iteration of [noundry-gallery.wtf](https://noundry-gallery.wtf/)\n![](https://imgur.com/kIF3iq6.gif)\n\n## **IDEA**\n\n### **BEYOND DISCORD**\n\nThe Noundry channel on Discord is one of the coolest places in the nouniverse, where dozens of artists share Nouns designs and riff off each other. However, it is somewhat niche, and not enough people are aware of it.\n\nTo address that, we want to create a public-facing gallery that will help us attract more artists and community's traits.\n\n### **PROP #348**\n\nThis idea took shape while considering the anniversary [prop #348](https://nouns.wtf/vote/348), when Goldy and team self-organised and stepped forward with some really nice traits. Thanks to them, Nouns had the opportunity to showcase its unique ability to redefine itself through user-generated content.\n\nHowever, the fact that they were the only ones to submit a proposal, despite the vibrant activity in the Noundry channel, highlights the need to make it easier for anyone to submit traits at anytime.\n\nWe took inspiration from [#348](https://nouns.wtf/vote/348) votes with reason and started building to solve this.\n\n**Noun40**:\n*\"1-Invite heads and accessories to be submitted whenever to a public place (have it be known that if your art gets included on the anniversary art update then you'll likely win X eth in retro funding enforced by tradition) \n2-Invite competition for curation through a mandated PH round 1-2 months ahead of anniversary. The mandated round selects the winning curation and includes a meaningful eth prize to incentivize and compensate for the work involved. \n3-The winning curation team submits the art update prop to coincide with the anniversary (given the legitimacy through the mandated PH round, it will likely pass)\"*\n\n**4156**:\n*\"(imho) the last step of removing the training wheels from the noundry should be the death of the convention that artwork only gets updated once per year and 8 traits at a time. It's a competitive advantage of nouns that the artwork is upgradable and the metaphor is open enough to support infinite heads, and we should be maximizing this advantage by engaging with artists, famous or anon, in every country, to make the heads collection as vast and high quality as we can. think of this as the Nouns version of the chain with the most proof of work. This could be especially important post v3. if many instances of Nounsdao have permissionless pools of capital, artists and collectors will be attracted to the instance that accumulates the most cultural capital, and new heads and other traits are an important part of this process\"*\n\n***\n\n## **NOUNDRY GALLERY**\n\n![](https://imgur.com/N21sSlv.jpg)\n*Light mode*\n\n[Noundry-gallery.wtf](https://noundry-gallery.wtf/) lets anyone with a wallet upload their 32x32 transparent pngs for head and accessory traits.Submit your traits, style them using existing NounsDAO assets, and share them with the community.\n\nNo strings attached: you retain all rights to your art until you choose to submit it to the DAO through a candidate proposal. If the proposal is approved, and your artwork is added to the collection, it will become CC0.\n\n*Note: We were reluctant on having glasses due to a potential high impact on the collection, but we might bring them back to satisfy other subDAOs.*\n\n ### **FIRST VERSION**\n\nSo far we've implemented: \n\n* Wallet connect\n* Style your traits with nounsDAO assets and publish them to the homepage and your profile page\n* Favorite traits\n* Sort traits by name, creation date, artists and likes\n* Sort through community members by names, total likes received, sign-up date and total traits submitted\n* Evaluate traits by combining them with nounsDAO assets by hitting the “generate” button on the trait page\n* Edit your profile page and connect your Twitter account\n* Dark/Light mode\n\n![](https://imgur.com/CVAa70L.jpg)\n*\"Generate\" on the trait page to test different combos*\n\n![](https://imgur.com/UxdIrLW.jpg)\n*Community page with sorting mechanisms*\n\n### **NEXT FEATURES**\n\n*  Submit candidate proposal form: in a few clicks, select eligible traits from the site, generate images, encode traits using [Run-length encoding (RLE)](https://nouns.notion.site/Nouns-Protocol-32e4f0bf74fe433e927e2ea35e52a507#6bbc1162af90427bad2dda63a3b31254) and wallet sign a release form to make the trait CC0 if/when integrated with NounsDAO. This will output the transaction copy-pasta and the markdown, giving you all the necessary elements to create a proposal easily (see mockup below). OR/AND\n*  Autosubmit to the candidate proposal endpoint on Nouns.wtf using Nouns SDK and skip the markdown copy-pasta if that is a desirable option\n* Create a commission page where anyone can set up competition for a given trait ( 0.5 ETH for the best “Golf” or “Boat-anchor” trait for ex)\n* Twitter, Farcaster and Discord bots letting us know when new traits are uploaded\n* Integration with [Volky’s Noundry Studio ](https://studio.noundry.wtf/)(Create an “Upload to Gallery” button to directly open the \"Upload Trait\" modal on [noundry-gallery.wtf](https://noundry-gallery.wtf/).)\n* Ability to comment under each traits\n* Enable ENS avatars and usernames\n\n\n![](https://imgur.com/11fHNmc.jpg)\n*\"Submit to DAO\" current mockup: Select trait, write a small description, generate sequential glasses and body color matrice to test combos, define compensation, attach release form, generate transaction with RLE encoding, and save markdown*\n\nWe want to leave room to learn from the community and see what features are desirable.\n\n**Budget: 21 ETH**\n***\n\n## **CURATION**\n\n### **NOUNDRY COMMITTEE**\n\n![](https://imgur.com/SQsJ0Zt.jpg)\n*10 Prop House elected curators NFT mockup*\n\nWhile [Noundry gallery](https://noundry-gallery.wtf/) can also be used for any subDAOs, when it comes to NounsDAO, we believe we should set up a process that guarantees quality and brand alignement. These pixels -along with the smart contract- support the treasury, and we should be considerate about what we choose to integrate with the current collection.\n\nWe suggest implementing a multi-step open process with a Prop House elected committee, akin to what large art institutions would employ, albeit executed on-chain.\n\nWe plan to conduct a Prop House round to elect 10 curators who will have the responsibility of selecting traits over the next 6 months. Each curator will receive a curator NFT and will be able to use their NFT to like traits on the platform.\n\nIf a trait receives likes from 8 curators or more, a 0.1ETH prize will be unlocked, and the trait can then be selected and proposed on-chain using the Submit to DAO page. While curators can post their own traits, they are not allowed to like their own submissions.\n\n**Budget: 10 ETH**\n\n### **ARTISTS REWARDS**\n\nArtists will get 0.1 ETH prizes when they receive more than 8 likes from curators. This budget is intended to attract artists and reach a critical mass, making the platform more appealing. With a 10 ETH budget, we can create 100 prizes. \n\nIf the experiment is successful after 6 months, we can consider repeating the process.\n\n**Budget: 10 ETH**\n\n### **MORE**\n\nIf other DAOs or Nounish projects are interested in using this platform, we could explore implementing workflows to facilitate their participation. Consider, for example, the recent 'Gardeners' concept from Nouns 40; it could be readily sourced from the community.\n\n## **CONCLUSION**\n\n[Noundry-gallery.wtf](https://noundry-gallery.wtf/) wants to help curate the great work and energy coming from the Noundry channel. I hope that in the future we can see many cool Nounish traits emerge from anons, community members, or even renowned artists. \n\nThank you for reading this prop. If approved, we will implement this next set of features in 3 months time and start the curation program in January 2024.\n\n**Total Budget: 41 ETH**\n\nAny questions or comments, feel free to reach out on twitter: [@Coralorca](https://twitter.com/coralorca)\n\n ⌐◨-◨\n\n***\n\n**About me**\nOne of the first nounish builder - started in June 2021 and never looked back. [I have been all in on NounsDAO](https://twitter.com/nounsdao/status/1440149556398739463?s=20) over the past two years. Nouns has fully captured my attention and I think it is the most exciting project ever. Here for the infinite work of art and the community driven game. \nPrevious props: [#2 3D Nouns](https://nouns.wtf/vote/2), [#126 John Hamon ](https://nouns.wtf/vote/126), [#182 AR Filters](https://nouns.wtf/vote/182)\n\n",
        "title": "Noundry-Gallery.wtf",
        "id": "375"
      },
      {
        "createdTimestamp": "1694923691",
        "description": "# Call for a Public Boycott on Nouns Auctions *** URGENT ***\n\nOG Nouners (like myself) are calling for a public boycott on Nouns auctions until 4156 voluntarily RESIGNS as a Nounder and FORFEITS his future distribution of Nounder’s rewards. The list of deficiencies are numerous. Very poor decision making, weak leadership, lack of vision, zero HR conflict resolution skills, but most importantly a condescending attitude towards the earliest members of the DAO that helped financially contribute thousands of ETH for the DAO.\n\nDon’t just take my word for it, read what other Nouners have recently said:\n\n“Not happy to hear that Nouners are actively considering a fork. People are trying to raid the treasury for their portion of the ETH. That's not good at all, nor fair to early noun adopters!”—Xaix.eth (Noun 1)\n\n“With about 3 hours left, over 50% of nouns are forking.  that's a huge vote of no confidence on leadership.  hope all founders take notes and learn something from this. \n —gmoneyNFT\n\n“Up to half the DAO is leaving. 70%+ of Nouns that are active and have contributed to the treasury are being forked. This is not great.“   —0xhindsight.eth \n\n“…nuking the discord was not optimal, not making the same mistakes matters, auction prices matter and create your future budget and inform your current one, creating a culture and foundation where coordination is easy and productive and making good marginal decisions that compound over and over matters, poison pills, bidding on the assets of friends with DAO assets and indicating plans to reinflate the newly reduced supply are all suboptimal signals, and so on” —0xdc...ff8f\n\n“This is a spectacular failure on the part of the @thenounders but more specifically @punk4156. His lack of leadership during the fork was very obvious to the community (esp OG Nouners). The only way Nouns move past this is for 4156 to do the honorable thing and RESIGN.” —beautifulnfts.eth\n\n“Fuck around, find out” —Noun 86\n\n“DAO's need leadership or the madness of the crowd will destroy it.” —0x86...b6ba\n\nOver the next several months, proposals will be put on chain to notify and remind the investing public that they should STRONGLY consider avoiding Noun auctions until certain  Nounder changes occur (which include but are not limited to 4156 exiting the project).",
        "title": "Call for a Public Boycott on Nouns Auctions * URGENT *",
        "id": "374"
      },
      {
        "createdTimestamp": "1694893115",
        "description": "# Season 3 Grants: Bring Back the Builders (Scene 1, Take 2) ⌐◨-◨ \n\n[![grants-szn-3-take-5-new-date.jpg](https://i.postimg.cc/MTmRGYdS/grants-szn-3-take-5-new-date.jpg)](https://postimg.cc/zb33tKst)\n\n## **TLDR**\n\n**Let's start Nouns Season 3 off right by bringing back the builders and the good vibes with available, reliable, discretionary funding for passionate Nounish builders.**\n\n*Note on proposal revision from V1 [(Prop 364)](https://nouns.wtf/vote/364): We had not anticipated that the [Garden Proposal](https://nouns.wtf/candidates/0xae65e700f3f8904ac1007d47a5309dd26f8146c0-elect-24-nouns-gardeners-as-the-voting-body-for-nouns-prop-house-open-rounds) from Seneca and Noun 40 would come so soon and that there was also 60 ETH in PH budget yet to be dispersed via this new program. In the spirit of positive sum collaboration, we did not want to propose a total amount of PH funding that would be difficult to allocate to builders without diminishing returns. We also received some feedback recommending a reduced time scope to prove out MVP, and have taken this to heart as well. Ultimately, we do think there is room and need for some passionate parallel efforts when it comes to finding and funding good ideas in Season 3 of Nouns.*\n\n## **THE PROBLEM**\n\nNouns historically has used small grants and Prop House rounds to complement onchain proposals. The Small Grants Committee (later known as NSFW) and Prop House rounds had fueled considerable community contributions, propelling the protocol's momentum. But during the latter half of Nouns Season 2, obtaining small grants grew challenging. \n\nWe want to help patch this bug in the protocol, and bring back the Builder-forward Nounish Vibes that brought many of us here in the first place.\n\nWe are a trusted group of contributors in the ecosystem who are willing to collectively take on the challenge of running a dynamic and transparent Small Grants Allocation Pod, as well as coordinating and championing a series of exciting biweekly Prop House Rounds over the next 3 months of Nouns Season 3. \n\n[![s2-noggles.jpg](https://i.postimg.cc/W4SHH2bj/s2-noggles.jpg)](https://postimg.cc/SX2dXbMt)\n\n## **THE PLAN**\n\n1. Coordinate with the Prop House team to set up two new \"Season 3 Grants\" Infinite Rounds, where anyone in the ecosystem can apply for retroactive funding up to a maximum of 5 ETH or proactive funding up to a maximum of 1 ETH. (Infinite Rounds are a newer piece of Prop House infra that allows orgs to deploy small grants funding in an organized and transparent way. See [Rug Radio Small Grants example here](https://prop.house/rug-radio-small-grants).) Our team will review grant applications on a rolling week-by-week basis, with a goal to allocate ~17 ETH per month, depending on submission quality.  \n\n2. Coordinate and trial a series of 3 monthly Themed Prop House Rounds with specific focuses such as “Visual Arts”, “Keep Nouns Weird”, “Gaming/Esports”, “CC0 Music”, “Public Goods,” “Media and Content\" (Final themes to be Voted on by the DAO.) We plan to explore various token-voting methods, engaging the wider nounish community in some cases with a strong consideration for maintaining as much sybil protection as possible.\n\n3. Maintain a [Public-facing Discord](https://discord.gg/zY7jpzKwEN) and consistent messaging in the Farcaster Nouns channel, for community members to ask questions and receive feedback on their applications, while also using Prop House’s built-in comment functionality to provide ongoing transparent, public feedback on builder ideas as well.  \n\n4. Publish a public summary of funds deployed for full transparency and accountability.\n\n## **THE PEOPLE**\n\nFor an important program like this, it is essential to have a team that is 1) Known and Trusted, 2) Knowledgeable and Experienced About the Ecosystem and 3) Reliable at Execution.\n\nThe proposing team has all been active and trusted contributors to Nouns for 1+ years minimum, have an intimate knowledge of the Nouniverse, and have all delivered on past projects.\n\n*Core Team Will Include:*\n* [Al409](https://twitter.com/al409eth)\n* [BradQ](https://twitter.com/iambradq)\n* [Benbodhi](https://twitter.com/benbodhi)\n* [ChrisCoCreated](https://twitter.com/ChrisCoCreated)\n* [Joshua Fisher](https://twitter.com/JoshuaFisher)\n* [Maty](https://twitter.com/matyETH/)\n* [Prof Werder](https://twitter.com/ProfWerder)\n* [Sasquatch](https://twitter.com/PartSasquatch)\n* [SuperTightWoody](https://twitter.com/SuperTightWoody/)\n* [Tha Swami](https://twitter.com/tha_swami) and his daughter [Lil Purple Blueberry](https://twitter.com/lilpurpberry)\n* [Toady Hawk](https://twitter.com/toady_hawk)\n\nTeam will only be compensated based on individual participation via Coordinape rounds every month allocated by participating team members and will rotate through responsibilities. Funds will be managed in a 3/6 Multisig. \n\n**All decisions on funding will be made by committee vote with a reasonable quorum and never at any one team member’s sole discretion. We will seek input from Nouners on Discord and Farcaster early and often. If there are not enough good applications via Infinite Rounds to warrant the budgeted ETH, we will be mindful to stretch the funding beyond the 3 month mandate, or will return excess to the DAO. Members of the team will not be eligible for funding from either the Infinite Rounds or the S3G Prop House Rounds.**\n\n\n## **THE PRICE**\n\n- Season 3 Small Grants Infinite Rounds: 50 ETH\n- Trial of 3 Monthly Themed Prop House Rounds: 30 ETH\n- Admin: 25 ETH \n    - (Admin Expense Ratio: 23%)\n\n**Total Program Cost: 105 ETH**\n\n## **THE PAYOFF**\n\nIt has been quite some time since we have seen the Nouns ecosystem buzzing with the energy of artists and creatives, the insights of talented developers and the vibes of passionate proliferators. \n\nWe will put our reputations on the line and bring our considerable skills and dedication to bear to allocate these DAO funds as effectively and transparently as possible to the most passionate and deserving builders, coders and creatives in the Nouniverse. \n\nRecent Prop House campaigns run by BASE and ThankApe have shown that there are still thousands of builders in the ecosystem, who are hungry for opportunities. \n\n**We don’t want Nouns to miss out on capturing that creative energy in Season 3 and want to be a collaborative part of the solution.**\n",
        "title": "Season 3 Grants: Bring Back the Builders (Scene 1, Take 2) ⌐◨-◨",
        "id": "373"
      },
      {
        "createdTimestamp": "1694885759",
        "description": "# Nouns x Ed Balloon: Featuring Nouns in Stop Motion Animated Series\n\n![](https://imgur.com/xhBOMrm.jpg)\n\n# TL;DR\n\n⌐◨-◨  We are presenting a proposal for the funding of two Noun-ified episodes of the Ed B 'The Puppet' TV Series to be produced by an award winning team of creatives led by Ed Balloon.\n\nAs an extension of our stop motion animated short film pilot, “A Song About Black Love“, the new episodes will focus on amplifying diversity and utilizing satire as a powerful tool for social commentary.\n\nWe firmly believe that this project not only only serves to proliferate the Nouns, but further presents a unique opportunity to showcase the Nouns as trailblazers in fostering inclusivity and thought-provoking entertainment.\n\n**A Song About Black Love | The Black Test**\n<https://vimeo.com/837481259?share=copy>\npw = nounsxedb\n___\n\n# The Ask\n\n800,000 USD for the Development, Production, and Distribution of two episodes of The Ed B ‘The Puppet’ Show to be completed over one year and funded in two phases:\n* Draft scripts for two new episodes of the Ed B “The Puppet Show” with Nouns playing a central roll within the storyline. Each ~10 Min.\n* Produce storyboards and design physical assets required for production including puppets for new characters, sets, props, clothing, etc.\n* Complete stop motion animation.\n* Animate 2d elements and composite episodes.\n* Distribute finalized episodes at film festivals, streamers and events.\n\n**Phase 1**: 50% (400,000 USD) of funding due upon execution. \n* Completion of development, scripts, pre-production, animatics, set designs and puppets.\n* Timeline for completion: 6 Months\n\n**Phase 2**: 50% (400,000 USD) due upon completion of Phase 1.\n* Completion of animation, compositing, post-production, marketing and distribution.\n* Timeline for completion: 6 Months\n\n*Funds for Phase 1 transferred to Ed Balloon LLC upon execution. A proposal for Phase 2 will be submitted upon completion of Phase 1.*\n___\n![](https://imgur.com/n7sKJXh.jpg)\n\n# Series Creative Overview\n\n## SERIES LOGLINE\n\nMeet Ed B “The Puppet”. He’s a fatalistic struggling music artist just trying to make it. Everyday Ed B faces a new challenge – having to fight off racists at Trader Joes while perusing the vegan aisle, or running butt ass naked for a couple of dollars to pay his rent, OR having to sell photos of himself on the internet to help fund his next record – BUT they never stop him from pushing towards his dream of becoming the Beyoncé of puppets.\n\n## FORMAT\n\n* 10-12 minute web(3)isode\n* Stop motion and mixed media animation.\n\n___\n![](https://imgur.com/aah6X7X.jpg)\n# Pilot Episode\n\n## SYNOPSIS\n\n“A Song About Black Love” - Infatuated by a blossoming love interest, Ed B works out a new song about the joys of Black love. Billy, Ed’s bandmate, roommate and white ally, questions a hidden secret within Ed’s relationship and mayhem ensues.\n\n## FUNDING\n\n“A Song About Black Love” was self funded by Ed Balloon in 2022 primarily through the sale of NFTs. The tentpole fundraising project was the Run Ed Collection, a first-of-its-kind generative sound and motion NFT project that blended stop-motion, 2D and 3D animation, and music. Ed Balloon dropped the 1000 piece collection and it sold out, kickstarting production of the pilot. To help uplift other artists, Ed Balloon pledged 50 percent of the collection’s secondary sales toward The Ed Balloon Generational Wealth Fund, which collects work from Black and other under-represented artists in Web3.\n\n## CAST\n\n**Ed B “The Puppet”** | Ed Balloon\n**Billy** | Seth Green (Robot Chicken, Family Guy)\n**Peggy** | Blair Socci (Comedian)\n**Savannah** | Destiny Lavigne\n___\n# Nouns Integration in New Episodes\n\nThe possibilities for Nouns integration within the Ed B The Puppet universe are infinite. Noggles can be introduced as unique accessories that Ed and Billy can interact with, enabling them to solve problems or embark on new adventures. Noun characters could even make an appearance, bringing a sense of curiosity, wonder, or even magical qualities to the narrative.\n\n___\n![](https://imgur.com/Rw9HCbF.jpg)\n# Project Objective\n\n## Amplify Diversity\n\nBy creating content that celebrates and embraces diversity, we can showcase a wide array of perspectives and experiences. The Ed B ‘The Puppet’ Show will feature characters from different backgrounds, challenging stereotypes and fostering empathy among audiences. Through collaboration with the Nouns, we aim to elevate the visibility of diverse voices and promote a more inclusive entertainment landscape.\n\n## Utilize Satire for Social Commentary\n\nSatire serves as a powerful tool for social commentary, allowing us to address pertinent societal issues in a thought-provoking and engaging manner. By employing satire, we can challenge the status quo, stimulate critical thinking, and spark conversations that lead to positive change. Our collaboration with the Nouns will provide a platform for satirical content that encourages viewers to question and reconsider established norms.\n\n## Promote Collaboration and Solidarity\n\nOur project embraces the spirit of collaboration within the web3 community. By partnering with the Nouns, we aim to showcase the power of collaboration in amplifying diverse voices and driving innovation. Through cross-platform promotions, joint marketing initiatives, and immersive fan experiences, we can create a unified front that promotes solidarity within the industry. We will be using noun features (Noggles, characters, etc) in these episodes.\n\n___\n![](https://imgur.com/LGpjxXz.jpg)\n# Creative Team\n\n## Ed Balloon [Series Creator & Creative Director]\n\nSpearheading cultural representation and identity through his music and digital art, Ed Balloon has solidified himself not only as a Web3 artist and musician but also as a community leader.  Known for his innovative approach to music making, dynamic production style, and unique blend of electronic, hip-hop, and R&B, his 2022 Run Ed collection was presented as a one-of-a-kind generative sound and motion endeavor that blended stop-motion, 2D and 3D animation, and music. To help uplift other artists, 50 percent of the collection’s secondary sales continued to go toward The Ed Balloon Generational Wealth Fund, which collects work from Black and other under-represented artists in Web3. The pioneering musician also recently self-funded through the sale of NFTs the stop motion animated satire \"A SONG ABOUT BLACK LOVE.”  Executive produced by Daveed Diggs and starring Ed alongside actor Seth Green, the film showcases the difficulties of finding love as a black puppet.  Ed was also recently nominated to nftnow's NFT100, a celebration of the top 100 influential creators and community leaders in the NFT space.\n\nTwitter: @Ed_Balloon\n\n## Daveed Diggs [Executive Producer]\n* Vocalist in experimental hip hop group Clipping.\n* Co-star in The Little Mermaid, Hamilton, Snowpiercer, Wonder, Velvet Buzzsaw\n* Writer and Producer of Blindspotting\n* Tony and Grammy Winner. Emmy Nominated.\n\n## Studio Linguini [Animation & Editorial]\n* Animated Terminus, Bird With No Legs, A Song About Black Love\n* Music videos for Ghost Mane, Kill The Noise, Tobi ft. Mick Jenkins, Ed Balloon\n\n## Endless Noise [Music & Sound]\n* Composers on Nike Freestyle, Give A Mouse A Cookie, The Box, One Bullet, A Song About Black Love\n* Boutique Music Publishing Library.\n* Music & Audio Post Production clients include Nike, Disney, Amazon, Discovery WB, NBC, HBO, Apple, Coca-Cola, VW, Marvel and many more.\nEmmy, Grammy, Cannes Gold Lion, Clio and AICP Award Winners.\n\n___\n![](https://imgur.com/jHeQPcZ.jpg)\n# Use Of Funds\n\nTo bring our vision to life, we are requesting funding in the amount of $800,000. We will allocate the funding as follows:\n\n**Production Costs: $675,000**\nCasting and talent fees\nCrew salaries and wages\nProduction design and set construction\nEquipment rental and maintenance\nVisual effects and post-production expenses\n\n**Marketing and Promotion: $100,000**\nAdvertising campaigns\nSocial media marketing\nPublicity and press events\nPromotional materials (posters, trailer, etc.)\nParticipation in industry events and festivals\n\n**Legal: $25,000**\nContract Review\nDigital rights management\n___\n![](https://imgur.com/kkOyLC9.jpg)\n# Conclusion\n\nIn conclusion, our proposal to fund two additional shows based on our pilot short film presents an exciting opportunity to amplify diversity and utilize satire to address societal issues. By collaborating with the Nouns, we can showcase the power of diverse voices, challenge established norms, and foster inclusivity in the entertainment industry.",
        "title": "Nouns x Ed Balloon: Featuring Nouns in Stop Motion Animated Series",
        "id": "372"
      },
      {
        "createdTimestamp": "1694512295",
        "description": "# Noun en Scène (aka Mise en Scène with Noun 'Muppets')\n\n*Sponsored through [lil nouns DAO](https://lilnouns.wtf/sponsor)*\n\n# **TL;DR**\n\n**Cinematic stills from a television series that doesn't exist (yet!) starring Chip - a cookie Noun - and Benny - a rabbit Noun- in the surreal, funny and over-the-top adventures they find themselves on while trying to do good in the world.**\n\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreie764jersnc3mtarq7zuvcinstear2jvkbbtxtsvby4juzobbrtfe)\n![](https://ipfs.decentralized-content.com/ipfs/bafkreierjgxuxtxk6kx4q5nxxlgsqwtiohvtg3f4rv4wn5nkknqdz2phsq)\n\n\n# **TELL YOU MORE ABOUT THE PROJECT? WHY OF COURSE!**\n---\nA single frame can tell an entire story. It can draw you in. Make you think. Send you tumbling towards what happens next… \n\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeiflwarsvyiqiycndtqh6jn2qjobbakao2kxa7wspfpiszugjqyony)\n(*let’s put some Noggles on Roger*)\n\nIt’s what the best films do. I mean look at that Roger Rabbit still. What are Roger and Eddie looking at? What’s about to happen? And why are they handcuffed together?! Not to mention location, costumes, use of lighting or even the colors! There’s a palpable tension and curiosity in that single frame that makes us **care**. \n\nI want to bring that to a fun art project focused on a pair of Nouns - Chip and Benny - and their adventures in the - slightly (or sometimes *very*) heightened and over-the-top - world of ‘**Noun en Scène**’.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreidmghr5rzmqwejtz5gwvnlmyrmnbzf7noty6mb5b7ykcgyqln5veu)\n\nThink of it as a cinematic one-shot storytelling project that takes our pixelated, digital little Nouns, turns them into real life ‘muppet’-like puppets and then throws them into film scenes with flesh and blood people.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreieoo7k4u7uen4d7slr6kt7re2234xtivk7sybo3j4z72buzpgueju)\n(*cinematic scenes that make you ask questions and keep looking*)\n\nEvery one-shot tosses our sweet, little Nouns into a new dramatic scene where they're forced to deal with the crazy situation they've gotten themselves into by trying to help or do a good deed for a random human they've met. \n\nAnd through these scenic moments, the world of Chip, Benny and the 'Noun en Scène' project will grow, evolve and hopefully become something people want to see more of!\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreia25gd5kfdglu52e2jakou3luj4neyzse52jgeelpvti57o2jojwi)\n\nBy utilizing ‘muppet’-like characters mixed with real people and heightened, cinematically-lit scenes, the absurdity and beauty of life will become that much more stark, profound and hopefully very funny. \n\nTaking cues and paying homage to a variety of influences including Alex Prager, The Far Side, world cinema, the Kermitage Collection and many more, this project aims to utilize a couple Nouns to create captivating characters we just can’t get enough of. \n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeifed3xlopidln4j4mieislub2pq4txtoealf6cvswxew6f7dlsxky)\n![](https://ipfs.decentralized-content.com/ipfs/bafkreif6ubfkoutleoqfxdhqctt2cdqwuidral6csbcp2k74brj32ahdai)\n![](https://ipfs.decentralized-content.com/ipfs/bafkreieoelw5lordgtyffzqby2pwjfs6u6crdhagk4t24mjgqlxma2wqrq)\n![](https://ipfs.decentralized-content.com/ipfs/bafkreibkhnf5lwzniwisn7jgzyxmk6ujnenj7gozeib4j7whkgndu3thaa)\n\nChip and Benny are just a couple innocent, little guys trying to help and do good in the world, but instead they keep finding themselves entangled in situations way beyond their depth. \n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreihyboig23zcntxs4mhhqkwyeqfzb3nnj7kq7bsfbbf5nwdbbwxlvy)\n\n# **COOL. SO WHAT’S THE PLAN?**\n---\n\nThese shoots will be treated like an indie film production - the difference being that we are capturing **single shots** that tell full, rich stories while still requiring casting, makeup, lighting, location scouting/rentals, puppet styling etc. \n\nOn the casting front, while at first it will make sense to work with local working actors/models and friends, as the project gains traction and grows - or when I’m working on my next tv show - I think there is a fun way to bring known name actors into these scenes and add a whole other level of playfulness to the project. \n\nThe first step will be designing, modeling and manufacturing our Noun ‘muppets.’ **Luckily, I’ve gotten a very exciting collaborator on board for this!**\n\n# **PUPPET HEAP!**\n---\n[![](https://ipfs.decentralized-content.com/ipfs/bafkreifgehg3mxpwez6iwiptsiqciuhg4v447nskvqyts6aclxsyxwpqzq)](https://www.youtube.com/embed/agxY_pJwo8o?si=vKyoY-cGw9rH14NI)\n\n\n**Puppet Heap** is a unique design and production studio specializing in storytelling through the creation of iconic characters for all sorts of media including film, television, advertising, theater, and new media. The company was founded by artist, designer, filmmaker, and teacher Paul Andrejco after observing the burgeoning pile of puppets that had accumulated in his Hoboken apartment back in the early ‘90s. Now, just a few blocks away, Puppet Heap is home to teams of artists, designers, writers, and producers creating character based narratives for clients around the world including **The Walt Disney Company, Sesame Workshop, and Nickelodeon**. Puppet Heap has been entrusted with the care, maintenance, and creative support of the Muppets for Disney’s **The Muppets Studio** since 2006.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeicf2f5r3nabecoodiso5baxyzi2gwafqaobj74ju22osfbvl7xxle)\n(*Puppet Heap team on set of Imagine Dragon's 'Radioactive'*)\n\nPuppet Heap loves the project - *I nounspilled them* - and will be joining to design and create the physical puppets of Chip and Benny. And as scale and scope continue to evolve in their journey (we have big plans), they’ll be there, helping to tell their growing story - and all the other Nouns that come into play too.\n![](https://ipfs.decentralized-content.com/ipfs/bafkreigg33zfrairgp6s7pp4ubxeqbub2aflalz744n6ux3czxoiwdhhfu)\n\n# **AWESOME! AND WHAT ABOUT ME?**\n---\n\nMy name is Chris Martin - not of Coldplay, sorry - and I’ve been making independent, global film and television productions for a decade plus now - primarily in Korea.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreianc72wofibm66pb6cdpyhrxwkyvydmryhcdiqsc4w3zzycf6nqzi)\n\nMost recently, I co-created, co-wrote, directed, showran,and EP’ed 20 episodes of a show called 'Dramaworld' currently streaming on Amazon that stars well-known actors including Liv Hewson (‘Yellowjackets’, ‘Santa Clarita Diet’), Brett Gray (‘I’m a Virgo’, ‘On My Block’), Daniel Dae Kim (‘Lost’, ‘Hawaii 5-0’), Ha Jiwon (‘Secret Garden’) and K-pop star Henry Lau.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreidcjuv6vkzugofvzyvr757lelpmvombyncr3pey7z7kndmjx2cd64)\n\nWith everything I create, I try to lean into **a playful, magical realist tone that’s grounded in heart**, which is the kind of storytelling that I think is not only a perfect fit for Nouns, but also an incredible way to bring people into this journey of Chip and Benny as they go around trying to help.\n\n\n\nI love everything about Nouns - the ethos, the support for creative, weird projects, and did I mention the freakin’ Noggles?! - and have been trying to figure out how I could do something creative that furthered that mission for quite awhile now. \n\nThen suddenly, while wandering around a street festival the other day, I saw this:\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreibrizjphslww7h46ya3f74alx2xunpxznggmmnd4f2mhmnp6sxmna)\n\n**And bingo! 💡**\n\nThe idea for ‘Noun en Scène’ landed fully formed in my brain! And I knew I had to make it a reality and see what it could eventually become!\n\n# **WHY SHOULD NOUNS FUND THIS?**\n---\n\nStorytelling is everything - always has been. And in a world where we are inundated with ‘content’ online, a playful, quirky and precise project like this will be a breath of fresh air to stand out against the noise.\n\nUtilizing photography as a medium and consistent characters as the subject will allow fans to come back, excited to see where the journey of Chip and Benny will lead and who they'll be trying to 'help' next. \n\nAnd by staging everything down to the last detail, each photographic story that comes out of ‘Noun en Scène’ will simultaneously be a fine art piece, a Sunday (web)comic and continuous character development leading to a broader (and very Noun-curious) audience. \n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreid2an66kifpojvxdzq4pjmnw5ix2cynbqhwemincxiclap2a65i3y)\n\nAnd in the spirit of '**mint everything**,' we are planning to utilize Zora to **mint and document our progress** - design sketches, scripts, behind the scenes, etc. It feels like a great way to document the process of creation and build something creative in public. \n\n# **Speaking of creative, meet Benny!**\nHere's Paul's initial design for Benny:\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeiad34c4vymsclagkv3jrfzag6hzuzpys5ttuqrpejtekgjjh7j27u)\n\nArms and legs, oh my! With our puppets, we want to keep what makes Nouns distinct while adding a whole new flavor that brings them to life and gives them character. \n\n### **The (mis)adventures of Chip and Benny** \nBy creating empathy and connection with our two little Nouns through **visual storytelling**, the project will help spread Nouns and nounish-ness far and wide - just how Chip and Benny would want it. \n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreib5bcbujje7cllcnu4f7iiwympjh3hdlk6tnctarnv7tmpl52gv4y)\n(*One-shot example sketch - 'Chip and Benny Check for- AHHHHH!'*)\n\nAnd we plan to have this first leg of the project culminate in a **fun droposal** that takes Chip and Benny IRL in eye-catching ways (*see below for a tease*). \n\n# **THE ASK AKA THE BUDGET**\n---\n\nWe want to propose a tight, but realistic budget that still allows us to execute this at the highest professional standards, so that we can first not only prove the concept, but create something that rivals the quality of anything you'd see in a high budget studio release. \n\nWe want to go above and beyond everyone’s expectations for what 'Noun en Scène' can be because seeing is believing and we think this initial batch of scenes will prove the potential of building out characters in a uniquely nounish way and make people want to see where we can go with Chip and Benny in the future. \n\n**BUDGET:**\n* **$40,000 USDC (2 puppets x $20,000 USDC/puppet)** **one-time cost** for the design and fabrication of our ‘Noun Muppets’ - this allows Puppet Heap to design, costume and build out Chip and Benny in their physical ‘muppet’-ish forms (**to be used again and again as the project continues and evolves**).\n* **$50,000 USDC** production budget to shoot and finish 5 'one-shots' - this will be a fully crewed up shoot with actors, set design, hair & makeup etc. and the budget will be used to pay crew, rent equipment, secure locations, finish photos in post etc. (all the production related expenses)\n* **Detailed breakdown** to give a general idea of how the funds will be used **[HERE](https://docs.google.com/spreadsheets/d/1yym2vm-ojk9sXjrwziRHCDY6VYrSZPva3XBaryZLFUY/edit?usp=sharing)**\n* **1 NOUN post delivery** (*cookie head Noun 483*) - A big reason I want to do this is to become a more active and involved part of the Nouns community so I can more fully participate and build together with other Nouners\n\n**TOTAL BUDGET: $90,000 USDC + 1 NOUN (post delivery)**\n\n# **TIMELINE**\n---\n\nUpon prop passing, we can make our puppets and be in production in approximately **2.5 months** and aiming to have finished images ready **~1 month later**.\n\nAll the while **minting our progress and creative developments** on Zora.\n\n# **FUTURE STEPS**\n---\n\nMy aim for is to use the project to develop the characters and story of these two best friends on their journey to help and do good - even if it always seems to go a little sideways - in a surprising novel and onchain way. 'Noun en Scène' as the first piece will allow us to capture surprising, fun and shareable bitesize stories, which hopefully utimately brings Nouns into the real(ish) world and helps people fall in love with Chip and Benny.\n\nWhich brings me back to the aforementioned droposal! \n\nWhat better way to drum up curiousity than a **droposal** to help take Chip and Benny IRL. More on 👇 soon! \n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeihvxlu2d46qgru3qmlldtxluswjmujefg3k7vby6sdgb4cifyzmuy)\n(⌐◨-◨'s *on billboards?*)\n\n\nPaul and I have a ton of fun ideas for where to take this and how to grow it, so we're looking forward to what we can achieve this go round while keeping our minds open to how it can be expanded (*cough* a full blown live-action series *cough*).\n\nThank you for taking the time to read and look forward to making the world a little more Noun-ish!\n\n**Time for Chip and Benny to save the world. One good deed at a time!**\n\n*Keep Nouns weird.*\n\n-Chris",
        "title": "Noun en Scène (aka Mise en Scène with Noun 'Muppets')",
        "id": "371"
      },
      {
        "createdTimestamp": "1694386127",
        "description": "# Nouns for sale (76, 81, and 208)\n\nhttps://blur.io/asset/0x9c8ff314c9bc7f6e59a9d9225fb22946427edc03/76\n\nhttps://blur.io/asset/0x9c8ff314c9bc7f6e59a9d9225fb22946427edc03/81\n\nhttps://blur.io/asset/0x9c8ff314c9bc7f6e59a9d9225fb22946427edc03/208",
        "title": "Nouns for sale (76, 81, and 208)",
        "id": "370"
      },
      {
        "createdTimestamp": "1694262635",
        "description": "# Commercialization of the \"Noggle Changer\"!⌐◨-◨\n\n# TL;DR\n- We aim to launch the real Noggles brand \"Noggle Changer\" in Japan.\n- Target product launch: December 2023 - January 2024.\n- Allocate 50% of sales to the treasury, with the remaining 50% as additional operational funding for this project.\n- Increase Nouns⌐◨-◨ market recognition through sales.\n- The future vision of the “Noggle Changer” aims to achieve both social value and revenue.\n# Firstly\n▶**This proposal has been revised based on the feedback** received for the proposal submitted as a candidate.\n▶Attached as separate documents, you will find a report on the background of this project and my experiences. \n⇒[**Project Origins: How My Experience Fuels Our Vision**](https://eibakatsu.com/noggle_changer/Project_Origins__How_My_Experience_Fuels_Our_Vision.pdf) \n* If you can't open the link, please use bellow URL.\nhttps://eibakatsu.com/noggle_changer/Project_Origins__How_My_Experience_Fuels_Our_Vision.pdf\n\n# Our Strengths\n![Noggles.jpg](https://cdn.discordapp.com/attachments/1145970007218589736/1145977088457850920/Noggles.jpg)\n## Support from Japan's Nouns Community\nNouns is one of the most popular NFT IPs in Japan, attracting many people to the allure of Noggles. \nSubDAOs like [**pNouns**](https://twitter.com/pNounsOFFICIAL) , [**NounsDAO Japan**](https://twitter.com/NounsDAOJAPAN), and [**NOUNS BASE**](https://twitter.com/KURAN_Nouns) have spontaneously formed, each with several hundred participants in their respective communities. \nWith such a substantial community presence, it becomes feasible to market real Noggles to the general public through a brand strategy.\n\n## Product Differentiation \n### Dedication to Refined Design and Craftsmanship\nIn collaboration with [**KISSO Corporation**.](https://kissojapan.com/) , we have meticulously crafted a prototype by faithfully reproducing the dimensions of Nouns' ⌐◨-◨.\n* **Sustainable Material:** Cellulose acetate for quality and sustainability.\n* **Commanding Design:** Front design, two-tone lenses, thicker temples.\n* **Comfort:** Features like arms and nose pads for extended wear comfort.\n* **Color:** Palette based on prototype feedback.\n* **Affordable Pricing:** Enhancing accessibility to a wider audience.\n# The Background of the Brand\n![NoggleChanger.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145978969032765450/NoggleChanger.png)\n\nMy organization, pNouns, introduced **Proposal 228** which received support from Nouns DAO.\n**I was responsible for overseeing the prototyping and development of the product.**\nThe prototype noggle received significant **positive feedback**. \nWe believe that real noggle can build a substantial fanbase, and **we are planning to bring “Noggle Changer” to market.**\n\n# Brand Design\n## ▼ Logo Concept\n![NoggleChanger_logo.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145977825963286588/NoggleChanger_logo.png)\n\n## ▼ Product Description\n**Components:** Outer box, hard case, cloth, main body\n**Material:** Cellulose acetate\n**Colors:** 4 colors(Red, Gray, Yellow, Green)\n**Size:** Unisex\n**Retail Price:** 0.08 ETH (excluding shipping expenses)\n**Production Quantity:** 500 units (100 units reserved for management, etc.)\n\n![pNounsNoggles_imgA.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145977993601241179/pNounsNoggles_imgA.png)\n\n## Co-branding with Creators\nThe product packaging will feature artwork by **[@KURAN](https://twitter.com/KURAN_Nouns)**, the creator of the NFT Collection **\"NOUNS BASE\"**,thereby augmenting the allure and worth of the product. We intend to bolster the co-branding collaboration with Mr. KURAN's \"NOUNS BASE\" by emphasizing customer satisfaction, stringent quality control, and various appealing promotional items.\n\n## Introduction to KURAN's Artwork [https://lit.link/KuranPJ](https://lit.link/KuranPJ) \n![nounsbase1.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145979987170697227/nounsbase1.png)\n![wip.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145980143676956692/wip.png)\n## ”NOUNS BASE” holder Utility(Original Nouns)\n![Nouns_member_all.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145980437429235712/Nouns_member_all.png)\n\n\n# Budget and Revenue\n## Total ask：35ETH\n1.Production Management Costs(for a Minimum Batch of 500 Units) **16.0ETH** \n2.Project Operation Expenses **19.0ETH**\n\n[![”Noggle Changer”cost.png](https://cdn.discordapp.com/attachments/1145970007218589736/1148179170514444298/totaiask.png)]\n\n## Production Management Costs \nProduction Management Costs encompass production expenses totaling 9 ETH for a minimum batch of 500 units, along with expenses related to promotional items, inventory management, and logistics.\n\n## Project Operation Expenses\nThese expenses cover the operational costs of the project, the development expenditures for the online shop, and promotional activities like event participation. Importantly, engaging directly with customers during events is anticipated to make a substantial contribution to raising awareness of Nouns!\n\n# Sales Plan(Max)\nWe will sell the \"Noggle Changer\" on an online platform (with a sales period of approximately two weeks).\nThe planned sales quantity is **400 units**.\n\n**1.Special Pre-Sale**▶ 200 * 0.05 =10ETH\n**2.General Sales**▶ 200 * 0.08 =16.0ETH\n10ETH+16ETH＝**26ETH**\n\n## Special Pre-Sale for Nouns DAO ＆ Sub-DAOs \nIn the Special Pre-Sale, we will offer an early release exclusively for Nouns DAO＆Sub-DAOs (Limited to the first 200 units).\nAs a special pre-sale offer, Nouns DAO＆Sub-DAOs will be eligible for a discounted price of 0.05 ETH per unit.\nOur sales target is set at 200 units, aiming for a complete sell-out.\nHowever, to maintain scarcity, a purchase limit will be imposed on the Special Pre-Sale.\n\n## Return to Nouns DAO and Simulation\n**During the online sale period, when we reach 80% of the sales target, we will allocate 50% of the revenue to Nouns DAO.**\n\n### If 80% is sold\n200 * 80％ * 0.08 =8ETH\n200 * 80％ * 0.08 =12.8ETH\n（8ETH+12.8ETH）/2＝**10.4ETH**\n\n### If all units are sold\n200 * 0.05 =10ETH\n200 * 0.08 =16.0ETH\n（10ETH+16ETH）/2＝**13ETH**\n\nIf all units are sold, **13 ETH will be returned to the treasury** out of the initial batch production cost of 35 ETH. \nIn this scenario, we invest 13 ETH in Phase2 development, **creating a win-win relationship.**\n\n# The Need for Initial Investment\nWhen an individual starts a brand, there is a significant risk of not being able to recover the initial investment, making it challenging to proceed with commercialization.\nBy leveraging Nouns' IP and receiving support from Nouns DAO, we want to demonstrate the ability to launch a brand from scratch that utilizes Nouns' IP.\n\n# Future vision of the \"Noggle Changer\"\nThrough the commercialization of the product and market expansion, when we achieve 80% of the sales target, we will allocate half of the revenue to Nouns DAO, and the remaining half will be dedicated to the next fundraising for the \"Noggle Changer.\"\nIn Phase2, we plan to develop and sell limited editions.\n※For those who wish to learn more, please refer to the supplementary document.\n[Project Origins: How My Experience Fuels Our Vision](https://) \n\n## **Timeline.**\n**Phase1**: Commercialization of \"Noggle Changer\"\n**phase2**: Balance social value and profitability\n**Phase3**: Project expansion and sustainable growth\n\n ![NoggleTimeLine.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145977375797030932/NoggleTimeLine.png)\n\n# ⌐◨-◨ Reputation Amplified through Social Media!\nWe are thrilled to highlight that individuals we've engaged with have proudly showcased our prototypes on various social networking platforms, further amplifying the reputation of ⌐◨-◨.\nOur commitment to fostering connections with diverse Nouns communities remains steadfast as we actively leverage social media platforms to enhance our visibility and engagement.\n\n![tagawa.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145981945243762778/tagawa.png)\n[https://twitter.com/Marcot_no1/status/1673454100737048576?s=20](https://twitter.com/Marcot_no1/status/1673454100737048576?s=20) \nBoth esteemed artists, **Mr. Tagawa（[@Marcot_no1](https://twitter.com/Marcot_no1)）**, and **Mr. Fukazawa（[@StreamDeep](https://twitter.com/StreamDeep)）**, graciously adorned our prototypes during the **\"Pray for Peace Collection\"**, a poignant peace festival commemorating Okinawa Memorial Day, held on June 27th. We extend our heartfelt gratitude for their participation and support.\n\n![bonno.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145982252291993600/bonno.png)\n[https://twitter.com/bonno_358/status/1696010256630067527?s=20](https://twitter.com/bonno_358/status/1696010256630067527?s=20) \n**[@bonno_358](https://twitter.com/bonno_358)** proudly showcased and introduced the prototype Noggle as part of NounsDAO JAPAN's \"Nationwide Baton Relay\" initiative. For this engaging project, we contributed the prototype Noggle, which was incorporated into a LEGO baton, connecting members from across Japan and offering them an enjoyable Noggle experience.\n\n![rippi.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145982353076924476/rippi.png)\n[https://twitter.com/rippi37/status/1696143006762664361?s=20](https://twitter.com/rippi37/status/1696143006762664361?s=20) \n[@rippi37](https://twitter.com/rippi37) wearing the Noggle prototype takes a commemorative photo alongside a shrine! \"I want to introduce it to Nouns enthusiasts.\" \"I think they'll be amazed by the high quality.\" We received these delightful comments!\n\n# Team\n![えいばほ～.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145981078675402812/d4e8965fd11e1e00.png)\n**[Project Leader] [kurage](https://twitter.com/yuru2_Kurage)** \n**[Product Supervision] KISSO Corporation (**https://kissojapan.com/**)**\nSupervision of overall quality and specifications of product manufacturing.\n**[Creator] [KURAN](https://twitter.com/KURAN_Nouns)**  \nProvide and supervise design of packaging and sub-goods for initial sales\n**[Project supporter]** PR and operational support\n- **[Eiba](https://twitter.com/eiba8884)**\n- [**Takumi-san, a traveler of life**](https://twitter.com/Okirakukai)\n- **[day-nao.⌐◨-◨](https://twitter.com/daynao_daynao)**\n- **[Zuka](https://twitter.com/zuka20210101)**\n- **[Hama-chan. ⌐◨-◨](https://twitter.com/hamachan_farm)**\n- **[BONNO](https://twitter.com/bonno_358)**\n- [**Shikki**](https://twitter.com/ringo4luv)\n- [**Sugishige**](https://twitter.com/sugishige2021)\n- [**Mizuki Green**](https://twitter.com/mizukigreen64)\n\n# Final Reflections\n\"Noggle Changer\" is a project that has sprung from my journey of self-liberation. With \"Noggle Changer,\" I aim to offer avenues for enhancing self-affirmation.\n**I aspire to establish a sustainable society where everyone can harness their unique strengths and capabilities. This aspiration aligns with the pivotal objective of creating an all-inclusive society, as envisioned by the SDGs.**\nBy collaborating, I am confident that we can accomplish remarkable feats!\nThank you for taking the time to look over this proposal until its conclusion.\n\nLastly, I'd like to impart my cherished African proverb:\n> ### If you wish to journey swiftly, venture alone. However, if your destination is far-reaching, embark together.\n ![introduce.png](https://cdn.discordapp.com/attachments/1145970007218589736/1145982571986034780/introduce.png)\n**Proposed by: [kurage（くらげ）](https://twitter.com/yuru2_Kurage)**",
        "title": "Commercialization of the \"Noggle Changer\"!⌐◨-◨",
        "id": "369"
      },
      {
        "createdTimestamp": "1694216807",
        "description": "# Nouns iOS Gov Client\n\nWe propose developing an iOS native app that enables Nouners to engage in governance activities on the go. We believe the app will enhance voter participation and democratize decision-making. The app will also serve as a valuable onboarding tool for new members and complement our existing governance clients. \n\n## Description\nWe have been developing an iOS app for NounsDAO. Our primary objective is to boost voter participation by providing Nouners with a user-friendly app that simplifies interactions with the Nouns protocol. We firmly believe that casting votes should be as effortless as sending a text message.\nThe core features will empower Nouners and community members to access the latest information and interact seamlessly with the Nouns protocol. Additionally, our experimental features will open doors to new onboarding methods, enhance community engagement and discover new utility. This app will be a valuable addition to existing governance clients, such as Nounsagora, Voter, Mmmogu, Nounoclock, Shenounigans, and many others.\n\n## Core Features List\n* Feed tab: Featuring the latest community, auction, trade, and proposal information in a clean and concise format.\n* Community tab: Providing an easy and concise way to find Nouners and delegates.\n* Auctions tab: Displaying the latest auction and market information from platforms like Opensea, LooksRare, Blur, etc.\n* Proposals tab: Read, track, and share proposals.\n* Wallet tab: Connect your wallet, check your Noun bags, cast and delegate votes (with Metamask, Rainbow, etc., integration).\n* Push notifications: A flexible notifications center for all activities, including notifications for specific trait minting, trades, delegations, etc.\n\n## Experimental Features\n* AirPlay support: Stream \"A Nouns Movie: Rise of Blus\" from the app to a monitor or TV.\n* Maps support: Display cities where Nouners and community members travel and reside (limited to locality).\n* NFTs: Distribute commemorative NFTs to active participants (those who check auctions more than three times a week receive a code to mint a unique Nounish NFT).\n\n## Timeline\n* Core features delivered in 1-2 months\n* Experimental Features in 4 months\n\n## Git repo\n* We welcome PRs at\nhttps://github.com/fiveoceans-dev/nouns-mobile/tree/main/ios-swift\n\n## Budget\n10 eth - UI design\n15 eth - retrofund\n30 eth - R&D next 5 months\n12 eth - maintanance ∞\n**Total: 67 eth**\n\n## Transaction\n\nSend 67 eth to [Five](https://twitter.com/fiveoceans_dev)\n0x7Bd4cdbD92ab09fA689ED899cddDD6ECCFeF7a54\n\n## Screenshots\n* ### Splash screen\n![](https://hackmd.io/_uploads/Hy-zc4OR2.gif)\n\n* ### Auction\n![](https://hackmd.io/_uploads/HklGc4_Rn.gif)\n\n* ### Proposals\n![](https://hackmd.io/_uploads/BklzcVO0n.gif)\n\n* ### Wallet\n![](https://hackmd.io/_uploads/S1Jf5EuC2.gif)",
        "title": "Nouns iOS Gov Client",
        "id": "368"
      },
      {
        "createdTimestamp": "1694123651",
        "description": "# Update Candidate Submission Fee\n\nThe create candidate charge was inadvertently set to 0.01E upon upgrading to V3, and this proposal is to change it to the correct fee of 0.1E.",
        "title": "Update Candidate Submission Fee",
        "id": "367"
      },
      {
        "createdTimestamp": "1694115851",
        "description": "# I would also like 200 ETH please\n\nSeems like everyone else doing one of these now and I don't want to feel left out.",
        "title": "I would also like 200 ETH please",
        "id": "366"
      },
      {
        "createdTimestamp": "1694108495",
        "description": "# (w)stETH to rETH Treasury Diversification 🐮\n\n## Description\n\nFollowing the [recent proposal](https://nouns.wtf/vote/320) to test CronFi’s TWAMM solution for [LST diversification](https://etherscan.io/address/0x0BC3807Ec262cB779b38D65b38158acC3bfedE10) of Nouns treasury, we at CoW Protocol would like to propose testing execution using our unique batch auction process before proceeding with the full 7k ETH amount. \n\nThere’s been interest in diversifying [Nouns DAO treasury](https://etherscan.io/address/0x0BC3807Ec262cB779b38D65b38158acC3bfedE10), specifically stETH→rETH. Recently some twitter avatars have [posted](https://twitter.com/0x70626a/status/1684936056443969536) a good analysis of the 500 ETH TWAMM trade, specifically, that the trade resulted in 518.51 rETH received for 500 wstETH (a whopping 1.25% slippage for a stable swap!). We believe CoW Protocol will provide a much more competitive execution price, that is compatible with fair market prices.\n\n## Background\n\nCoW Protocol has been using a multi-token batch auction on Ethereum mainnet for over two years, facilitating [>$27.3B of trading volume](https://dune.com/cowprotocol/cowswap). CoW Protocol uniquely allows its users to get best execution prices even with a lax slippage tolerance thanks to 15 competitive solvers participating in an auction mechanism that protects the users by granting the right to execute the trade to the solver offering maximal price improvement.\n\nCoW Protocol is used by a [number of DAOs](https://cow.fi/daos) for their trading operations including ENS, Aave, Nexus Mutual, Gnosis, Karpatkey, Olympus DAO, Badger DAO, Yearn and more. \n\n## Advantages\n\nCoW Protocol pioneered intent-based trading since its inception in early 2021. This allows users to define order parameters without specifying the actual execution path (`calldata`). Users should expect the most optimised execution route to be chosen by the winning solver at the time of execution. \n\n## Considerations\n\nGiven a sell order of 500 wstETH→rETH there are several options for order placement that can provide different properties. We'll focus on a *TWAP* order setup although it seems to not be necessary in a smaller 500 ETH trade - the purpose is to demonstrate how a larger order could be set up.\n\nFor a 500 wstETH→rETH we propose to use a TWAP order of 5 equal parts worth 100 wstETH each. This may result in an execution up to 525 rETH.\n![](https://hackmd.io/_uploads/BJfUbBKo2.png)\n\n### `TWAP` Conditional order\n\n* Launch date: August 17th, 2023. [See twitter post.](https://twitter.com/CoWSwap/status/1692152855694803112?s=20)\n* Transactional volume: ~$4.2M. [See dune query](https://dune.com/cowprotocol/cow-swap-limit-orders-kpis).\n* Value held within `ExtensibleFallbackHandler`-upgraded Safes: ~$12.3M\n\nThe TWAP [implementation](https://github.com/cowprotocol/composable-cow) uses a constant limit price across each. Given the stability of wstETH→rETH, the limit price may be set in advance with a high confidence that this will be representative at the time the proposal is executed (and for the duration of the TWAP).\n\nOrder parameters suggested for this proposal:\n* Limit price: 1 wstETH = 1.038 rETH. This includes 1% slippage tolerance to allow for charging a fee from the sell token and to get higher confidence in execution. **It is still expected to be executed with a much lower slippage in practice.** See the above mentioned dune dashboard's *'order surplus'* whereby the order's slippage is protected.\n* 5 equal parts of 100 wstETH\n* Time intervals of two hours between parts \n\n## Methodology\n\nTo achieve this TWAP, the proposed transaction bundle will:\n\n1. Wrap the required `stETH` to `wstETH` so that it may be traded.\n2. Create a `Safe` owned by the DAO treasury that is used as a staging contract for the TWAP.\n3. Trigger the TWAP, with the resulting `rETH` from each swap being sent directly back to the DAO treasury.\n\n### Use of `Safe`\n\n* Developers: `Safe`\n* Audits: [See their Github Repository](https://github.com/safe-global/safe-contracts/tree/af488f0a649a3be2ea01e0f7a6af1587d0250c2d/docs).\n\nThe `Safe` is used as a staging area for the funds used in the TWAP. As CoW Protocol uses intent based trading, the `owner` of the order needs to sign their intent (done using a private key for an `EOA`, done using [EIP-1271](https://eips.ethereum.org/EIPS/eip-1271) for a smart contract). \n\nWith this requirement in mind, the DAO treasury contract for Nouns doesn't support EIP-1271. This is why a `Safe` is used in combination with `ComposableCoW` (detailed below).\n\nThe `Safe` that is created in the proposal bundle **ensures that the only owner is set to the DAO Treasury**. At all times, the funds remain under the direct control of the DAO treasury with the same timelock conditions.\n\n#### Execution Risk\n\nIn the transaction bundle funds are sent atomically to a newly created `Safe`. This means that the `Safe`'s address needs to be calculated beforehand. This is done using `CREATE2` logic, therefore the `Safe` is created at a deterministic address. The flow:\n\n1. DAO Treasury sets an approval on `wstETH` for the to-be-created `Safe`.\n2. The `Safe` is created and initialised.\n3. The funds are **PULLED** from the DAO Treasury to the `Safe`.\n\nCritically, with the above methodology there is *no ability for funds to be sent to an address where they are not retrievable*.\n\n**CAUTION:** This candidate proposal assumes successful passage of [Proposal #359](https://nouns.wtf/vote/359) **AND** no intermediate proposal that interacts with the new treasury's balance of `wstETH`.\n\n### Use of `ComposableCoW` / `TWAP`\n\n* Developer: mfw78 (funded by CowDAO Grants Program, and now a [Core Contributor to CoW Protocol](https://snapshot.org/#/cowgrants.eth/proposal/0x0202a88c6792d1bd1e534cf1da94769130f495e72247e666b4afff8b22da9db0)).\n* Audits (jointly funded by `Safe` and CoW Protocol): [Ackee](https://github.com/cowprotocol/composable-cow/blob/main/audits/ackee-blockchain-cow-protocol-composablecow-extensiblefallbackhandler-report-1.2.pdf), [Gnosis Internal](https://github.com/cowprotocol/composable-cow/blob/main/audits/gnosis-ComposableCoWMayJul2023.pdf).\n* Other: Repository recently on-boarded to [CoW Protocol GitHub organisation](https://github.com/cowprotocol/).\n\n`ComposableCoW` is a conditional smart order framework that was [incubated by the CoW Grants Program](https://snapshot.org/#/cowgrants.eth/proposal/0xb7815ca1f5aea2ec537295fd452332680eb1be379f3356950dc8ba151d83f9c5). `TWAP` is an order type implemented in the `ComposableCoW` framework. The contracts are thoroughly tested and audited. To date, volume processed exceeds ~$4.2M.\n\nUsing `ComposableCoW`, a smart contract (such as the `Safe` deployed in the proposal) is able to autonomously indicate its intent to trade. This intent is monitored by a *Watch Tower* (currently a Tenderly Web3 Action, deployed by the CoW Protocol team), with the intent relayed to the CoW Protocol API. In this framework - for TWAP, unlike `Milkman` - the smart contract specifies the *entire order structure to be submitted to the API*. There are no trust assumptions placed in the Watch Tower (besides the Watch Tower not running, leading to a griefing attack, but CoW Protocol for reputational reasons are incentivised to keep the Watch Tower operational).\n\n#### Differences compared to `Milkman`\n\nBoth were funded by the CoW Protocol Grants Program. `Milkman` seeks to solve the issue of an autonomous swap from ABC→XYZ tokens, whereas `ComposableCoW` provides an entire framework for producing *conditional* orders. TWAP is an example of a conditional order built with this framework - allowing a large trade to settle in multiple parts over time, minimising price impact.\n\n## Proposal Operations\n\nThe operations in the proposal are:\n\n1. Approve the required amount of `stETH` for wrapping into `wstETH`.\n2. Wrap `stETH` into `wstETH`.\n3. Approve the to-be-created Safe to use the Executor's `wstETH`.\n4. Create the trading `Safe` (owner: Exector, owners: 1).\n5. Configure the `Safe`:\n    i. Set `ComposableCoW` as the domain verifier for `GPv2Settlement` (CoW Protocol signing).\n    ii. Set the allowance for `GPv2VaultRelayer` to spend `wstETH` held by the `Safe`.\n    iii. Use `transferFrom` to pull funds from the `Executor` which what was already approved at (3).\n    iv. Create the `TWAP` order\n6. Confirm revocation of all allowances that were given to the `Safe` by the `Executor`.\n",
        "title": "(w)stETH to rETH Treasury Diversification 🐮",
        "id": "365"
      },
      {
        "createdTimestamp": "1694105963",
        "description": "# ⌐◨-◨ Season 3 Grants: Bring Back the Builders\n\n[![grants-szn-3-take-4.jpg](https://i.postimg.cc/xCx3K8jJ/grants-szn-3-take-4.jpg)](https://postimg.cc/JDXX81kM)\n\n---\n\n## **TLDR**\n\nLet's start Nouns Season 3 off right by bringing back the builders and the good vibes with available, reliable, discretionary funding for passionate Nounish builders.\n\n---\n\n## **THE PROBLEM**\n\nNouns historically has used small grants and Prop House rounds to complement onchain proposals. The Small Grants Committee (later known as NSFW) and Prop House rounds have fueled considerable community contributions, propelling the protocol's momentum. Yet, during the latter half of Nouns Season 2, obtaining small grants grew challenging. Additionally, the continuous management of Prop House Rounds demands consistent coordination.\n\nWe want to help patch this bug in the protocol, and bring back the Builder-forward Nounish Vibes that brought many of us here in the first place.\n\nWe are a trusted group of contributors in the ecosystem who are willing to collectively take on the challenge of running a dynamic and transparent Small Grants Allocation Pod, as well as coordinating and championing a series of exciting biweekly Prop House Rounds over the next six months of Nouns Season 3. \n\n[![s2-noggles.jpg](https://i.postimg.cc/W4SHH2bj/s2-noggles.jpg)](https://postimg.cc/SX2dXbMt)\n\n---\n\n## **THE PLAN**\n\n1. Coordinate with the Prop House team to set up two new \"Season 3 Grants\" Infinite Rounds, where anyone in the ecosystem can apply for retroactive funding up to a maximum of 5 ETH or proactive funding up to a maximum of 1 ETH. Our team will review grant applications on a rolling week-by-week basis, with a goal to allocate ~14 ETH per month.  \n2. Coordinate and champion a series of Biweekly Temporal Nouns Prop House Rounds, alternating between Open Grants Rounds and Themed Grants Rounds such as “Visual Arts”, “Keep Nouns Weird”, “Gaming/Esports”, “CC0 Music”, “Public Goods,” “Media and Content,” etc. We plan to explore various token-voting methods across all the Prop House rounds we run over the next 6 months, engaging the wider nounish community in some cases.\n3. Maintain a [Public-facing Discord](https://discord.gg/qmN4sfsXmh) for community members to ask questions and receive feedback on their applications while also using Prop House’s built-in comment functionality to provide ongoing transparent, public feedback on builder ideas. \n4. Publish a public monthly summary of funds deployed for full transparency and accountability.\n\n---\n\n## **THE PEOPLE**\n\nFor an important program like this, it is essential to have a team that is 1) Known and Trusted, 2) Knowledgeable and Experienced About the Ecosystem and 3) Reliable at Execution.\n\nThe proposing team has all been active and trusted contributors to Nouns for 1+ years minimum, have an intimate knowledge of the Nouniverse, and have all delivered on past projects.\n\n*Core Team Will Include:*\n* [Al409](https://twitter.com/al409eth)\n* [BradQ](https://twitter.com/iambradq)\n* [Benbodhi](https://twitter.com/benbodhi)\n* [ChrisCoCreated](https://twitter.com/ChrisCoCreated)\n* [Joshua Fisher](https://twitter.com/JoshuaFisher)\n* [Maty](https://twitter.com/matyETH/)\n* [Prof Werder](https://twitter.com/ProfWerder)\n* [Sasquatch](https://twitter.com/PartSasquatch)\n* [SuperTightWoody](https://twitter.com/SuperTightWoody/)\n* [Tha Swami](https://twitter.com/tha_swami) and his daughter [Lil Purple Blueberry](https://twitter.com/lilpurpberry)\n* [Toady Hawk](https://twitter.com/toady_hawk)\n\nTeam will only be compensated based on individual participation via Coordinape rounds every month allocated by participating team members. Funds will be managed in a 3/5 Multisig. \n\n**All decisions on funding will be made by committee vote with a reasonable quorum and never at any one team member’s sole discretion. Members of the team will not be eligible for funding from either the Infinite Rounds or the S3G Prop House Rounds.**\n\n---\n\n## **THE PRICE**\n\n- Monthly Open & Themed Prop House Rounds: 100 ETH\n- Season 3 Grants Infinite Rounds: 85 ETH\n- Admin/Expenses: 45 ETH \n    - (Admin Expense Ratio: <20%)\n\n---\n\n## **THE PAYOFF**\n\nIt has been quite some time since we have seen the Nouns ecosystem buzzing with the energy of artists and creatives, the insights of talented developers and the vibes of passionate proliferators. \n\nWe will put our reputations on the line and bring our skills and dedication to bear to allocate these DAO funds as effectively and transparently as possible to the most passionate and deserving builders, coders and creatives in the Nouniverse. \n\nRecent Prop House campaigns run by BASE and ThankApe have shown that there are still thousands of builders in the ecosystem, who are hungry for opportunities. \n\n**We don’t want Nouns to miss out on capturing that creative energy in Season 3, so LFG!**",
        "title": "⌐◨-◨ Season 3 Grants: Bring Back the Builders",
        "id": "364"
      },
      {
        "createdTimestamp": "1694096099",
        "description": "# Bring a million shredders onchain\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeie27ufroebf2hzy62q7jrtl32asdn2zaf3lwojrvamsdgcupd2loa)\n\n**[Gnars](https://gnars.wtf)** proposes a strategic migration from Ethereum mainnet to Zora Network in our pursuit to bring a million shredders onchain. Since launching [with 69 ETH](https://nouns.wtf/vote/51) over 16 months ago, we've evolved into a dynamic, Nounish DAO, empowering action sportspeople through communal funding, collective creation and shared proceeds.\n\nWe're primed to deploy the GNARS playbook (as depicted above) and integrate Nouns intimately into our subcultures, leveraging our Goodwill, Network, Advocacy, Releases, and Serendipity (hypercycle).\n\n📝 *Skateboarding is frequently our illustrative example. However, our commitment to genuine engagement spans all subcultures we're a part of.*\n\n---\n\n## 📌 TLDR\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeig367dwt7otkzo2soyip5tkhdggifnk3paz3timpll3jxtsuw7bae)\n\n**Requesting 200 ETH...**\n\n- Transition Gnars from Mainnet to Zora Network\n- Secure operational funds for our core contributors\n- Allocate a treasury for continuous park enhancements\n- Introduce intuitive onboarding with QR/NFC plaques\n- Enhance Nouns' outreach with subculture expertise\n\n...to bring a million shredders onchain!\n\n---\n\n## 🔍 DYOR\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeihpe47c44p3cwggtfeq7bgnjo4oj3glubrcvxgdv4vghtrqlihwdy)\n\n**Gnars at a glance...**\n\n- Browse both our [offchain](https://snapshot.org/#/gnars.eth) (90) and [onchain](https://www.gnars.wtf/dao) (9) proposals\n- Curate [That's Gnarly](https://thatsgnar.ly/) (337 creators) collectibles ($15.6k raised)\n- View our pioneering first ever DAO released [skate video part](https://zora.co/collect/eth:0x96c752ed99a77702bdf58e03f9dd9e654236e2f3/1)\n- [Tom's Tuts](https://www.instagram.com/tom_rohrer) on [YouTube](https://www.youtube.com/watch?v=Rtegw6Eml5c&t=36s), [Instagram](https://www.instagram.com/toms_tutorials/) and [TikTok](https://www.tiktok.com/@toms.tutorials) (10M+ views)\n- Enjoy films by Nounish like [this one](https://www.youtube.com/watch?v=HgeEwp4uizw), [this one](https://www.youtube.com/watch?v=JQSmfSnRGVk), or [this one](https://twitter.com/nounish/status/1683444320433590272) \n- Survey our [Prop House](https://prop.house/gnars) and winners like [this epic event](https://www.youtube.com/watch?v=q3unXaYpMl8)\n- Bid in our [ongoing auctions](https://www.gnars.wtf/) ahead of [The Gnarving](https://www.gnars.wtf/#gnarving)\n- [Toggle the switch](https://www.gnars.wtf/) to see each Gnar's HD version\n\n...to do your own research.\n\n---\n\n## 🛹 Background/Problem Statement\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeiam6uer545pvjsbzbtnw5uy77mr3t3wus7iazve42yv4h7ezvsjeu)\n\n📝 *Cult classic > Corporate cringe. Movements > Marketing.*\n\nSkateboarding and similar subcultures, despite their rise in popularity, grapple with commercial overreach and value retention. Some of the most pressing challenges include:\n\n1. **Commercial Exploitation**: Outside brands jumping into skateboarding often prioritise profit over authenticity.\n2. **Loss of Authenticity**: Many skaters, due to financial pressures, might promote brands they don't genuinely align with.\n3. **Skater Exploitation**: Many skaters, despite their talent, don't receive fair compensation, especially considering the sport's physical demands.\n4. **Mainstream Misrepresentation**: Media portrayals frequently miss the genuine essence of skateboarding, leaning into stereotypes.\n5. **Skatepark Commercialisation**: Once-communal skateparks are becoming increasingly commercialised.\n6. **Core Values vs. Growth**: Balancing foundational skateboarding values with growth opportunities remains a delicate act.\n\nThe skateboarding domain needs a thoughtful equilibrium. Brands that genuinely get and respect the skate culture have the potential to collaboratively benefit both parties without diluting the sport's spirit.\n\n---\n\n## 💡 Proposed Solution\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreiflj5bgctvmzjujul3kvehilbgrzcag7zhomomfdtrtbit4sptjym)\n\n📝 *Check out the [Meier Skatepark renovation](https://www.gnars.wtf/dao/proposals/3) proposal that's currently being delivered*\n\nEmpowering individuals to step into the blockchain world is central to our mission. Shredders, akin to artists, can undergo transformative experiences through this. Our overarching goal is to amplify our influence, simplify operational processes, and champion those with genuine grassroots credibility.\n\n**GNARS** as an acronym crystallizes our ethos, mirroring the Nouns' virtuous cycle, acting as our serendipity machine:\n\n- **Goodwill**: Renewing skateparks and introducing new, shred-worthy sculptures\n- **Network**: Culturally sensitive contributions earn us both visibility and respect\n- **Advocacy**: Harmonising with communities helps us draw in new enthusiasts\n- **Releases**: Collective creative outputs with shared proceeds bolster funding\n- **Serendipity**: Getting onchain empowers shredders, opening fresh avenues\n\n---\n\n## 🌟 Opportunity\n\n![](https://ipfs.decentralized-content.com/ipfs/bafkreihhjrjim3rtjd6k2drh6r5gpy5i7xfp22gjcuouujecd2p4arkxhq)\n\nOur target of onboarding a million shredders might seem lofty, but it's just a fraction - 0.2% - of the 490 million participants in extreme sports.\n\nTo provide some perspective, skateboarding alone boasts 85 million participants. Industries like adventure tourism further validate our optimistic projections, given their sustained growth trajectories.\n\n---\n\n## 🧭 Approach and Strategy\n\n[![](https://ipfs.decentralized-content.com/ipfs/bafybeifkzcdwnvktxhmf47i67iel4gqyqtqc6jkhqc2xfxxqnfnmjr5dja)](https://www.youtube.com/watch?v=q3unXaYpMl8)\n\n📝 *Watch this NounGnarversary celebration funded via Prop House [on YouTube ](https://www.youtube.com/watch?v=q3unXaYpMl8)*\n\nGnars takes pride in our unique, community-focused contributions to skate culture. Here's how we plan to maximize our impact:\n\n- **Local Council Engagement**: Propose collaborations with councils, emphasising mutual benefits. Secure permissions for QR/NFC plaques.\n- **Community Consultation**: Prioritise feedback, ensuring final outputs align with community needs and aspirations.\n- **Skateable Art**: Commission designs that are both visually appealing and skateable, enhancing park functionality.\n- **Skate Community Collaborations**: Organise events to spotlight our mission. Rope in local influencers as ambassadors.\n- **Educational Initiatives**: Engage with schools and clubs, emphasising the interplay of art, skateboarding, and community projects.\n- **Media Outreach**: Use local media to showcase project completions and events, underscoring our tech integrations.\n- **Feedback Mechanisms**: Use digital tools to gauge user engagement and gather feedback, refining future strategies.\n\nOur dual focus on the skateboarding community and local councils ensures that our initiatives resonate with authentic cultural value.\n\n---\n\n## 📊 Budget Breakdown\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeihebdyhnukubmcxl3tkhlqrn3dzwx5ace6uck2l2cd6ggb6tdq72i)\n\nPer the TLDR, our ask is 200 ETH to our treausury (DAO executor) at `gnars.eth`, outlined as:\n\n- **Continuous park enhancements - 150 ETH**\n    - Skate and other terrain park refurbishments globally\n    - Shred-worthy Nouns themed sculpture fabrications\n    - Installs of commemorative QR/NFC enabled plaques\n    - Unveiling and onboarding events fully documented\n    - Releases of all works onchain as paid or free mints\n    - All mint proceeds split with creators and treasury\n    - Being enabled by Nouns is core to Gnars' story\n- **Administration of GNARS strategy - 42 ETH**\n    - Coordinate community-driven promotional activities\n    - Manage various Gnars Media House curatorial efforts\n    - Oversee day to day operations and general administration\n    - Experiment with retro rewards (up to 2 ETH/month/contributor)\n    - Community discord moderation and shredder onboarding\n    - Collaborate with Rainbow wallet on QR / NFC activations\n    - Disburse free Gnars (10%) from multisig for shredders\n    - Provide assistance to our pods and working groups\n- **Migrate Gnars to Zora Network - 8 ETH**\n    - Add a timelock period/minimum quorum before new DAO opens up for props so nobody captures the first few props\n    - Deploy all contracts to Zora\n    - Edit frontend to integrate with Zora\n    - Migrate subgraph\n    - Implement gnars claiming process\n    - Plan for treasury migration\n    - Complete full migration\n\n📝 *Through onchain governance we will allocate funds as earmarked and will be experimenting with Partitions for a holistic approach to treasury management. If you've any questions about the finer details, please don't hesitate to [join our Discord](https://discord.gg/gnars) for a discussion. We are here to help!*\n\n---\n\n## 🤘 Shred the Nouns\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeiangc3tqtz5ayvdr27kojwhonmlw2qfm32ak3yvmcyqhxy5wttzom)\n\nIn the essence of our name and spirit, what we at Gnars do best is *Shred the Nouns.* Our passion extends beyond the conventional, morphing the iconic Nouns into tangible sculptures that echo our shared values and love for our sports, creating spaces where art meets action, and stories come alive beneath our wheels.\n\nAs we roll forward with our vision, we deeply value the collective strength and insights of the Nouns community. Your continued encouragement, feedback, and trust are what make such endeavors possible. By embracing our proposal, you're not just endorsing a project, but championing the blend of art, culture, and authenticity that both Nouns and Gnars represent.\n\n![](https://ipfs.decentralized-content.com/ipfs/bafybeif2wakdatsq7urcefu2r7oo57vpmuobfheqk5u45dky5eo2whw2va)\n\nIn gratitude for your time and consideration, and as a gesture of our appreciation, we've created a unique, commemorative NFT to mark the submission of this proposal. For the month of Shredtember, we invite you to [mint this FREE NFT](https://gna.rs/hypercycle) and all Zora Protocol Rewards will be split between Nouns and Gnars treasuries. A special thank you for being an intrinsic part of our journey.\n\nYour voice matters. As we conclude, we earnestly encourage each member of the Nouns community to cast their vote with comment. Together, let's continue to reshape, reimagine, and literally Shred the Nouns.\n\nThank you for considering a future where passion, play, and purpose collide!\n\nBe sure to [scroll our Twitter](https://twitter.com/gnars_dao) for all the latest happenings.\n\nSHRΞD M❍RE\n\n⌐◨🤘◨",
        "title": "Bring a million shredders onchain",
        "id": "363"
      },
      {
        "createdTimestamp": "1693242131",
        "description": "# Place Dustin Yellin's Nouns Sculpture at Zero Bond (NYC)\n\nThe DAO recently acquired a Dustin Yellin sculpture (See Proposals 48 and 350). Part of the agreement was for Dustin Yellin Studio to help us show the piece in prominent locations.  This proposal is to fund the transportation and installation for the first location. Dustin Yellin Studio is requesting 9ETH to cover the expense of crating, transporting, and installing the 3,000 lb sculpture in the foyer of the main dining room of the Manhattan social club, Zero Bond, and back to the artist's Brooklyn studio at the conclusion of the loan period. The expected loan period will be 1-3 years, during which time Dustin Yellin Studio will work on additional loan placements for the work at museums and relevant cultural institutions worldwide.\n\nRelatedly, earlier this month Yellin partnered with OpenSea and Friends With Benefits on an open edition set of NFT's to commemorate the completion of his Nouns sculpture. 15% of the total proceeds from the primary sale - 4.027ETH - have been donated by the artist to the Nouns DAO Treasury: https://etherscan.io/tx/0x40d94b6d84024b4b903b53f3f04238b979645eb8d837eef358820ac9f318eb5b\n\n9 ETH Deposit to Dustin Yellin Studio:\n0x0B789Ef2A2cda2fb5B5c7cdB278C2Cb8BdC96e4C",
        "title": "Place Dustin Yellin's Nouns Sculpture at Zero Bond (NYC)",
        "id": "362"
      },
      {
        "createdTimestamp": "1693159631",
        "description": "# Withdraw from the TokenBuyer/Payer contracts\n\nThe treasury assets are currently held by the TokenBuyer/Payer contracts are not included in the forking calculation and in the upcoming Proposal 360 there is a ∼105 ETH refill for the TokenBuyer/Payer which might cause some disagreement just before a possible fork so I propose to withdraw from the 2 contracts.\n\nThe contracts will refill with the first USDC proposal after this one so it wont cause any issues.",
        "title": "Withdraw from the TokenBuyer/Payer contracts",
        "id": "361"
      },
      {
        "createdTimestamp": "1693112063",
        "description": "# Prop House IRL Experience 💡\n\n![](https://i.imgur.com/coC4yHP.gif)\n\n[Prop House](https://prop.house) is an excellent entry point for builders in the Nouns ecosystem. The Nouns in Rio team is requesting **9 ETH + 9,500 USDC** to create an engaging Prop House Experience in a hub brimming with innovators.\n‎ \n## How 👀\n\nWe plan to create a round in the upcoming Nouns in Rio House and open exclusively* to all [Blockchain Rio](https://blockchainfestival.io/) attendees, a place full of builders aspiring to build for the Web3 ecosystem and push the boundaries of innovation.\n\nA pool of 7 ETH will be designated to back 20 projects, each set to receive 0.35 ETH. Proposals must aim to enhance Prop House in some way, whether through community integration, explainer videos, code development, and more. After the event, Nouners will have a one-week voting window to determine which projects get funded.\n\n**During the event, we'll ask builders interested in submitting a proposal to fill out a form. This ensures that all proposals come from verified event participants.*\n‎ \n![](https://i.imgur.com/8kR9fgd.png)  \n‎ \n## Why 🤔\n\nWe want individuals to recognize Prop House as a platform where they can get funding to bring their ideas to life. By showcasing the diverse groups already benefiting from the platform, we aim to inspire them to consider how they can engage their own communities in similar ways.\n\nThe true value of this experience lies not only in funding individual projects but also in connecting talented builders to the Nouns DAO community. By cultivating this relationship, we create a pathway for ongoing collaboration and innovation, encouraging them to continue contributing to and growing with the community.\n\nCheck out all the amazing things that have come from Prop House. **Nouns has funded one of the best Web3 platforms, and it's high time we spread the word about it.**\n\n![](https://i.imgur.com/AZR3Lfp.png)\n‎ \n## Where 📍\n\nWe discovered Prop House at an event and from that moment we knew we wanted to create an IRL experience for it. Now, we have the perfect chance. We'll be at the largest Web3 & Business event in Latin America, [Blockchain Rio](https://blockchainfestival.io/), from September 12th to 14th, alongside big names like Polkadot, CoinEx, Polygon, Ledger, and more. It's the ideal place to find passionate builders and introduce them to Prop House.\n\nTake a look at the first edition of the event from 2022, which attracted more than 22,000 visitors, featured 432 speakers, and generated 86 million reais in economic impact for the state of Rio de Janeiro.\n\n![](http://i.imgur.com/CODwQjS.gif)\n\n![](https://i.imgur.com/l3gsmny.png)\n\n*Brazilian builders on stage talking about Nouns and Prop House. [Watch here!](https://twitter.com/blockchain_rio/status/1630946236105736195)* \n‎ \n## Lounge 🛋️\n\nOur lounge will include two interactive totems that enable attendees to explore Prop House and toggle between different houses and rounds. Additionally, two large TVs will display a video produced by us, highlighting projects funded by various communities through Prop House. The lounge backdrop will offer step-by-step instructions, complete with a QR code, for submitting proposals.\n\nAll of this will support the team in explaining what Prop House is and how it works. We'll also **give a talk** at the event and invite people to join the experience and submit their projects.\n\n![](https://i.imgur.com/Ut98dfj.png)\n\n*The layout of the lounge and the art on the backdrop are for illustrative purposes and may not represent the final design.*\n\n![](https://i.imgur.com/UNfxWZG.png)\n‎ \n## Team 🤝\n\n[Nouns in Rio](https://twitter.com/NounsInRio) team, represented by [JP](https://twitter.com/home) and [Debinvest](https://twitter.com/debinvest), is behind the project. They will be on-site at the lounge to explain Prop House, discuss the round, and assist with wallet creations and proposal submissions.\n\n![](https://i.imgur.com/9mp1CbE.png)\n\nNouns in Rio team has successfully organized various nounish IRL events, including [Nouns Week](https://nounsweek.wtf/rio-de-janeiro/), the [Treasure Hunt](https://twitter.com/NounsInRio/status/1574418495911219201), [social actions](https://twitter.com/NounsInRio/status/1606765831064588288) for Prop House's Nounish Holidays and many others.\n\n![](https://i.imgur.com/WDTRnam.png)\n\n![](http://i.imgur.com/uFXRkNX.gif)\n\n*Nouns Week*\n‎ \n## Budget 💰\n\nWith 7 ETH, we can fund a diverse range of projects with a meaningful ETH value. JP and Debinvest will each receive 1 ETH for managing the project and staffing the lounge during the event. The cost for setting up and operating the event space, which includes event fees and production expenses, will be 9,500 USDC. In case fewer than 20 proposals are submitted, **all remaining ETH will be returned to the DAO.**\n\n![](https://i.imgur.com/HqGnVgI.png)\n‎ \n## Success ✨\n\nAfter the event concludes, we'll provide the DAO with both an aftermovie and a detailed report. This report will feature key metrics like site visits during the event (provided by the Prop House team if possible), submitted proposals, QR code scans, and minted POAPs. We'll also extend an invitation to all funded project leads to join the [Nouns in Rio Discord server](https://discord.gg/yBFRt2D894) for ongoing project follow-up, ensuring sustained engagement and support.\n\nTo amplify our impact, we'll actively engage the community through our Portuguese Nounish channels like [@nounsinrio](instagram.com/nounsinrio), [@nounsbr](instagram.com/nounsbr) and [@thenounsquarebr](https://www.tiktok.com/@thenounsquarebr). The engagement metrics from these channels will be included in our final report.\n\nWe recognize this is a pivotal time for the DAO, but due to the time-sensitive nature of our project, we felt the need to proceed. Thank you for reading and considering this proposal. Let's take Prop House to the streets! 💡\n\n![](https://i.imgur.com/dAMtste.gif)",
        "title": "Prop House IRL Experience 💡",
        "id": "360"
      },
      {
        "createdTimestamp": "1693055351",
        "description": "# Nouns DAO V3 Upgrade follow up proposal\n\nThis is a follow up proposal to proposal #356.\n\nThis is the second part of a treasury contract migration as described in the previous proposal.\n\n\n## Transactions\n\n1. Move leftover ETH from treasury v1 to treasury v2\n2. Approve treasury v2 to transfer lil nouns from treasury v1\n3. Transfer ownership of TokenBuyer to treasury v2\n4. Transfer ownership of Payer to treasury v2\n5. Approve unlimited stETH to be transferred by the ERC20Transferer contract\n6. Invoke ERC20Transferer to send remaining stETH to the new treasury\n7. Transfer all wstETH to treasury v2\n8. Transfer all rETH to treasury v2\n9. Transfer all USDC to treasury v2\n",
        "title": "Nouns DAO V3 Upgrade follow up proposal",
        "id": "359"
      },
      {
        "createdTimestamp": "1692900167",
        "description": "# Join NOUNS At Your Own Risk; a note on v3 for prospective members\n\nv3 of Nouns (prop 356) implements a standing bid at the protocol level to buy back a block of Nouns ≥ the 'forking threshold' (20% of circulating supply at time of execution) with an equivalent % of the treasury's fungible assets. \n\nWhile this may offer you opportunities to exchange your token for some Eth (and other DAO assets), it also enables, under certain conditions, other Noun holders to bypass the proposal process and partially or fully drain treasury assets, resulting in possible total loss of funds.\n\nThe Foundation veto and/or exiting (by signaling an interest to join a block sale) will not be able to prevent this in all cases. Please review and understand these risks prior to joining the DAO.",
        "title": "Join NOUNS At Your Own Risk; a note on v3 for prospective members",
        "id": "358"
      },
      {
        "createdTimestamp": "1692179279",
        "description": "# Nouns DAO V3 migration cleanup\n\nI propose the second part of the migration as in my understanding everybody just waiting for this upgrade process to fully finish, therefore until it's finally finished the DAO can't function at 100% as the focus is highly diverted on this upgrade process.\nI included all the transactions originally planned, then top of that I added the withdrawal from the Payer contract after there was some argument for it from DAO members.\nThis proposal is submitted less than 2 days after the first upgrade proposal (Prop 356) which means that by the time/if the first one gets executed we will also know if this proposal failed or passed, so basically if this fails the DAO can just resubmit without any delay of the planned process, but if this passes we just saved ourself from another 10 days of headache.\n\nThis proposal contains 10 transactions:\n\n1.Move leftover ETH from treasury v1 to treasury v2\n2.Approve treasury v2 to transfer lil nouns from treasury v1\n3.Transfer ownership of TokenBuyer to treasury v2\n4.Transfer ownership of Payer to treasury v2\n5.Approve unlimited stETH to be transferred by the ERC20Transferer contract\n6.Invoke ERC20Transferer to send remaining stETH to the new treasury\n7.Transfer all wstETH to treasury v2\n8.Transfer all rETH to treasury v2\n9.Transfer all USDC to treasury v2\n10.Withdraw from Payer to treasury v2",
        "title": "Nouns DAO V3 migration cleanup",
        "id": "357"
      },
      {
        "createdTimestamp": "1692008639",
        "description": "# Nouns DAO V3 upgrade, including Nouns Fork (Will Not Cancel)\nThis is more than an exact replica of Prop #354, which passed with near-unanimous approval only to be unexpectedly canceled by its owner before execution. This prop is a statement of resilience, a pledge that will not be broken or **canceled**.\n\nFinalized with meticulous care between January and February, V3's design stands unchanged. The community, blindsided by the spontaneous cancellation despite comprehensive legal opinions and exhaustive audits, remains united and vigilant. Claims of a \"crypto-economic issue\" find no echo among the community, auditors, Cayman Foundation's law firm, or the CT community at large. Yet, we should all stand ready for open discourse within the five days before this prop goes live. **This prop will not be canceled.** The community alone will decide, again.\n\nThis proposal symbolizes something profound. It is the very test of whether Nouns is controlled by the collective strength and wisdom of the community/token holders or controlled by a select few known as the Nounders/multisig holders. This is a moment that challenges us to prove our shared principles and uphold true decentralization while leading the ecosystm forward into a new more resilient future.\n\n\n------------------------- Below should be identical to the last prop. Please Verify -------------------------\n\n# Edit: changing stETH transfer (tx #6) to a lower amount in case proposal 352 passes\n\n## Summary\nThis proposal upgrades the Nouns DAO logic contract to V3. This version introduces the following changes:\n\nProposal editing: adding a new initial state to the proposal lifecycle: “Updatable”, during which proposers can update their proposal's transactions and text description.\nThis feature will be disabled at first and will require a separate proposal to configure the period of the Updatable state.\nPropose by signatures: allowing Nouners and delegates to pool their voting power towards submitting a proposal, by submitting their signature, instead of the current approach where sponsors must delegate their votes to help a proposer achieve threshold.\nThis feature will be activated once this proposal executes.\nObjection-only period: a conditional voting period that gets activated upon a “last-minute” proposal swing from defeated to successful, affording voters more reaction time. Only against votes are possible during the objection period.\nThis feature will be disabled at first and will require a separate proposal to enable it and configure its parameters.\nVotes snapshot after voting delay: moving votes snapshot up, to provide Nouners with reaction time per proposal, to get their votes ready (e.g. some might want to move their delegations around). Currently the vote snapshot block is the proposal creation block.\nNouns Fork: allowing Nouners to exit the DAO by forking to a new DAO. Current threshold is set at 20%. For more details please read the tech spec and this post.\nAn updated version of nouns.wtf will be deployed to add support for these features.\n\nAudit\nThe DAO funded two audits for this version, first with Spearbit and then with code4rena.\nBelow is a summary of the results with links to the reports.\n\nPlease reach out to us (verbs team) if you have any questions regarding the findings.\n\nSpearbit found:\n\n0 critical risk severity issues\n2 high risk severity issues\n18 medium risk severity issues\n22 low risk severity issues\nFor more info: the full Spearbit audit report.\n\ncode4rena found:\n\n1 high risk finding\n3 medium risk findings\n8 low risk findings\nFor more info: the full code4rena audit report.\n\nWon’t Fix Issues\nThere were some issues we chose to not fix despite agreeing they were good findings, because we wanted to avoid adding further risk or time delays. We’re listing those here explicitly for the sake of max transparency. There were other issues we did not fix because we disagreed with the auditors’ analysis, and those are not listed here.\n\nSetting a new fork escrow contract might lead to lost tokens\nProposals can move from Expired state back to Queued when timelock’s Grace Period changes\nChanges in detail\nProposal editing\nProposals get voter feedback almost entirely only once they are onchain. At the same time, proposers are reluctant to cancel and resubmit their proposals for multiple reasons, e.g. prefering to avoid restarting the proposal lifecycle and thus delay funding.\n\nThere have been cases where proposers made promises offchain, e.g. to return part of the funds, but that is not captured onchain, and not visible to the entire voter base.\n\nThis feature introduces a new state into the proposal lifecycle:\n\nUpdatable (new) → Pending → Active …\nDuring the Updatable state, a proposer can update their proposal’s description and/or transactions. Following the Updatable state, there’s a Pending state during which updates are no longer available before voting starts during the Active state.\n\nThe length of the Updatable state is configurable by the DAO, and starts at zero. This effectively keeps the feature disabled. A separate proposal will follow with proposed periods for the state, for example: Updatable: 5 days, Pending: 1 day\n\nThere’s also an onchain method of providing feedback to proposals while they are in the Updatable state.\n\nPropose by signatures\nProposal threshold is the number of votes an account must control in order to submit a proposal. As of this writing an account must have at least 2 votes to pass the threshold.\n\nCurrent methods of sponsoring a proposal and their problems:\n\nNouners today either delegate their Nouns to proposers or submit the proposal on their behalf.\nDelegating is limited to Nouners, since delegates can re-delegate their vote to another account.\nWhen a Nouner delegates, they can’t use their voting power for the length of the proposal lifecycle which is very inconvenient.\n\nIf a Nouner/delegate chooses to submit a proposal on behalf of the proposer, we lose the meaning of who is the actual proposer and also the process itself can be cumbersome where the delegate needs to make sure the proposal looks good and pay gas for it.\n\nThis upgrade introduces a new function to the DAO contract: proposeBySigs.\nThis allows anyone to submit a proposal and a set of signatures. The signatures are provided by voters and need to match the proposal content. If the sum of votes from all the signers surpasses proposal threshold, the proposal can be submitted.\n\nThe goal is to open another channel through which proposers can submit proposals, without necessarily finding a sponsor through private channels.\n\nVoters can only be signers if they don’t currently have an active proposal, either as a proposer or signer. Signers of a proposal can cancel it at any time, and the same is true for proposers; proposers should choose their signers carefully.\n\nThis allows both Nouners and delegates to “sign-off” on a proposal, while the proposer address remains the actual proposer and without the need to change delegations.\nIt also allows pooling voting power, e.g. two delegates with 1 vote each can sign a proposal in order for it to pass the proposal threshold, currently at 2 votes.\nIt also opens the door to raising the proposal threshold since it’s easier to collect voting power.\n\nAs part of this update we are adding support for “proposal candidates” to nouns.wtf, where proposers can submit their proposals and request signatures. In order to prevent spam, creating a candidate proposal requires either holding 1 vote or sending 0.1 ETH (the ETH recipient and the amount are configurable by the DAO).\nThe candidate proposals data are submitted to a side contract to make this data publicly available for any frontend to interact with.\n\nObjection-only period\nThe goal is to protect the DAO from executing proposals that the majority would not want to execute. The threat is one where a minority trying to pass a proposal can let the proposal look like it's failing, to cultivate voter apathy, then cast many of their For votes just before voting ends, swinging the proposal from defeated to successful, leaving the majority wishing they were more vigilant.\n\nThis upgrade introduces a new state in the proposal lifecycle: ObjectionPeriod.\n\n… Active (regular voting period) → ObjectionPeriod (conditional) → Succeeded / Defeated \\\nObjectionPeriod gets turned on only if a proposal turns from not passing to passing close enough to the end of the voting period.\n\nDuring the ObjectionPeriod state, only voters who haven’t voted yet are allowed to vote, but only against the proposal.\n\nQ: Why not allow voting For a proposal during this extra voting period?\nA: Similar to the attack scenario described above, it would still allow voters to keep their votes to themselves and vote only at the last minute. In this case it would be right before the ObjectionPeriod ends.\n\nMore broadly speaking, the risk that a proposal passes when it shouldn’t, is much higher than the risk of a proposal not passing when it should.\nA proposal can be re-proposed, but a proposal that passes can’t be reversed.\n\nDAO configurable parameters:\n\nobjectionPeriodDurationInBlocks: how long the objection period lasts, e.g. 2 days\nlastMinuteWindowInBlocks: what is considered “last minute”? e.g. 2 hours\nBoth parameters start with values of zero, effectively making this feature disabled. A separate proposal will follow turning on this feature with suggested parameters.\n\nVotes Snapshot After Voting Delay\nThe current DAO implementation takes a snapshot of votes & delegation at the block a proposal is created, meaning Nouners have no lead time to put their votes in order, e.g. moving their delegations back to themselves to vote on something they really care about.\n\nThis upgrade changes the snapshot to be after the voting delay, i.e. once voting starts. Nouners will now have the duration of voting delay to transfer, buy, sell, delegate and undelegate their votes.\n\nBecause the nouns supply grows during the voting delay, nouns that are minted during the voting delay also participate in voting. Originally the snapshot was taken during proposal creation in order to align the total supply and the quorum and proposal calculations, which are performed at proposal creation time. Now that the supply has grown, this inconsistency is insignificant.\n\nNouns Fork\nFurther details can be found here in the tech spec and this post.\n\nNew treasury\nThe DAO fork feature requires switching to a new treasury contract which allows the DAO to transfer ETH and ERC20 tokens when a fork executes. The current treasury (treasury v1) contract is not upgradable, so it requires a migration to a new one. The new treasury (treasury v2), deployed at 0xb1a32FC9F9D8b2cf86C068Cae13108809547ef71, adds the new functions to the existing contract, and is upgradable to avoid the need for migrations in the future.\n\nThe migration includes:\n\nTransferring ETH, stETH, wstETH, rETH & USDC\nChanging ownership of the auction house, auction house proxy admin, nouns token & nouns descriptor contracts\nChange ownership of TokenBuyer and Payer to allow treasury v2 to perform ETH/USDC swaps\nApprove the treasury v2 to transfer lil nouns from treasury v1\nOther assets in treasury v1 can be moved or approved to be moved in follow up proposals. Only assets in treasury v2 are included in the treasury forking in case of a fork.\n\nDAO proposals are limited to 10 transactions, therefore we are doing the migration in two steps. There will be a follow up proposal with the second part of the migration. The follow up proposal will go onchain once this one executes.\n\nThe DAO will still have access to the original treasury (treasury v1), by proposing proposals via the proposeOnTimelockV1 function.\n\nExisting streams created by the DAO will remain controlled by treasury v1. If the DAO chooses to cancel them, the proposeOnTimelockV1 function will need to be used.\n\nImportant heads up\nProposals that are queued but not yet executed before this proposal executes will need to be executed using the executeOnTimelockV1 function. The regular execute function will attempt to execute via treasury v2 and will fail.\n\nProposal #1 Transactions (this proposal):\nSend 2,500 ETH to new treasury contract\nThe rest of the ETH will be transferred in a followup proposal. We can’t tell in advance how much ETH the treasury will have at the moment this proposal executes so we are sending a first chunk now.\nUpgrade the DAO contract logic to V3\nSet the fork params:\na. forkEscrow: the escrow contract\nb. forkDeployer: the contract which deploys new forked DAOs\nc. erc20TokensToIncludeInFork: addresses of erc20 tokens which will be included in the treasury fork, specifically: stETH, wstETH, rETH and USDC\nd. forkPeriod: the period during which token holders can join a fork after it has been executed, 7 days\ne. forkThresholdBPS: the % of nouns required to surpass in order to activate a fork, 2,000 bps = 20%\nSet the proposal id at which the vote snapshot will be changed to be after voting delay\na. Sets it to the next proposal after the current one\nTransfer ownership of the auction house proxy contract\nSend stETH to the new treasury, leaving 5,000 stETH for proposals that may be queued\nChange ownership of the Nouns token contract\nChange ownership of the Nouns descriptor contract\nTransfer ownership of the auction house proxy admin\nSet treasury V2 as the new treasury of the DAO contract, and set treasury v1 to be available to reference for proposeOnTimelockV1\nProposal #2 Transactions:\nThis proposal will be submitted only after the first one executes, since only then we will know the final amount of ETH in treasury V1 to transfer as part of this proposal.\n\nMove leftover ETH from treasury v1 to treasury v2\nApprove treasury v2 to transfer lil nouns from treasury v1\nTransfer ownership of TokenBuyer to treasury v2\nTransfer ownership of Payer to treasury v2\nApprove unlimited stETH to be transferred by the ERC20Transferer contract\nInvoke ERC20Transferer to send remaining stETH to the new treasury\nTransfer all wstETH to treasury v2\nTransfer all rETH to treasury v2\nTransfer all USDC to treasury v2\nCan be viewed in more detail here.\n\nProposal #3 Transactions:\nSet ENS reverse lookup on treasury V2 to resolve to nouns.eth\nProposal execution notes\nProposals #1 and #2 will be executed on treasury v1, while proposal #3 is executed on treasury v2.\nPrior to executing proposal #3, the accounts that control nouns.eth will set nouns.eth to point to treasury v2.",
        "title": "Nouns DAO V3 upgrade, including Nouns Fork (Will Not Cancel)",
        "id": "356"
      },
      {
        "createdTimestamp": "1691481947",
        "description": "# Nounify Ethereum Singapore with Public Goods\n\n![](https://hackmd.io/_uploads/S1KD48393.gif)\n\n## **tl;dr;**\n\n- Ethereum Singapore 2023 happens from 10-12 September and features a “Hack for Good” with real challenge statement from local nonprofits\n- Partnering with Nouns to educate 40 nonprofit organizations about web3's potential\n- Guide to organising similar activations will be released as a open-source playbook\n- Ethereum Singapore is an official event supported by mutiple Singapore governmental bodies and sponsored by Ethereum foundation including speakers such as **Vitalik Buterin** and **Aya Miyaguchi**\n- The proposed budget: **27,600 USDC** to support \"Hack for Good\" prize pool & partnership with Ethereum Singapore\n\n![](https://hackmd.io/_uploads/ByBA6sEi2.png)\n\n# **Introduction to Ethereum Singapore**\n\n[Ethereum Singapore Meetup](https://www.meetup.com/ethereum-singapore/), established in 2016 with over 9,000 members aim to unite and energize the local community in Singapore with [ETH Singapore 2023 | Infinite Garden City](https://mirror.xyz/ethereumsingapore.eth/MyMITRe0nHv1iqjx3jNxZtaq4M5d37wstODRkUCw-9k). The event bring together developers, creators, and newcomers to nurture future talent within the Ethereum space.\n\n![](https://i.imgur.com/dvPOIxG.png)\n\nThe event will be held at the prestigious [National Gallery of Singapore](https://www.youtube.com/watch?v=TA_l7kphVdA), encompassing a hackathon focused on real-world challenges from local non-profit organizations and social enterprises.The conference will also feature community hubs inspired by Devcon VI's format, offering high-quality programming and prominent speakers such as Vitalik, Aya Miyaguchi, Ed Felten from Arbitrum, Alex Guchowski from zksync, and more!\n\n![](https://hackmd.io/_uploads/SJQdXETqh.png)\n\n![](https://hackmd.io/_uploads/SkV68L2q2.png)\n\n# **Ethereum Singapore is Nounish**\n\n\n# **Fund Breakdown:**\n**1. Retroactively supporting 4 workshops with the National Volunteer and Philantrophy Centre of Singapore and providing a Nounish presence at the Ethereum Singapore conference - 15,000 USDC**\n\nThe [National Volunteer and Philantrophy Centre](https://cityofgood.sg/) work with 2,000 charities and non-profits in Singapore and have come on board as a partner for the hackathon. 4 workshops have been run together with them engaging 40 non-profits as we educate them on Web3. The workshops were:\n1. Crash course on Web3 for non-profit organisations\n2. Using Web3 for NPOs - when, where, how?\n3. Hands-on workshop - setting up an ENS, demo on QF with clrfund\n4. Road to Ethereum SG: Defining Challenge Statements\n\nThe final workshop led to challenge statements being generated for Ethereum Singapore. Furthermore, this process will be thoroughly documented and disseminated as an **open-source playbook**, serving as a public good empowering other communities globally where they are able to freely utilize the hackathon format as a guide.\n\nAt Ethereum Singapore, we are breaking from the norm of using booths to showcase Nouns. Instead, the **entire venue** will be transformed into an **immersive playground for Nouns**, allowing event guests to fully engage with the world of Nouns throughout their visit. This fresh approach offers abundant photo opportunities and generates brand awareness as well as online attention as guests share their experiences on social media. We will feature Nouns as much as possible during the event including speaking and physical activations.\n\nWhat to expect:\n- 3D Nouns models all around the venue (ref. [Nouns fair](https://twitter.com/avee_eth/status/1683361931678064643?s=20))\n- Hackathon format released as a **open-source playbook**\n- Nouns discussion panel \n- Nouns logo (Noggle) placement on ETH Singapore Website\n- ETH Singapore social media recognition pre/post event\n- ETH Singapore post-event video produced by Angelhack\n- Event Staff/Volunteers wearing Noggle\n- Event ticket allocation\n\n![](https://hackmd.io/_uploads/SywCIVHsn.png)\n*3D Nouns all around the venue*\n\n**2. Hackathon Bounty - 5,000 USDC**\n- This bounty will be added to the hackathon prize pool for incentivizing more proliferation and public goods building. Bounty format will be similar to what was used by Nouns at previous EthGlobal hackathons.\n\n**3. Purchase of wearable Noggle - 1,600 USDC (including shipping & tax)**\n\nTo be worn by staff/volunteer/guest:\n- Classic (plastic) Noggles: 5 boxes of 10pcs/box at USD250/box\n- Lo-fi Paper Noggle (qty: 1000pcs): (Allocation from Prop #334)\n\n**4. Nounish activation - 6,000 USDC (including logistics)**\n  \nTo boost engagement and knowledge retention, we'll gamify the swag distribution process with a Nouns Questionnaire. Participants & Hackers will be challenged to find answers via NounsDAO webpage or socials. This interactive game aims to leave a impression and help participants remember what they learned about Nouns while winning themselves some Nounish swag. Proliferating with a purpose. Additionally, it helps drive traffic towards Nouns, increasing its prominence.\n\nA Mega Gachapon Machine (Nounified) will serve as the activation point.\nIt serves multiple purpose:\n\n- Brand awareness – Earning Nounish swag; Noggel everywhere. \n- Learning –  Questionnair game that foster curiously towards Nouns. Team will also be answering questions about all things Nounish.\n\nBreakdown for this section:\n- **Nouns X ETH Singapore Tshirt (Qty: 350)**: $4,200\n- **Nouns enamel pins (Qty: 150)**: $525\n- **Stickers (Qty: 1000)**: $200\n- **Mega Gachapon Machine Rental (Qty: 2 days)**: $425\n- **Logistics**: $650\n\n![](https://hackmd.io/_uploads/rk9_JEBsh.png)\n\n**5. Run with Nouns Running Club**\n\nThe [Nouns Running Club](https://twitter.com/nounsrc) supports this proposal as it fosters a positive sum game by encouraging collaboration and growth. We are thrilled to share that the club has already initiated the planning of an official run alongside Ethereum Singapore. With the successful passing of this proposition, we believe that it will make a substantial contribution to the widespread adoption & visibility to Nouns Running Club powered by Nouns.  \n![](https://hackmd.io/_uploads/Sy79V8Rqh.png)\n\n# **Total = 27,600 USDC** to be sent to [ethereumsingapore.eth](https://etherscan.io/address/ethereumsingapore.eth)\n\n# **Motivation for Nouns to be at Ethereum Singapore**\n## 1. In true Nounish spirit, it is focused on public goods & non-profits\nThe spirit of bringing Web3 to enable real impact **deeply resonates with Nouns ethos**, where the very first proposal ever passed on NounsDAO was to [\"Donate 5 ETH each to 6 charities\"](https://nouns.wtf/vote/1) and also produced [public good structure like prop house to empower builders](https://nouns.center/funding). \n\nSimilarly at Ethereum Singapore we shared the same vision featuring a hackathon for good where the challenge statements will be [collaboratively developed](https://twitter.com/ethereum_sg/status/1676447827353018369?s=20) with local *charities and non-profit organizations* that have an interest in web3 technologies. Our collaborating partner [National Volunteer and Philantrophy Centre](https://cityofgood.sg/) which stewards the vision of making Singapore a City of Good will be working with thousands of local charities and non-profits engaging up to **50+ organisations at the leadership level** to educate them about blockchain technology bringing Web3 to them.   \n\n![](https://hackmd.io/_uploads/HJ7euU2c2.png)\n\n## 2. Southeast Asia presence + Devcon2024 will be in this region!\nThe team also aims to leverage this opportunity to effectively introduce Nouns to the local communities with the assistance of [@nounsinsg](https://twitter.com/nounsinsg), fostering greater awareness and comprehension of Nouns while leaving a memorable impact on Singapore, the blockchain hub of Southeast Asia.\nLooking ahead, all eyes will be on Southeast Asia as [Devcon is set to come the region](https://twitter.com/EFDevcon/status/1630543172974657538?cxt=HHwWhIC-gY-Y7aAtAAAA). Ethereum Singapore has [committed to dedicate its excess funds](https://mirror.xyz/ethereumsingapore.eth/MyMITRe0nHv1iqjx3jNxZtaq4M5d37wstODRkUCw-9k) to support local developers, events, education initiatves, and meaningful public goods for the region and hopes to set a new cultural norm for Ethereum events.\n\n## 3. A Nounish gathering point for our community\nEthereum Singapore is [held during F1 week](https://www.panewslab.com/zh_hk/token2049sideevents/index.html) which numerous events such as Token2049, Filecoin Summit, Froyoverse, NFT Asia, Milken Institute Asia Summit, and many more are held. Amidst the hectic non-stop event schedule, Nouns holders can feel at home at Ethereum Singapore with like-minded friends and our adopted web3 family members. The wider public interested in web3 can also learn about what we're all about and perhaps their first web3 interaction would be with a Nounish artifact!\n\n# **Executing Personnel:**\n[QZ:](https://twitter.com/not_qz) Main organiser and [meetup lead](https://www.meetup.com/ethereum-singapore/) for Ethereum Singapore. He works on building ecosystems by creating collaborative spaces across Web3 entities, governments, non-profits, and education institutions to help realise the potential of Web3 for positive outcomes. He worked at GitcoinDAO and helped set up the grassroots team and is now doing operations at clrfund too.\n\n\n[Pico:](https://www.pico.com/en/work?all_case=1) Pico has an extensive background in planning and executing major events such as [iLight Singapore](https://www.pico.com/en/work/i-light-singapore  ) and the [Youth Olympics Games](https://www.pico.com/en/work/first-ever-youth-olympic-games-in-singapore). Their [wide-ranging](https://www.pico.com/en/work?all_case=1) experience in event activations demonstrates a proven ability to manage large-scale projects thus ensuring EthereumSsingapore's success.\n\n\n[Angelhack:](https://www.angelhack.com/) One of the world's largest developer ecosystems, Angelhack is known for producing developer activations with a global reach. Angelhack's involvement brings a wealth of practical experience and broad access to a global developer community.\n\n\nSupported by [Karl](https://twitter.com/WideEyeKarl): Serving as an active supporter, Karl is the driving force behind [@Nounsinsg](https://twitter.com/nounsinsg) and [@NounsCN](https://twitter.com/nounscn). His commitment and contribution to the Nouns DAO community enhances the team's credibility and extends their influence, ensuring the project has the robust backing it needs to succeed.\n\n",
        "title": "Nounify Ethereum Singapore with Public Goods",
        "id": "355"
      },
      {
        "createdTimestamp": "1690982639",
        "description": "# Nouns DAO V3 upgrade, including Nouns Fork (edit)\n\n\nEdit: changing stETH transfer (tx #6) to a lower amount in case proposal 352 passes\n\n## Summary\n\nThis proposal upgrades the Nouns DAO logic contract to V3. This version introduces the following changes:\n\n\n1. Proposal editing: adding a new initial state to the proposal lifecycle: “Updatable”, during which proposers can update their proposal's transactions and text description. \n    * This feature will be disabled at first and will require a separate proposal to configure the period of the Updatable state.\n2. Propose by signatures: allowing Nouners and delegates to pool their voting power towards submitting a proposal, by submitting their signature, instead of the current approach where sponsors must delegate their votes to help a proposer achieve threshold.\n    * This feature will be activated once this proposal executes.\n3. Objection-only period: a conditional voting period that gets activated upon a “last-minute” proposal swing from defeated to successful, affording voters more reaction time. Only against votes are possible during the objection period.\n    * This feature will be disabled at first and will require a separate proposal to enable it and configure its parameters.\n4. Votes snapshot after voting delay: moving votes snapshot up, to provide Nouners with reaction time per proposal, to get their votes ready (e.g. some might want to move their delegations around). Currently the vote snapshot block is the proposal creation block.\n5. Nouns Fork: allowing Nouners to exit the DAO by forking to a new DAO. Current threshold is set at 20%. For more details please read [the tech spec](https://github.com/verbsteam/nouns-fork-spec/blob/main/spec.md) and [this post](https://mirror.xyz/0x10072dfc23771101dC042fD0014f263316a6E400/iN0FKOn_oYVBzlJkwPwK2mhzaeL8K2-W80u82F7fHj8).\n\nAn updated version of nouns.wtf will be deployed to add support for these features.\n\n\n## Audit\n\nThe DAO funded two audits for this version, first with Spearbit and then with code4rena.\nBelow is a summary of the results with links to the reports.\n\nPlease reach out to us (verbs team) if you have any questions regarding the findings.\n\nSpearbit found:\n* 0 critical risk severity issues\n* 2 high risk severity issues\n* 18 medium risk severity issues\n* 22 low risk severity issues\n\nFor more info: [the full Spearbit audit report](https://github.com/nounsDAO/nouns-monorepo/blob/d417586ae46f8d32801a3028c2c3496b119fc032/packages/nouns-contracts/audits/dao%20v3%20-%20spearbit%20audit%20report.pdf).\n\ncode4rena found:\n* 1 high risk finding\n* 3 medium risk findings\n* 8 low risk findings\n\nFor more info: [the full code4rena audit report](https://code4rena.com/reports/2023-07-nounsdao). \n\n\n### Won’t Fix Issues\n\nThere were some issues we chose to not fix despite agreeing they were good findings, because we wanted to avoid adding further risk or time delays. We’re listing those here explicitly for the sake of max transparency. There were other issues we did not fix because we disagreed with the auditors’ analysis, and those are not listed here.\n\n\n\n* [Setting a new fork escrow contract might lead to lost tokens](https://github.com/nounsDAO/nouns-monorepo/issues/765)\n* [Proposals can move from Expired state back to Queued when timelock’s Grace Period changes](https://github.com/nounsDAO/nouns-monorepo/issues/764)\n\n\n## Changes in detail\n\n\n### Proposal editing\n\nProposals get voter feedback almost entirely only once they are onchain. At the same time, proposers are reluctant to cancel and resubmit their proposals for multiple reasons, e.g. prefering to avoid restarting the proposal lifecycle and thus delay funding.\n\nThere have been cases where proposers made promises offchain, e.g. to return part of the funds, but that is not captured onchain, and not visible to the entire voter base.\n\nThis feature introduces a new state into the proposal lifecycle:\n\n```\nUpdatable (new) → Pending → Active …\n```\n\nDuring the Updatable state, a proposer can update their proposal’s description and/or transactions. Following the Updatable state, there’s a Pending state during which updates are no longer available before voting starts during the Active state.\n\nThe length of the Updatable state is configurable by the DAO, and starts at zero. This effectively keeps the feature disabled. A separate proposal will follow with proposed periods for the state, for example: Updatable: 5 days, Pending: 1 day\n\nThere’s also an onchain method of providing feedback to proposals while they are in the Updatable state.\n\n\n### Propose by signatures\n\n_Proposal threshold_ is the number of votes an account must control in order to submit a proposal. As of this writing an account must have at least 2 votes to pass the threshold.\n\nCurrent methods of sponsoring a proposal and their problems:\n\nNouners today either delegate their Nouns to proposers or submit the proposal on their behalf.\nDelegating is limited to Nouners, since delegates can re-delegate their vote to another account.\nWhen a Nouner delegates, they can’t use their voting power for the length of the proposal lifecycle which is very inconvenient.\n\nIf a Nouner/delegate chooses to submit a proposal on behalf of the proposer, we lose the meaning of who is the actual proposer and also the process itself can be cumbersome where the delegate needs to make sure the proposal looks good and pay gas for it.\n\nThis upgrade introduces a new function to the DAO contract: `proposeBySigs`.\nThis allows anyone to submit a proposal and a set of signatures. The signatures are provided by voters and need to match the proposal content. If the sum of votes from all the signers surpasses proposal threshold, the proposal can be submitted.\n\nThe goal is to open another channel through which proposers can submit proposals, without necessarily finding a sponsor through private channels.\n\nVoters can only be signers if they don’t currently have an active proposal, either as a proposer or signer. Signers of a proposal can cancel it at any time, and the same is true for proposers; proposers should choose their signers carefully.\n\nThis allows both Nouners and delegates to “sign-off” on a proposal, while the proposer address remains the actual proposer and without the need to change delegations.\nIt also allows pooling voting power, e.g. two delegates with 1 vote each can sign a proposal in order for it to pass the proposal threshold, currently at 2 votes.\nIt also opens the door to raising the proposal threshold since it’s easier to collect voting power.\n\nAs part of this update we are adding support for “proposal candidates” to nouns.wtf, where proposers can submit their proposals and request signatures. In order to prevent spam, creating a candidate proposal requires either holding 1 vote or sending 0.1 ETH (the ETH recipient and the amount are configurable by the DAO).\nThe candidate proposals data are submitted to a side contract to make this data publicly available for any frontend to interact with.\n\n\n### Objection-only period\n\nThe goal is to protect the DAO from executing proposals that the majority would not want to execute. The threat is one where a minority trying to pass a proposal can let the proposal look like it's failing, to cultivate voter apathy, then cast many of their For votes just before voting ends, swinging the proposal from defeated to successful, leaving the majority wishing they were more vigilant.\n\nThis upgrade introduces a new state in the proposal lifecycle: `ObjectionPeriod`.\n\n``` \\\n… Active (regular voting period) → ObjectionPeriod (conditional) → Succeeded / Defeated \\\n```\n\nObjectionPeriod gets turned on only if a proposal turns from not passing to passing close enough to the end of the voting period.\n\nDuring the `ObjectionPeriod` state, only voters who haven’t voted yet are allowed to vote, but only _against_ the proposal.\n\nQ: Why not allow voting For a proposal during this extra voting period?\nA: Similar to the attack scenario described above, it would still allow voters to keep their votes to themselves and vote only at the last minute. In this case it would be right before the ObjectionPeriod ends.\n\nMore broadly speaking, the risk that a proposal passes when it shouldn’t, is much higher than the risk of a proposal not passing when it should.\nA proposal can be re-proposed, but a proposal that passes can’t be reversed.\n\nDAO configurable parameters:\n1. `objectionPeriodDurationInBlocks`: how long the objection period lasts, e.g. 2 days\n2. `lastMinuteWindowInBlocks`: what is considered “last minute”? e.g. 2 hours\n\nBoth parameters start with values of zero, effectively making this feature disabled. A separate proposal will follow turning on this feature with suggested parameters.\n\n\n### Votes Snapshot After Voting Delay\n\nThe current DAO implementation takes a snapshot of votes & delegation at the block a proposal is created, meaning Nouners have no lead time to put their votes in order, e.g. moving their delegations back to themselves to vote on something they really care about.\n\nThis upgrade changes the snapshot to be after the voting delay, i.e. once voting starts. Nouners will now have the duration of voting delay to transfer, buy, sell, delegate and undelegate their votes.\n\nBecause the nouns supply grows during the voting delay, nouns that are minted during the voting delay also participate in voting. Originally the snapshot was taken during proposal creation in order to align the total supply and the quorum and proposal calculations, which are performed at proposal creation time. Now that the supply has grown, this inconsistency is insignificant.\n\n\n### Nouns Fork\n\nFurther details can be found here in [the tech spec](https://github.com/verbsteam/nouns-fork-spec/blob/main/spec.md) and [this post](https://mirror.xyz/0x10072dfc23771101dC042fD0014f263316a6E400/iN0FKOn_oYVBzlJkwPwK2mhzaeL8K2-W80u82F7fHj8).\n\n\n### New treasury\n\nThe DAO fork feature requires switching to a new treasury contract which allows the DAO to transfer ETH and ERC20 tokens when a fork executes. The current treasury (treasury v1) contract is not upgradable, so it requires a migration to a new one. The new treasury (treasury v2), deployed at [0xb1a32FC9F9D8b2cf86C068Cae13108809547ef71](https://etherscan.io/address/0xb1a32FC9F9D8b2cf86C068Cae13108809547ef71), adds the new functions to the existing contract, and is upgradable to avoid the need for migrations in the future.\n\nThe migration includes:\n\n1. Transferring ETH, stETH, wstETH, rETH & USDC\n2. Changing ownership of the auction house, auction house proxy admin, nouns token & nouns descriptor contracts\n3. Change ownership of TokenBuyer and Payer to allow treasury v2 to perform ETH/USDC swaps\n4. Approve the treasury v2 to transfer lil nouns from treasury v1\n\nOther assets in treasury v1 can be moved or approved to be moved in follow up proposals. Only assets in treasury v2 are included in the treasury forking in case of a fork.\n\nDAO proposals are limited to 10 transactions, therefore we are doing the migration in two steps. There will be a follow up proposal with the second part of the migration. The follow up proposal will go onchain once this one executes.\n\nThe DAO will still have access to the original treasury (treasury v1), by proposing proposals via the `proposeOnTimelockV1` function.\n\nExisting streams created by the DAO will remain controlled by treasury v1. If the DAO chooses to cancel them, the `proposeOnTimelockV1` function will need to be used.\n\n\n## Important heads up\n\n**Proposals that are queued but not yet executed before this proposal executes will need to be executed using the `executeOnTimelockV1` function. The regular `execute` function will attempt to execute via treasury v2 and will fail.**\n\n\n## Proposal #1 Transactions (this proposal):\n1. Send 2,500 ETH to new treasury contract \\\nThe rest of the ETH will be transferred in a followup proposal. We can’t tell in advance how much ETH the treasury will have at the moment this proposal executes so we are sending a first chunk now.\n2. Upgrade the DAO contract logic to V3\n3. Set the fork params:\n    a. forkEscrow: the escrow contract\n    b. forkDeployer: the contract which deploys new forked DAOs\n    c. erc20TokensToIncludeInFork: addresses of erc20 tokens which will be included in the treasury fork, specifically: stETH, wstETH, rETH and USDC\n    d. forkPeriod: the period during which token holders can join a fork after it has been executed, 7 days\n    e. forkThresholdBPS: the % of nouns required to surpass in order to activate a fork, 2,000 bps = 20%\n4. Set the proposal id at which the vote snapshot will be changed to be after voting delay\n    a. Sets it to the next proposal after the current one\n5. Transfer ownership of the auction house proxy contract\n6. Send stETH to the new treasury, leaving 5,000 stETH for proposals that may be queued\n7. Change ownership of the Nouns token contract\n8. Change ownership of the Nouns descriptor contract\n9. Transfer ownership of the auction house proxy admin\n10. Set treasury V2 as the new treasury of the DAO contract, and set treasury v1 to be available to reference for `proposeOnTimelockV1`\n\n\n## Proposal #2 Transactions:\n\n**This proposal will be submitted only after the first one executes, since only then we will know the final amount of ETH in treasury V1 to transfer as part of this proposal.**\n\n1. Move leftover ETH from treasury v1 to treasury v2\n2. Approve treasury v2 to transfer lil nouns from treasury v1\n3. Transfer ownership of TokenBuyer to treasury v2\n4. Transfer ownership of Payer to treasury v2\n5. Approve unlimited stETH to be transferred by the ERC20Transferer contract\n6. Invoke ERC20Transferer to send remaining stETH to the new treasury\n7. Transfer all wstETH to treasury v2\n8. Transfer all rETH to treasury v2\n9. Transfer all USDC to treasury v2\n\nCan be viewed in more detail [here](https://github.com/nounsDAO/nouns-monorepo/blob/9cbc7dde418d5ba7a1b50d0b0348dd14b6191404/packages/nouns-contracts/script/ProposeTimelockMigrationCleanupMainnet.s.sol).\n\n\n## Proposal #3 Transactions:\n\n1. Set ENS reverse lookup on treasury V2 to resolve to nouns.eth\n\n\n## Proposal execution notes\n\n* Proposals #1 and #2 will be executed on treasury v1, while proposal #3 is executed on treasury v2.\n* Prior to executing proposal #3, the accounts that control nouns.eth will set nouns.eth to point to treasury v2.\n",
        "title": "Nouns DAO V3 upgrade, including Nouns Fork (edit)",
        "id": "354"
      },
      {
        "createdTimestamp": "1690966355",
        "description": "# Nouns DAO V3 upgrade, including Nouns Fork\n\n\n## Summary\n\nThis proposal upgrades the Nouns DAO logic contract to V3. This version introduces the following changes:\n\n\n1. Proposal editing: adding a new initial state to the proposal lifecycle: “Updatable”, during which proposers can update their proposal's transactions and text description. \n    * This feature will be disabled at first and will require a separate proposal to configure the period of the Updatable state.\n2. Propose by signatures: allowing Nouners and delegates to pool their voting power towards submitting a proposal, by submitting their signature, instead of the current approach where sponsors must delegate their votes to help a proposer achieve threshold.\n    * This feature will be activated once this proposal executes.\n3. Objection-only period: a conditional voting period that gets activated upon a “last-minute” proposal swing from defeated to successful, affording voters more reaction time. Only against votes are possible during the objection period.\n    * This feature will be disabled at first and will require a separate proposal to enable it and configure its parameters.\n4. Votes snapshot after voting delay: moving votes snapshot up, to provide Nouners with reaction time per proposal, to get their votes ready (e.g. some might want to move their delegations around). Currently the vote snapshot block is the proposal creation block.\n5. Nouns Fork: allowing Nouners to exit the DAO by forking to a new DAO. Current threshold is set at 20%. For more details please read [the tech spec](https://github.com/verbsteam/nouns-fork-spec/blob/main/spec.md) and [this post](https://mirror.xyz/0x10072dfc23771101dC042fD0014f263316a6E400/iN0FKOn_oYVBzlJkwPwK2mhzaeL8K2-W80u82F7fHj8).\n\nAn updated version of nouns.wtf will be deployed to add support for these features.\n\n\n## Audit\n\nThe DAO funded two audits for this version, first with Spearbit and then with code4rena.\nBelow is a summary of the results with links to the reports.\n\nPlease reach out to us (verbs team) if you have any questions regarding the findings.\n\nSpearbit found:\n* 0 critical risk severity issues\n* 2 high risk severity issues\n* 18 medium risk severity issues\n* 22 low risk severity issues\n\nFor more info: [the full Spearbit audit report](https://github.com/nounsDAO/nouns-monorepo/blob/d417586ae46f8d32801a3028c2c3496b119fc032/packages/nouns-contracts/audits/dao%20v3%20-%20spearbit%20audit%20report.pdf).\n\ncode4rena found:\n* 1 high risk finding\n* 3 medium risk findings\n* 8 low risk findings\n\nFor more info: [the full code4rena audit report](https://code4rena.com/reports/2023-07-nounsdao). \n\n\n### Won’t Fix Issues\n\nThere were some issues we chose to not fix despite agreeing they were good findings, because we wanted to avoid adding further risk or time delays. We’re listing those here explicitly for the sake of max transparency. There were other issues we did not fix because we disagreed with the auditors’ analysis, and those are not listed here.\n\n\n\n* [Setting a new fork escrow contract might lead to lost tokens](https://github.com/nounsDAO/nouns-monorepo/issues/765)\n* [Proposals can move from Expired state back to Queued when timelock’s Grace Period changes](https://github.com/nounsDAO/nouns-monorepo/issues/764)\n\n\n## Changes in detail\n\n\n### Proposal editing\n\nProposals get voter feedback almost entirely only once they are onchain. At the same time, proposers are reluctant to cancel and resubmit their proposals for multiple reasons, e.g. prefering to avoid restarting the proposal lifecycle and thus delay funding.\n\nThere have been cases where proposers made promises offchain, e.g. to return part of the funds, but that is not captured onchain, and not visible to the entire voter base.\n\nThis feature introduces a new state into the proposal lifecycle:\n\n```\nUpdatable (new) → Pending → Active …\n```\n\nDuring the Updatable state, a proposer can update their proposal’s description and/or transactions. Following the Updatable state, there’s a Pending state during which updates are no longer available before voting starts during the Active state.\n\nThe length of the Updatable state is configurable by the DAO, and starts at zero. This effectively keeps the feature disabled. A separate proposal will follow with proposed periods for the state, for example: Updatable: 5 days, Pending: 1 day\n\nThere’s also an onchain method of providing feedback to proposals while they are in the Updatable state.\n\n\n### Propose by signatures\n\n_Proposal threshold_ is the number of votes an account must control in order to submit a proposal. As of this writing an account must have at least 2 votes to pass the threshold.\n\nCurrent methods of sponsoring a proposal and their problems:\n\nNouners today either delegate their Nouns to proposers or submit the proposal on their behalf.\nDelegating is limited to Nouners, since delegates can re-delegate their vote to another account.\nWhen a Nouner delegates, they can’t use their voting power for the length of the proposal lifecycle which is very inconvenient.\n\nIf a Nouner/delegate chooses to submit a proposal on behalf of the proposer, we lose the meaning of who is the actual proposer and also the process itself can be cumbersome where the delegate needs to make sure the proposal looks good and pay gas for it.\n\nThis upgrade introduces a new function to the DAO contract: `proposeBySigs`.\nThis allows anyone to submit a proposal and a set of signatures. The signatures are provided by voters and need to match the proposal content. If the sum of votes from all the signers surpasses proposal threshold, the proposal can be submitted.\n\nThe goal is to open another channel through which proposers can submit proposals, without necessarily finding a sponsor through private channels.\n\nVoters can only be signers if they don’t currently have an active proposal, either as a proposer or signer. Signers of a proposal can cancel it at any time, and the same is true for proposers; proposers should choose their signers carefully.\n\nThis allows both Nouners and delegates to “sign-off” on a proposal, while the proposer address remains the actual proposer and without the need to change delegations.\nIt also allows pooling voting power, e.g. two delegates with 1 vote each can sign a proposal in order for it to pass the proposal threshold, currently at 2 votes.\nIt also opens the door to raising the proposal threshold since it’s easier to collect voting power.\n\nAs part of this update we are adding support for “proposal candidates” to nouns.wtf, where proposers can submit their proposals and request signatures. In order to prevent spam, creating a candidate proposal requires either holding 1 vote or sending 0.1 ETH (the ETH recipient and the amount are configurable by the DAO).\nThe candidate proposals data are submitted to a side contract to make this data publicly available for any frontend to interact with.\n\n\n### Objection-only period\n\nThe goal is to protect the DAO from executing proposals that the majority would not want to execute. The threat is one where a minority trying to pass a proposal can let the proposal look like it's failing, to cultivate voter apathy, then cast many of their For votes just before voting ends, swinging the proposal from defeated to successful, leaving the majority wishing they were more vigilant.\n\nThis upgrade introduces a new state in the proposal lifecycle: `ObjectionPeriod`.\n\n``` \\\n… Active (regular voting period) → ObjectionPeriod (conditional) → Succeeded / Defeated \\\n```\n\nObjectionPeriod gets turned on only if a proposal turns from not passing to passing close enough to the end of the voting period.\n\nDuring the `ObjectionPeriod` state, only voters who haven’t voted yet are allowed to vote, but only _against_ the proposal.\n\nQ: Why not allow voting For a proposal during this extra voting period?\nA: Similar to the attack scenario described above, it would still allow voters to keep their votes to themselves and vote only at the last minute. In this case it would be right before the ObjectionPeriod ends.\n\nMore broadly speaking, the risk that a proposal passes when it shouldn’t, is much higher than the risk of a proposal not passing when it should.\nA proposal can be re-proposed, but a proposal that passes can’t be reversed.\n\nDAO configurable parameters:\n1. `objectionPeriodDurationInBlocks`: how long the objection period lasts, e.g. 2 days\n2. `lastMinuteWindowInBlocks`: what is considered “last minute”? e.g. 2 hours\n\nBoth parameters start with values of zero, effectively making this feature disabled. A separate proposal will follow turning on this feature with suggested parameters.\n\n\n### Votes Snapshot After Voting Delay\n\nThe current DAO implementation takes a snapshot of votes & delegation at the block a proposal is created, meaning Nouners have no lead time to put their votes in order, e.g. moving their delegations back to themselves to vote on something they really care about.\n\nThis upgrade changes the snapshot to be after the voting delay, i.e. once voting starts. Nouners will now have the duration of voting delay to transfer, buy, sell, delegate and undelegate their votes.\n\nBecause the nouns supply grows during the voting delay, nouns that are minted during the voting delay also participate in voting. Originally the snapshot was taken during proposal creation in order to align the total supply and the quorum and proposal calculations, which are performed at proposal creation time. Now that the supply has grown, this inconsistency is insignificant.\n\n\n### Nouns Fork\n\nFurther details can be found here in [the tech spec](https://github.com/verbsteam/nouns-fork-spec/blob/main/spec.md) and [this post](https://mirror.xyz/0x10072dfc23771101dC042fD0014f263316a6E400/iN0FKOn_oYVBzlJkwPwK2mhzaeL8K2-W80u82F7fHj8).\n\n\n### New treasury\n\nThe DAO fork feature requires switching to a new treasury contract which allows the DAO to transfer ETH and ERC20 tokens when a fork executes. The current treasury (treasury v1) contract is not upgradable, so it requires a migration to a new one. The new treasury (treasury v2), deployed at [0xb1a32FC9F9D8b2cf86C068Cae13108809547ef71](https://etherscan.io/address/0xb1a32FC9F9D8b2cf86C068Cae13108809547ef71), adds the new functions to the existing contract, and is upgradable to avoid the need for migrations in the future.\n\nThe migration includes:\n\n1. Transferring ETH, stETH, wstETH, rETH & USDC\n2. Changing ownership of the auction house, auction house proxy admin, nouns token & nouns descriptor contracts\n3. Change ownership of TokenBuyer and Payer to allow treasury v2 to perform ETH/USDC swaps\n4. Approve the treasury v2 to transfer lil nouns from treasury v1\n\nOther assets in treasury v1 can be moved or approved to be moved in follow up proposals. Only assets in treasury v2 are included in the treasury forking in case of a fork.\n\nDAO proposals are limited to 10 transactions, therefore we are doing the migration in two steps. There will be a follow up proposal with the second part of the migration. The follow up proposal will go onchain once this one executes.\n\nThe DAO will still have access to the original treasury (treasury v1), by proposing proposals via the `proposeOnTimelockV1` function.\n\nExisting streams created by the DAO will remain controlled by treasury v1. If the DAO chooses to cancel them, the `proposeOnTimelockV1` function will need to be used.\n\n\n## Important heads up\n\n**Proposals that are queued but not yet executed before this proposal executes will need to be executed using the `executeOnTimelockV1` function. The regular `execute` function will attempt to execute via treasury v2 and will fail.**\n\n\n## Proposal #1 Transactions (this proposal):\n1. Send 2,500 ETH to new treasury contract \\\nThe rest of the ETH will be transferred in a followup proposal. We can’t tell in advance how much ETH the treasury will have at the moment this proposal executes so we are sending a first chunk now.\n2. Upgrade the DAO contract logic to V3\n3. Set the fork params:\n    a. forkEscrow: the escrow contract\n    b. forkDeployer: the contract which deploys new forked DAOs\n    c. erc20TokensToIncludeInFork: addresses of erc20 tokens which will be included in the treasury fork, specifically: stETH, wstETH, rETH and USDC\n    d. forkPeriod: the period during which token holders can join a fork after it has been executed, 7 days\n    e. forkThresholdBPS: the % of nouns required to surpass in order to activate a fork, 2,000 bps = 20%\n4. Set the proposal id at which the vote snapshot will be changed to be after voting delay\n    a. Sets it to the next proposal after the current one\n5. Transfer ownership of the auction house proxy contract\n6. Send stETH to the new treasury, leaving 1,000 stETH for proposals that may be queued\n7. Change ownership of the Nouns token contract\n8. Change ownership of the Nouns descriptor contract\n9. Transfer ownership of the auction house proxy admin\n10. Set treasury V2 as the new treasury of the DAO contract, and set treasury v1 to be available to reference for `proposeOnTimelockV1`\n\n\n## Proposal #2 Transactions:\n\n**This proposal will be submitted only after the first one executes, since only then we will know the final amount of ETH in treasury V1 to transfer as part of this proposal.**\n\n1. Move leftover ETH from treasury v1 to treasury v2\n2. Approve treasury v2 to transfer lil nouns from treasury v1\n3. Transfer ownership of TokenBuyer to treasury v2\n4. Transfer ownership of Payer to treasury v2\n5. Approve unlimited stETH to be transferred by the ERC20Transferer contract\n6. Invoke ERC20Transferer to send remaining stETH to the new treasury\n7. Transfer all wstETH to treasury v2\n8. Transfer all rETH to treasury v2\n9. Transfer all USDC to treasury v2\n\nCan be viewed in more detail [here](https://github.com/nounsDAO/nouns-monorepo/blob/9cbc7dde418d5ba7a1b50d0b0348dd14b6191404/packages/nouns-contracts/script/ProposeTimelockMigrationCleanupMainnet.s.sol).\n\n\n## Proposal #3 Transactions:\n\n1. Set ENS reverse lookup on treasury V2 to resolve to nouns.eth\n\n\n## Proposal execution notes\n\n* Proposals #1 and #2 will be executed on treasury v1, while proposal #3 is executed on treasury v2.\n* Prior to executing proposal #3, the accounts that control nouns.eth will set nouns.eth to point to treasury v2.\n",
        "title": "Nouns DAO V3 upgrade, including Nouns Fork",
        "id": "353"
      },
      {
        "createdTimestamp": "1690883639",
        "description": "# Buy an Alien CryptoPunk using stETH\n\n## Summary\n\nSince most of the treasury has been converted to stETH, the previews proposal to acquire an Alien punk had to be cancelled.\nHere I, tycoon.eth, prepared a smart contract that will help the Nouns DAO to acquire an Alien punk token using stETH.\n\n## Methodology\n\nThe contract has been deployed to [0x0260Ba2dAe8b85b5A1Bd492829738BDCC7956F35](https://etherscan.io/address/0x0260ba2dae8b85b5a1bd492829738bdcc7956f35#code)\n\nThe contract would receive stETH from the treasury and hold it for up to 69 days. In the meantime, any Alien CryptoPunk owner could sell their punk to the contract, in exchange for the balance of the contract’s stETH. The Alien owner would need to use the “Offer to Address” feature for selling the punk to the contract. After settlement, the punk token will be sent to the Nouns DAO treasury address. If the deal is not closed within 69 days, the entire stETH balance will be sent back to the Nouns DAO treasury.\n\nA walkthrough of the code has been posted here [https://0xtycoon.medium.com/nounsalien-solidity-contract-walkthrough-9233a4b9ee4e](https://0xtycoon.medium.com/nounsalien-solidity-contract-walkthrough-9233a4b9ee4e)\n\nThe contract has been simulated on block 17781581 using this simulation test posted to Github [https://github.com/0xTycoon/alien-flip/blob/master/test/simulate.js](https://github.com/0xTycoon/alien-flip/blob/master/test/simulate.js)",
        "title": "Buy an Alien CryptoPunk using stETH",
        "id": "352"
      },
      {
        "createdTimestamp": "1690871699",
        "description": "# Compensation for Anniversary Art Inclusion (Prop 348)\n\n\nThis proposal aims to compensate Amiyoko, Facu, Goldy, Index, Krel, Solimander, and Tummlin with a total of 88 eth for the collective efforts that went into [Prop 348](https://nouns.wtf/vote/348); inclusion of new traits on the Nouns DAO anniversary.\n\n![](https://hackmd.io/_uploads/B1koufSi2.png)\n\nNouns is truly an infinite work of art. It's a living, dynamic thing that can be upgraded, improved, altered -- or defaced -- via proposal. It is yet another wondrous piece of lore that make up the ever growing nounish cultural landmark.\n\nAdding to the Nouns collection on the Nouniversary is a [tradition](https://nouns.wtf/vote/147) that we cherish deeply. One that we believe is worth protecting and nourishing until it can stand on its own non existent feet. Only time will tell how this tradition evolves, but we believe in a future where adding art to the Nouns contract is a worldwide event and cause for widespread celebration and recognition.\n\nBy compensating our efforts to keep this tradition alive, we hope that it can encourage more people to participate in growing, caring, and tending to the Nouns collection.\n\n----\n\nThere is a non-obvious amount of work and knowledge required to develop new traits for the Nouns collection. The design space of a 32x32 pixel grid is surprisingly large, and its only a narrow band -- a goldilocks zone -- that fits the style and feel of the original collection.\n\n\n![](https://hackmd.io/_uploads/rymk9MHsn.png)\n\nWe request 88 eth for the work done over the course of 8 weeks. Funds will be split among Amiyoko, Facu, Goldy, Index, Krel, Solimander, and Tummlin equal to their individual participation and degree of effort in making prop 348 a reality.\n\n*In the event of prop 348 failing, this proposal will be cancelled.*\n\n⌐◨-◨\n\n",
        "title": "Compensation for Anniversary Art Inclusion (Prop 348)",
        "id": "351"
      },
      {
        "createdTimestamp": "1690721591",
        "description": "# Pay Dustin Yellin 50 eth to complete purchase of PERSON, PLACE, or THING\n\nThis proposal is a continuation of proposals 327 and 328.  328 was not properly executed and all of the NAC eth was transferred back to the nouns treasury.  As such, i am proposing that we approve a final 50 eth payment to complete the purchase of this sculpture.  As detailed below, we will then submit a new proposal for the first placement of the sculpture at Zero Bond in New York City.\n\nPrevious proposal text:\n\nIn April 2022 the Nouns DAO voted on and executed Proposal 48 - Nouns Psychogeography Sculpture with Dustin Yellin, wherein the Brooklyn-based artist was commissioned to update the Leviathan image by creating PERSON, PLACE, or THING, a new sculptural portrait layering each Nouns avatar into one fantastic body. For the commission, Yellin hand painted the 402 Nouns minted in Year One, integrating them into a unique glass artwork to forge a record of the history of the Nouns DAO, while branding its newest emblem.\n\nMuch like a yearbook, a ship’s manifest, or the signatures under a document, this snapshot provides a freeze frame of the DAO’s founders and builders. This in-all-is-one super-avatar represents the shared vision and trust between all stakeholders, while providing a rallying banner - an art object - that crystalizes how individuals are more powerful when they come together, and how a community can achieve the seemingly impossible by focusing its collective resources and talents around a common task.\n\nUpon acceptance of Proposal 48, the Nouns DAO compensated the artist with an initial deposit of 50ETH and made a donation of 100,000 USDC to the non-profit cultural center, Pioneer Works.\n\nA second payment of 50ETH and 1 Noun NFT (Noun 252 from the Nouns treasury) was agreed to be paid upon completion of the PERSON, PLACE, or THING sculpture and its accompanying NFT.\n\nLink to images of the finished sculpture: https://www.dustinyellin.com/d/6afb72\nLink to the NFT: Psychoprogeny - https://opensea.io/assets/ethereum/0x3dde7d56735d5ab659544070679e9350d23d5b0b/2\n\nUpon acceptance of this proposal, the NFT for PERSON, PLACE, or THING will be transferred from DustinYellinDeployer to a Nouns DAO wallet.\n\nDustin Yellin Studio will then submit a new proposal to Nouns DAO requesting 12ETH to cover the expense of crating, transporting, and installing the 3,000 lb sculpture in the foyer of the main dining room of the Manhattan social club, Zero Bond, and back to the artist's studio at the conclusion of the loan period. The expected loan period will be 1-3 years, during which time Dustin Yellin Studio will work on additional loan placements for the work at museums and relevant cultural institutions worldwide.\n\nThe artist will provide an informative label to accompany the sculpture at Zero Bond, including details about the work and its ownership by Nouns DAO.\n\n50 ETH Deposit and transfer of Noun 252 to Dustin Yellin Studio:\n0x0B789Ef2A2cda2fb5B5c7cdB278C2Cb8BdC96e4C",
        "title": "Pay Dustin Yellin 50 eth to complete purchase of PERSON, PLACE, or THING",
        "id": "350"
      },
      {
        "createdTimestamp": "1690487519",
        "description": "# Support Creative Commons\n\n![Nouns x Creative Commons](https://i.imgur.com/NK23nSz.png) \n\n# Proposal \n\nCreative Commons respectfully requests 100 ETH to support the organization’s general operations and license infrastructure.  \n\n# Overview\n\nYou’ve likely heard of Creative Commons Zero or CC0.\n\nCC0 has taken the NFT world, especially the community-owned brand Nouns, by storm. If you’re new to CC0, it’s a \"no copyright reserved\" option in which all copyright is relinquished and dedicated to the public domain. This enables use of CC0 NFTs with zero legal repercussions, inspiring creative derivatives and remixes of original works. \n\nCC0 may be everywhere, but here’s a lesser-known fact: Creative Commons is also a whole nonprofit organization (see our most recent annual report [here](https://creativecommons.org/2023/04/11/state-of-the-commons-2022/)). \n\nWe’ve been around since 2001 and are a small but mighty team of 22 open access enthusiasts. We not only manage the CC licenses and public domain tools, we run campaigns, programming, and training in Open Education, Culture, Climate, and Journalism; host a CC Global Summit in locations around the world; and tackle major policy issues impacting the Internet and global commons as part of a broad Movement for a Better Internet. \n\nWe’re doing a lot, but it is all in service of the CC licenses, a thriving commons, and a healthy public domain, which can be expanded instantly by contemporary creators embracing the use of CC0, a globally interoperable public domain dedication tool. Like Nouns, we’re big promoters of remix culture, and have been watching (_largely from the sidelines until now!_) as NFT creators bring new energy and enthusiasm to the public domain.  \n\nWe’re excited to bring our two communities together to demonstrate the staying power of open access tools like CC0 even in a technological landscape that’s rapidly changing. Nouns is a prime example of this. You’re an open-source brand merging CC0 with blockchain. Nouns demonstrates the imaginative possibilities of combining public interest tools like CC Licenses with emergent technologies. \n\n# Request\n\nDespite being components of longstanding and emerging technologies, CC licenses are hard to fundraise for–most people are unaware that there’s no underlying revenue stream to maintain their legal and tech infrastructure and continue to advocate for their use. The licenses are not new tech anymore, despite constantly being used in fresh ways, and it’s challenging when most funders are more interested in flashy new projects than supporting the work those ventures build on. \n\nWe are dedicated to preserving and improving our licenses, so that they can continue to be the go-to tool for future technology and creative work. That’s why CC is seeking funding for our general operations and license infrastructure, which would allow us to sustain currently underfunded but foundational areas of work: advocating for the use and adoption of open content at all levels and in all arenas, stewarding and innovating the licensing infrastructure we provide, and training future generations of creators and open advocates. \n\nWith support from Nouns, Creative Commons can prioritize the stewardship of the tools that have unlocked access to an estimated 2 billion works over the past 20 years. We are hoping your community will support us, as our work has supported your creativity.\n\n# Proposed Transactions\n\nDue to challenges that arise when Endaoment smart contracts are paired with Nouns proposal duration, this revised version of Prop 329 sends 100 ETH directly to Creative Commons' hosted wallet: \n\n0xf28ed835261b005C490D9d3D9eaADC54d9737d87",
        "title": "Support Creative Commons",
        "id": "349"
      },
      {
        "createdTimestamp": "1690469015",
        "description": "# Integrate 8/8 Anniversary Art 2023\n\nTo celebrate the two-year anniversary of Nouns DAO, we're proud to submit 8 new heads and 2 new accessories for approval and addition to the protocol.\n\nThe 10 traits are creations by Amiyoko, Facu, Goldy, Index, Krel, and Tummlin, a group of six passionate contributors to the noundry community. The group came together with a mission to design, refine, and curate a selection of traits worthy of addition to the Nouns collection.\n\nWe propose to continue the tradition of adding to the Nouns body of artwork on the project's anniversary, August 8. See last year's [art upgrade proposal (125)](https://nouns.wtf/vote/125) for reference.\n\nBelow are the final traits as well as a birds-eye-view of the work that went into creating the selection. Additionally, [this Figma document](https://www.figma.com/file/nVsK03C1B1CjmbipYqiIGY/Noundry-2023-curation-board?type=design&node-id=0%3A1&mode=design&t=Z1HLZIrpLKF0Ei9E-1) functioned as the heart of ideation and alignment throughout the process.\n\n**The Heads**\n![](https://hackmd.io/_uploads/HyKqYz1o2.png)\n\n**The Accessories**\n![](https://hackmd.io/_uploads/BJVF4ekoh.png)\n\n**The Heads (Playground Generated)** \n![](https://hackmd.io/_uploads/HyvY_yJoh.png)\n\n**The Accessories (Playground Generated)** \n![](https://hackmd.io/_uploads/ryrKNeks3.png)\n\n\n**The Design and Refining Process**\n![](https://hackmd.io/_uploads/Sky81oA9h.gif)\n\n**Troubleshooting**\n![](https://hackmd.io/_uploads/H1lUyoC92.png)\n\n**Colour Correcting**\n![](https://hackmd.io/_uploads/B1x8JjCc3.png)\n\n**Final Palettes**\n![](https://hackmd.io/_uploads/SklI1sC5h.png)\n\n**Assets prepared for deployment**\n![](https://hackmd.io/_uploads/S1ASyiAqn.png)\n\n**Playground Testing**\n![](https://hackmd.io/_uploads/B1AuaiC93.png)\n![](https://hackmd.io/_uploads/S10O6jCq2.png)\n![](https://hackmd.io/_uploads/rJR_TsCq3.png)\n![](https://hackmd.io/_uploads/SkC_6oA93.png)\n![](https://hackmd.io/_uploads/B1ROTj052.png)\n![](https://hackmd.io/_uploads/B1ZJ-AC5h.png)\n![](https://hackmd.io/_uploads/Bk0u6sA5n.png)\n![](https://hackmd.io/_uploads/r1eR_6iRq3.png)\n\n⌐◨-◨",
        "title": "Integrate 8/8 Anniversary Art 2023",
        "id": "348"
      }
    ]
  }
}
